export const data = JSON.parse("{\"key\":\"v-2a9a9658\",\"path\":\"/docs/theme-reco/16.%E5%9B%BE%E8%A7%A3HTTP.html\",\"title\":\"图解HTTP\",\"lang\":\"en-US\",\"frontmatter\":{\"0\":\"t\",\"1\":\"i\",\"2\":\"t\",\"3\":\"l\",\"4\":\"e\",\"5\":\":\",\"6\":\"1\",\"7\":\"6\",\"8\":\".\",\"9\":\"图\",\"10\":\"解\",\"11\":\"H\",\"12\":\"T\",\"13\":\"T\",\"14\":\"P\",\"15\":\" \",\"16\":\"d\",\"17\":\"a\",\"18\":\"t\",\"19\":\"e\",\"20\":\":\",\"21\":\"2\",\"22\":\"0\",\"23\":\"2\",\"24\":\"0\",\"25\":\"/\",\"26\":\"0\",\"27\":\"5\",\"28\":\"/\",\"29\":\"2\",\"30\":\"9\"},\"headers\":[{\"level\":3,\"title\":\"◆ 6.4 请求首部字段\",\"slug\":\"◆-6-4-请求首部字段\",\"link\":\"#◆-6-4-请求首部字段\",\"children\":[]},{\"level\":3,\"title\":\"◆ 6.5 响应首部字段\",\"slug\":\"◆-6-5-响应首部字段\",\"link\":\"#◆-6-5-响应首部字段\",\"children\":[]},{\"level\":3,\"title\":\"◆ 6.6 实体首部字段\",\"slug\":\"◆-6-6-实体首部字段\",\"link\":\"#◆-6-6-实体首部字段\",\"children\":[]},{\"level\":3,\"title\":\"◆ 6.8 其他首部字段\",\"slug\":\"◆-6-8-其他首部字段\",\"link\":\"#◆-6-8-其他首部字段\",\"children\":[]},{\"level\":3,\"title\":\"◆ 7.1 HTTP的缺点\",\"slug\":\"◆-7-1-http的缺点\",\"link\":\"#◆-7-1-http的缺点\",\"children\":[]},{\"level\":3,\"title\":\"◆ 7.2 HTTP+加密+认证+完整性保护=HTTPS\",\"slug\":\"◆-7-2-http-加密-认证-完整性保护-https\",\"link\":\"#◆-7-2-http-加密-认证-完整性保护-https\",\"children\":[]},{\"level\":3,\"title\":\"◆ 11.1 针对Web的攻击技术\",\"slug\":\"◆-11-1-针对web的攻击技术\",\"link\":\"#◆-11-1-针对web的攻击技术\",\"children\":[]},{\"level\":3,\"title\":\"◆ 11.2 因输出值转义不完全引发的安全漏洞\",\"slug\":\"◆-11-2-因输出值转义不完全引发的安全漏洞\",\"link\":\"#◆-11-2-因输出值转义不完全引发的安全漏洞\",\"children\":[]},{\"level\":3,\"title\":\"◆ 11.3 因设置或设计上的缺陷引发的安全漏洞\",\"slug\":\"◆-11-3-因设置或设计上的缺陷引发的安全漏洞\",\"link\":\"#◆-11-3-因设置或设计上的缺陷引发的安全漏洞\",\"children\":[]},{\"level\":3,\"title\":\"◆ 11.4 因会话管理疏忽引发的安全漏洞\",\"slug\":\"◆-11-4-因会话管理疏忽引发的安全漏洞\",\"link\":\"#◆-11-4-因会话管理疏忽引发的安全漏洞\",\"children\":[]},{\"level\":3,\"title\":\"◆ 11.5 其他安全漏洞\",\"slug\":\"◆-11-5-其他安全漏洞\",\"link\":\"#◆-11-5-其他安全漏洞\",\"children\":[]}],\"git\":{},\"filePathRelative\":\"docs/theme-reco/16.图解HTTP.md\"}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
