export const data = JSON.parse("{\"key\":\"v-333e98e2\",\"path\":\"/docs/theme-reco/3.%E7%BD%91%E7%BB%9C%E6%98%AF%E6%80%8E%E6%A0%B7%E8%BF%9E%E6%8E%A5%E7%9A%84-%E6%9C%AA%E6%95%B4%E7%90%86%E5%AE%8C.html\",\"title\":\"网络是怎样连接的\",\"lang\":\"en-US\",\"frontmatter\":{\"0\":\"t\",\"1\":\"i\",\"2\":\"t\",\"3\":\"l\",\"4\":\"e\",\"5\":\":\",\"6\":\"3\",\"7\":\".\",\"8\":\"网\",\"9\":\"络\",\"10\":\"是\",\"11\":\"怎\",\"12\":\"样\",\"13\":\"连\",\"14\":\"接\",\"15\":\"的\",\"16\":\"-\",\"17\":\"未\",\"18\":\"整\",\"19\":\"理\",\"20\":\"完\",\"21\":\" \",\"22\":\"d\",\"23\":\"a\",\"24\":\"t\",\"25\":\"e\",\"26\":\":\",\"27\":\"2\",\"28\":\"0\",\"29\":\"2\",\"30\":\"0\",\"31\":\"/\",\"32\":\"0\",\"33\":\"5\",\"34\":\"/\",\"35\":\"2\",\"36\":\"9\"},\"headers\":[{\"level\":2,\"title\":\"◆ 探索之旅路线图\",\"slug\":\"◆-探索之旅路线图\",\"link\":\"#◆-探索之旅路线图\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第1章 浏览器生成消息——探索浏览器内部\",\"slug\":\"◆-第1章-浏览器生成消息——探索浏览器内部\",\"link\":\"#◆-第1章-浏览器生成消息——探索浏览器内部\",\"children\":[{\"level\":3,\"title\":\"◆ 1.1 生成HTTP请求消息\",\"slug\":\"◆-1-1-生成http请求消息\",\"link\":\"#◆-1-1-生成http请求消息\",\"children\":[]},{\"level\":3,\"title\":\"◆ 1.2 向DNS服务器查询Web服务器的IP地址\",\"slug\":\"◆-1-2-向dns服务器查询web服务器的ip地址\",\"link\":\"#◆-1-2-向dns服务器查询web服务器的ip地址\",\"children\":[]},{\"level\":3,\"title\":\"◆ 1.3 全世界DNS服务器的大接力\",\"slug\":\"◆-1-3-全世界dns服务器的大接力\",\"link\":\"#◆-1-3-全世界dns服务器的大接力\",\"children\":[]},{\"level\":3,\"title\":\"◆ 1.4 委托协议栈发送消息\",\"slug\":\"◆-1-4-委托协议栈发送消息\",\"link\":\"#◆-1-4-委托协议栈发送消息\",\"children\":[]}]},{\"level\":2,\"title\":\"◆ 第2章 用电信号传输TCP/IP数据（探索协议栈和网卡）\",\"slug\":\"◆-第2章-用电信号传输tcp-ip数据-探索协议栈和网卡\",\"link\":\"#◆-第2章-用电信号传输tcp-ip数据-探索协议栈和网卡\",\"children\":[{\"level\":3,\"title\":\"◆ 2.1 创建套接字\",\"slug\":\"◆-2-1-创建套接字\",\"link\":\"#◆-2-1-创建套接字\",\"children\":[]},{\"level\":3,\"title\":\"◆ 2.2 连接服务器\",\"slug\":\"◆-2-2-连接服务器\",\"link\":\"#◆-2-2-连接服务器\",\"children\":[]},{\"level\":3,\"title\":\"◆ 2.3 收发数据\",\"slug\":\"◆-2-3-收发数据\",\"link\":\"#◆-2-3-收发数据\",\"children\":[]},{\"level\":3,\"title\":\"◆ 2.4 从服务器断开并删除套接字\",\"slug\":\"◆-2-4-从服务器断开并删除套接字\",\"link\":\"#◆-2-4-从服务器断开并删除套接字\",\"children\":[]},{\"level\":3,\"title\":\"◆ 2.5 IP与以太网的包收发操作\",\"slug\":\"◆-2-5-ip与以太网的包收发操作\",\"link\":\"#◆-2-5-ip与以太网的包收发操作\",\"children\":[]}]}],\"git\":{},\"filePathRelative\":\"docs/theme-reco/3.网络是怎样连接的-未整理完.md\"}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
