<template><div><h1 id="程序员的自我修养" tabindex="-1"><a class="header-anchor" href="#程序员的自我修养" aria-hidden="true">#</a> 程序员的自我修养</h1>
<p>陈逸鹤</p>
<h1 id="◆-第一章-谈职业生涯" tabindex="-1"><a class="header-anchor" href="#◆-第一章-谈职业生涯" aria-hidden="true">#</a> ◆ 第一章 谈职业生涯</h1>
<p>好奇心可能是那些优秀程序员与普通程序员之间最显著的区别之一。优秀程序员们往往不会满足于对手头工作的认识和理解，他们有很强的意愿去了解那些更深入的东西。比如，他们会通过研究公司的框架（甚至是更底层的框架）源代码，去了解它们具体的实现原理和设计思想。这对提升程序员的技术深度是非常有帮助的。</p>
<p>优秀的程序员们也往往非常乐于探索那些看似与工作无关的技术。比如，做后端的程序员去学习前端的技能，前端工程师则去学习UI设计，等等，这些虽不会让他们成为那一个领域的专家，但技术往往是相通的，当你在探索这些新鲜事物的同时，你会发现你原有的技能也得到了提升。</p>
<p>我很支持那些年轻的程序员们坚持去走技术路线，但这不应该成为你排斥与人沟通的理由。你需要与人沟通来获得他人的帮助；你需要与人沟通来建立良好的工作关系；当你的能力不断提升，被赋予更多职责时，你更需要与人沟通来管理好自己的团队，以及与老板或客户进行有效的沟通等。</p>
<p>尝试离开你的电脑桌去与人沟通，相信我，这会给你的工作和生活带来积极的变化。</p>
<p>要为优秀的人工作</p>
<p>环境对一个人的影响是巨大的，而最可怕的是当你身处其中时，很难意识到你正在变得越来越糟。我之前带过一些不错的程序员，他们中的一些人去了一些整体氛围或环境不是太好的公司。过了一段时间后，再次与他们碰面聊天时，我发现他们的思维、观点相较之前并没有提升，有些甚至反而退步了。</p>
<p>我并不鼓励程序员盲目跳槽，但当你发现所在的环境和周围的人已经无法让你获得提升时，不妨学一下我提到的那位设计师，选择一个更好的环境，尽可能与那些优秀的人一起工作。</p>
<p>我希望每个程序员都能明白工作、技术、写代码这些并不是你存在的意义，而生活才是，你需要懂得生活，并且学会生活。</p>
<p>生活：尝试有节制和有规律的生活，程序员生涯绝不是一次冲刺跑，而更像是一场马拉松。你需要合理规划自己的时间分配（学习、阅读、写代码）并持之以恒地去做。另外，不要忽视你的家庭，扮演好你在家庭中的角色，无论你是与父母还是与妻儿住在一起，不要将自己隔离起来，尝试融入其中，做一个快乐有爱的程序员。</p>
<p>睡眠：有很多人觉得睡眠是弱者的表现，他们往往会长时间熬夜，其实我觉得这是一种恶性循环，反而会使你的工作效率变得更低。充足的睡眠往往能使你更有效率地投入到新一天的工作中，你也会变得更有创造力。请记住，保证充足的睡眠将使你变得更加强大。</p>
<p>旅行：去任何一个新的地方都可以称之为旅行，旅行不是为了放松，因为你需要坐飞机、开车、走路，这些都会使你产生压力，但你仍需要去旅行，因为这能让你发现和感受新的东西，而这些是从电脑屏幕上无法获得。</p>
<p>相信自己的天赋和创造力</p>
<p>阅读优秀的书籍：好的想法绝不是凭空产生的，尝试从书中寻找那些能激发你创意和灵感的优秀内容。•记录和收集：尝试用一个小本子，将你转瞬即逝的好想法记录下来，它们可能并不直接有效，但下一个更好的想法可能就是从这些你记录下来的想法中产生的。•尝试动手：光有好的想法是不够的，你需要成为一个有工匠精神的人，通过亲自动手去尝试和实践，你会不断从中得到新的创造力。</p>
<h2 id="◆-二、那些程序员们后知后觉的职涯经验" tabindex="-1"><a class="header-anchor" href="#◆-二、那些程序员们后知后觉的职涯经验" aria-hidden="true">#</a> ◆ 二、那些程序员们后知后觉的职涯经验</h2>
<p>你的薪酬与工作量无关</p>
<p>你的薪酬其实取决于很多因素，技术能力、经验资历、工作量等，但最本质的却是，你对公司是否重要，换句话说你是否容易被取代。</p>
<p>尽可能持续做一件事</p>
<p>既然你对于公司的价值来自于你的不可替代性，那又该如何有效提升它呢？我的建议是尽可能持续做一件事。</p>
<p>有时候你所做的工作并非你个人所能决定，但你仍需要有意识地去主动把握那些能让你持续积累技术或项目经验的机会。</p>
<p>技术深度及完整项目经验的重要性，如果你总是在跟随那些新出现的技术和框架，那你很难在某一项技术上达到理想的深度；同样，在一个公司里，如果你总是在更换项目，那你也很难提升自己的价值。参与10个项目，不如完整参与一个项目。持续做一件事是要你把每一件事做透、做好，而不是蜻蜓点水，浅尝辄止。</p>
<p>唯一不变的就是变化本身</p>
<p>对于程序员来说，所谓的100小时定律同样重要——花100小时学习或修炼一门新的技术，往往就能超过一般人很多。你需要提升自己快速学习的能力，当你学得越多，往往就能够学得越快，因为知识之间总是存在关联性。</p>
<p>你的右脑将是你成功的关键</p>
<p>谈到那些我们眼中非常成功的技术大牛、IT高管，都会出人意料地将一些非技术能力作为自己获得成功的关键。比如，编写文档或做PPT的能力、演讲的能力、说服他人的能力，等等。</p>
<p>我所能感受到的最近一次较大的提升，恰恰来自于自学设计。并不是说我的设计能力达到了很高的程度，而是当我学会以一个设计者的视角去分析和解决问题时，我的思路就得到了很好的扩展，这使得我既可以用左脑来想出那些技术方案，也可以用右脑来为用户提供更人性化和具备良好用户体验的设计方案。</p>
<p>作为一名程序员，我该如何锻炼我的右脑呢？是不是一定要学习设计或者一门乐器之类呢？完全不需要，在工作中你就可以找到很多途径来提升你运用右脑的能力。比如，在你编写一个文档或PPT时，除了内容之外，能否再多考虑一下字体和排版，让人读起来更加舒服呢？在你与用户讨论需求时，能否尝试着从程序员思维转换到用户的角度来看待问题呢？在团队内部开会时，是否能提前做些准备，多争取在大家面前进行讲演的机会呢？当你持续这么去做以后，你会发现自己在各个方面都会变得越来越好，这其中也包括了你的编程能力。因为，这些技能总是在你看不见的地方互相作用和促进的。</p>
<p>很多程序员会诉苦说他们遇到的产品经理、PM、设计师、用户甚至是其他程序员有多么地烂，与他们一起工作简直像是与一群蚊子在一个房间里搏斗一般，让人感到抓狂，他们更希望能够一个人安安心心地编程。当你是一名初级程序员时，你的工作可能会比较单纯——编程。然而，随着你能力和职位的提升，你会被赋予团队中更加重要的角色，比如，架构师、团队负责人、项目经理，等等。</p>
<p>不要总是单打独斗，要学会在团队中协作，并尽可能让优秀的人围绕在你身边，这将扩展你的能力范围，让你变得更加强大。</p>
<p>那些优秀的程序员无时无刻不在体现他们的能力，从轻松地解决技术难题，到会议上提出被一致认可的解决方案，以及他们写出的那些优雅且完善的代码，这些都让他们显得与众不同，仿佛是天生的优秀程序员。但我想说，他们其实都是那些努力并使用了正确方法的人。程序员的能力来自于大量的编码实践，以及持续学习的能力和勤于思考的习惯。任何自作聪明，不懂装懂，以及投机取巧在明眼人看来都只会是东施效颦，显得如此微不足道。</p>
<h2 id="◆-三、如何招到一名靠谱的程序员" tabindex="-1"><a class="header-anchor" href="#◆-三、如何招到一名靠谱的程序员" aria-hidden="true">#</a> ◆ 三、如何招到一名靠谱的程序员</h2>
<p>简历看人</p>
<p>好的简历一定是正确、清晰并且能够体现候选人最有价值一面的。我首先会过滤掉那些包含错别字，文句不通或没有逻辑性的简历，因为如果一名程序员连自己的简历都不愿意去仔细检查并完善的话，很难想象他写出来的代码质量会如何。接着，我会重点阅读简历中的项目经验部分，在这里我能够看到面试者的开发经验，技能栈，并且判断他们熟悉的技术框架、工具是否与目前公司的要求相匹配。</p>
<p>你需要用尽可能简练的文字来描述项目的背景，你在项目中承担的角色、参与项目的时长，你用到的技术，以及你在项目中的亮点等信息。优秀的程序员们往往善于归纳，并能够一针见血地发现问题或把一个问题说清楚。我经常看到面试者在简历中像写故事一般地描述他们的项目经历，光这一个章节就有好几页，虽然这看上去很详细，但其实这样反而会给你减分，因为这会让面试官判定你缺乏必要的归纳能力。</p>
<p>还会关注你的一些与编程有关的社会化活动，比如，你在GitHub上的开源项目，在知乎、V2EX中给他人的解答，以及你的个人技术博客等都会给你加分，因为这说明你对所从事的工作有着极大的热情，并愿意在业余时间去学习和提高自己。如果你要成为一个领域的专家，那你必须花费超过10000小时，而这光靠工作时间是远远不够的。</p>
<p>给面试者10分钟介绍自己最擅长的</p>
<p>更愿意给面试者10分钟时间，让他介绍自己最擅长和最感兴趣的领域。这往往能帮助我很快做出下面的判断：•这个人对他所做的事情是否充满激情。•他是否能在自己的团队中有效地进行沟通。•他是否在自己的专业领域足够擅长。•你的团队是否会乐于和这个人一起工作。</p>
<p>基础打牢了吗？</p>
<p>下面是我经常会问的几个问题（Java）：</p>
<p>•HashTable与HashMap有什么区别？</p>
<p>•Servlet是线程安全的吗？</p>
<p>•JSP中@include跟jsp:include的区别。</p>
<p>•HTTP的response code 403和500分别代表什么？</p>
<p>我们现在做项目时都会大量使用框架，这能使我们的开发效率和质量都得到提升和保障，但同时也降低了对于程序员开发技能的要求。因此我一般会询问面试者下面的问题，来考察他对所使用的框架的掌握程度：</p>
<p>请你描述一下，在这个项目中，从一个HTTP请求发起，到最终的Response返回，它在你的系统和框架内部是如何流转的？</p>
<p>除了技术层面上的考察之外，对于资深开发人员，还需要考察他们的设计能力。</p>
<p>考察他们的面向对象设计能力：请用一段程序代码描述我们所在的这间房间。</p>
<p>我惊讶地发现至少有一半的面试者都很难准确使用Interface和Class来给房间建模，也有一些人会将最基本的代码语法或关键字写错。</p>
<p>选择适合所在企业文化的人这一点也曾是我经历的一个误区，我总是希望能为团队招到技术能力最强的人，而忽略了他是否与整个公司和团队的文化相匹配。这往往会造成，虽然招到了人，但没过多久就因为理念不同不欢而散的结果，反而给公司带来了损失。让我们看看GitHub的负责人是怎么说的：</p>
<p>行为面试法可能是我在整个面试过程中唯一用到的教科书面试方法。一名程序员是否能够很好地工作，不仅取决于他能否顺利地完成开发任务，更重要的是在遇到一些特殊场景或问题时，他能否合理有效地处理和解决。</p>
<p>请谈谈你在这个项目中遇到的最大困难或挑战是什么，你是如何解决的。从面试者对上面这个问题的回答中，我能够很好地判断他是否有较强的独立解决问题的能力，而我认为这是除技术能力之外，程序员最应具备的能力。</p>
<p>在你确定是否录用他们之前，可以给他们一个虚拟任务。我不是说一个抽象的程序问题，而是指一个真实的，可能就存在于你当前项目中，并且需要在一两个小时之内完成的一个开发任务。我曾经出过这样的考题：写一个小程序：将一个以特定格式（如CSV）存储的文本文件转换为XML格式，并存储为另一个文件。</p>
<h2 id="◆-四、每个程序员都应该了解的一件事" tabindex="-1"><a class="header-anchor" href="#◆-四、每个程序员都应该了解的一件事" aria-hidden="true">#</a> ◆ 四、每个程序员都应该了解的一件事</h2>
<p>我的文档写得特别好。我的口才很好，总是能成功说服别人。我的PPT做得非常棒，是公司里数一数二的。我写过几篇很受欢迎的技术文章。我热爱开源文化，并在社区里很有名气。</p>
<p>但为什么在他们眼中这些还不足以使他们达到现在的高度，反而是那些不起眼的写文档、做PPT、演讲等这些技能使他们能够在一次次竞争中胜出，并成为了我们中的佼佼者呢？其实在我看来，他们所谓的这些秘籍，都可以归纳为一种能力，那就是自我营销。只有具备了这个能力，你才能脱颖而出获得成功，这一点对程序员同样适用</p>
<p>我的这个观点可能会令很多程序员感到有些沮丧，因为和曾经的我一样，他们热爱写代码，并愿意以此作为终生的事业。甚至有些人是由于自己内向的性格才选择当程序员的，但你需要明白，你写的代码可能毫无用处，直到：•人们理解你在做什么。•人们对你所做的事情感兴趣。•人们为你所做的感到兴奋和激动。</p>
<p>大多数刚走出校门的年轻程序员们绝不会把“自我营销”作为一项自己需要具备的技能来关注和学习。他们往往一头扎进自己所热爱的某一个技术领域里，不断追求着更高的技术水平。我个人其实非常推崇具有这种精神的年轻程序员，正如我经常提到的10000小时定律，那些能够在某一领域获得成功的人都需要花费至少10000小时的努力，而对于普通人来说，你的努力也的确与你所能获得的成就是成正比的。既然这样，那为什么我们还需要学会自我营销呢？答案是：自我营销往往能够有效地放大你所做的努力，并且在你成功的道路上起到催化剂的作用。尽早地获得成功对于我们这一代程序员来说异常关键，因为这个世界上有许多与你一样努力的人，但有些人在最佳的时间点获得了成功，而另一些人虽然也通过努力达到了相同的能力，但错过了那个正确的时间点，从而走上了一条完全不同的道路。</p>
<p>那么对于程序员们来说，又有哪些能够提升自我营销能力的方法呢？下面便是我的一些建议。</p>
<p>1．读与技术无关的书</p>
<p>我刚毕业后的两年时间里买过很多技术类书籍，这帮我打下了良好的技术基础，后来我就不再买技术书了，因为我发现学习技术的最好方式是在互联网上，那里有最新的教程、文档和资源。因此，我建议只买一些经典的技术书籍来帮你打基础，然后从网上去学习一切新的东西。</p>
<p>我尤其鼓励大家去读那些与技术无关的书籍。程序员不善于自我营销，其中一个重要原因是他们自身所掌握的知识体系太过于单一，很难跳出技术范畴与人交流，并引起别人的兴趣和认同。你可以读任何历史、经济、人文、艺术类的书籍，它们都能够帮助你丰富自己的知识和思想，使你变得更加全面和完善，而这反过来，又能帮助你建立信心。</p>
<p>当然，你还可以读一些优秀的人物传记，从他们身上你可以获得成功或失败的经验，并且完善你自己的人格。我是在自学设计的那段时间里读了《史蒂夫·乔布斯传》的，我从没见过哪个人像乔布斯那样，对自己所从事的事业和创造的产品达到几近疯狂的地步。他的这种追求完美，对产品的设计和质量的苛求态度，都让我印象深刻，并对我日后的工作行事产生了积极的影响。</p>
<p>2．会写文档</p>
<p>3．学会包装</p>
<p>•知道什么是美的（优秀的）。</p>
<p>•精心制作。</p>
<p>这个想法来自于最近参加的一次保监会关于偿付能力改革的会议，整个方案是由普华永道提供咨询和实施的。会上他们的高级经理通过一个长达114页的PPT介绍了项目的背景、技术细节、实施方案等信息，整个PPT制作得非常精良，内容组织也很有条理，让人一目了然，顿时使大家对整个项目团队产生了很好的印象。可以说普华永道通过一个精心制作的PPT完成了一次非常有效的自我营销。</p>
<p>4．尝试多讲</p>
<p>讲话一直是很多程序员的硬伤，当然这也曾是我的硬伤。根据我的经验，你需要跨过以下两个障碍：</p>
<p>•敢说。</p>
<p>•让说的和你想的一致。</p>
<p>我经常看到一些程序员，他们平时跟熟悉的人都能很好地交流，而一旦到了会议上，特别是有老板或客户在场的情况下，就变得难于开口。程序员的性格特点大多是内敛含蓄的，在一些正式的场合他们会显得对自己缺乏信心。这需要通过平时多锻炼来克服，你应该在还处于职业生涯的初级阶段的时候，就开始有意识地锻炼讲话的能力，特别是在一些不那么重要的会议上，一方面你说出一些不那么准确地意见时，不会产生太严重的后果，另一方面你又可以很好地锻炼自己的表达能力。程序员遇到的另一个问题是，他们所讲的常常不能真实反映自己所想表达的意思。通过创造机会多讲，你才能更好地掌握使用语言的能力，通过不断的总结，你很快就可以非常流畅地表达自己的想法了。</p>
<p>5．建立社会化联系</p>
<p>•通过这些社会化的活动能够使你的想法和技能更加完善。</p>
<p>•能够使你建立权威，你的技术博客，在一些社区上的技术问题解答，以及你的开源项目等都会使人认为你是这方面的专家。</p>
<p>•同样，你也可以获得他人的帮助，来解决棘手的难题。</p>
<p>•你可以找到与你有相同兴趣的人，一起做有趣的事情。</p>
<p>•你的社交网络将因此扩大，这意味着你所获得的机会将会更多。</p>
<p>我本人就是这方面的受益者，我刚毕业时在一家建筑软件公司工作，做的是Delphi开发，但我很快意识到互联网才是未来的方向，因此我自学了Java，并开始以Java软件工程师为目标，去寻找工作。但由于没有任何项目经验，我经常碰壁。一次偶然的机会，我看到BEA Dev2Dev（BEA被Oracle收购后，这个网站已经关闭了）有接受技术类文章投稿的信息，我马上连续写了两篇技术自学类的文章，并很顺利地通过了审稿，不久便在Dev2Dev发布了。我将我的这两篇文章链接写入了我的简历中，之后，我很明显地感觉到让我参加面试的电话明显比之前多了起来了，我也很快通过了一家外资软件公司的面试，成了一名Java工程师，从此走上了事后看来更理想的职业道路。</p>
<p>如果，你并不想仅仅是一名程序员，那么你只需要在潜意识中埋下一颗“自我营销”的种子，让它跟随着你慢慢成长，相信我，你的未来将会因此产生很大的不同。</p>
<h2 id="◆-五、程序员的烦恼" tabindex="-1"><a class="header-anchor" href="#◆-五、程序员的烦恼" aria-hidden="true">#</a> ◆ 五、程序员的烦恼</h2>
<p>买房本身并不会给你带来持久的快乐，因为当你买完房后，你会欠一大笔债，需要用几十年才能还清；当你终于把欠款还清时，你又会觉得这套房子太小，已经不够一家人住，需要换一套更大的房子。你不会得到快乐，因为这些客观条件（钱财、房子）总是无法与你的主观期望相符。相反地，如果买房能够给你的家庭带来更稳定的生活，为孩子提供更好的成长环境，而这一切都能为你的生活赋予意义，并让你感到更加快乐的话，那你还是应该更坚定地留下，而非选择离开。</p>
<p>我时常会说“杂事不杂”，虽然看着被很多与技术无关的事务缠身，但它们对你来说同样具有意义。你从中可能获得沟通能力、管理能力、建立更广的人脉，在企业内部建立影响力，等等，之所以今天你能成为公司的骨干不也正是因为你干了这些杂事吗？如果你能认同这一点，那就不应该总是把时间花在抱怨这些杂事上，而是考虑如何更有效地处理它们。比如，你需要负担很多培训工作，那何不建立一个更好的内部学习平台，让培训对象能够进行自学呢？你需要反复向用户解释系统的使用方法，那何不完善系统的使用说明，让用户更愿意先自己去解决问题呢？你不应该总是陷入在那些处理杂事的循环往复之中，跳出来，创造更好的方式去解决它们才是应对之策。</p>
<p>很多程序员在工作中使用的技术都非常单一，比如，只用一种语言来写代码，只写前端或后端的功能。他们很希望能够学习诸如游戏开发、VR开发等新的技术。我总是很鼓励身边的程序员们去涉猎不同的技术甚至领域，但前提是你必须首先对某一门技术做到精通。技术是需要深耕的，深入学习一门主流的开发技术，并不断提升编程思维，比对很多技术栈都浅尝辄止要好很多。因此，如果精力有限不妨先学好一门技术，你会发现之后再去学习其他技术会变得容易许多，因为它们之间往往都是相通的。</p>
<p>如果你真的没有任何思路，只是希望你学的这门编程语言能够有用，我的建议是JavaScript，因为它看起来是唯一可能在未来所有领域内得到应用的编程语言，从我们的移动设备，到传统的Web应用，再到服务器端开发甚至是硬件编程，它几乎无处不在。</p>
<p>6．大专学历，能进大公司吗？</p>
<p>例外情况：</p>
<p>•通过内部员工的推荐。</p>
<p>•通过外包公司进入后，再转为内部员工。</p>
<p>•努力成为某一领域的专家，或者建立个人影响力。</p>
<p>如果你还是一名大专在读学生，那么我希望你不要过早焦虑，尝试问问自己除了学历之外还有什么让你能够脱颖而出的东西？是否有自己的个人项目？是否为知名的开源项目贡献过代码，甚至只是参与编写文档？是否通过写博客阐述过自己的独到观点，并得到大家的认可？在哪家公司实习过？这些都可能抓住雇主的眼球，从而弥补你在学历上的不足。</p>
<p>把某一门编程语言的基础打牢，然后尽可能地做出一些实际的项目。比如，选择应用比较广的Java语言，然后结合Android的开发做一些小的APP应用，并将它们放到自己的GitHub里。有机会的话去初创公司实习，即使一开始没有工资，但能学到很多实践经验。相信那样在毕业时，你就能具备不错的竞争力，因为我们在挑选应届生时，往往更喜欢那些基础牢固、具备优秀思维能力，并且乐于动手的年轻人。</p>
<h2 id="◆-六、提给年轻程序员的职涯建议" tabindex="-1"><a class="header-anchor" href="#◆-六、提给年轻程序员的职涯建议" aria-hidden="true">#</a> ◆ 六、提给年轻程序员的职涯建议</h2>
<p>尽早确定自己想做的事情——你的职业目标，意味着你可以获得比其他人更多的时间去努力。我们中的绝大多数都不是天才，因此所能达到的成就，也就往往与你为达成这一目标所付出的时间成正比了。</p>
<p>2．10000小时定律</p>
<p>提高工作效率</p>
<p>在工作中，我们经常会看到这样的场景，甲、乙两个员工，领导布置了类似的工作，甲员工非常努力，加班加点按时交付了领导布置的工作，而乙员工做得很快，在很短时间内便完成了，一到下班就回家去了。那么作为老板，会如何评价这两位员工呢？我想他一定会认为甲是一个好员工，但乙员工的潜力更大，值得花更大的力气去培养。</p>
<p>对于提高工作效率，我有以下两点建议：•加快工作节奏。•借助工具完成工作。</p>
<p>我们往往会以自己觉得舒服的节奏来工作，但如果我们能够不断尝试加快我们的工作节奏，便能极大地激发自己的潜能，有效提升自己的工作效率。</p>
<p>借助工具完成工作：像Google、Facebook这样的大型互联网公司的员工之所以有那么高的工作效率，其中一个重要原因，便是他们善于运用和创造工具，大部分重复的劳动都是通过工具来完成的。同样，我们也需要时常审视自己的工作，哪些是让你头疼的重复劳动，怎样才能使用工具来帮你完成。当我们有了这样的意识，我们自然会去尝试寻找或创造一些工具来使自己从繁复的工作中解脱出来，变得更加高效。</p>
<p>国外有一个词，叫作PKSS（PK Saturday and Sunday），也就是说在周六和周日进行比拼。爱因斯坦也曾说过：人的差别在于业余时间。特别是在当今这个竞争社会，持续学习对每一个职场人都显得尤为重要。每晚抽出两个小时，周六周日抽出4～6个小时来阅读、学习、思考或参加有意义的演讲、讨论，你会发现，坚持数月之后，你便会超过周围的人。</p>
<p>有些人可能觉得工作时用到的技能就这些，我们需要学些什么呢？我的建议是既要“专”，又要“博”。现代社会要求的是T型人才，也就是有一技之长，又能有其他相关技能。如果说你在某一个领域花10000小时，能使你在这个领域成为一位杰出人物的话，那么不妨尝试在你感兴趣的其他领域花100小时学习。比如，花100小时学习素描，完成后你的绘画水平能够远远超过那些从来没有学习过的人。因此，除了在你专注的领域投入时间学习之外，尝试学习任何你感兴趣的其他东西，比如，烹饪、写作、摄影，等等。知识往往是相通的，你学得越多便学得越快，对我而言，摄影、写作等技能也都能够对我所从事的软件开发有很好的促进作用。</p>
<p>学会控制情绪</p>
<p>那么如何才能提高自己的情绪控制能力呢？一个简单的方法就是做到对事不对人。当你对某一件事非常气愤时，首先，你需要问问自己发火有没有用，如果答案是否定的，那么为什么不静下心来想想怎样去解决问题呢，其次，你需要有同理心，多站在对方的角度和立场考虑问题，即我们常说的换位思考，你会发现很多时候对方不是故意为难你和与你作对，而是也有他的考量和存在的现实问题；最后，你也应该有一些自己的情绪宣泄方式，比如，与朋友聊天、练习书法、看电影等，都是不错的释放方式。</p>
<p>让最优秀的人围绕在你身边</p>
<p>苹果、谷歌、百度这些科技巨头，之所以能够不断地进行创新，一个重要的原因是，它们汇聚了世界上最优秀的人才，他们有着共同的兴趣和目标，聚集在一起形成了很多优秀的团队，从而创造出一个个令世界惊叹的产品和技术。</p>
<p>他以前曾经是一名Cobol程序员，转行做咨询后，由于个性羞涩，不善与人交往，一开始也是很怕做公开演讲，但他的老板发现他的问题后，特意安排他每天下班前，在公司内部公开做一次演讲来讲述他当天的工作内容，没过一个月，他发现自己竟然也能非常自信且自如地在众人面前进行演讲了。</p>
<p>如果你也是一个性格内向，不善与人交往的职场新人，那么不妨也学学那位咨询师，自己创造机会进行训练，比如每天模拟进行一次讲演，经过一段时间，你会惊讶于自己所取得的突破。</p>
<p>掌握英语</p>
<p>我在Stackoverflow上查找开发问题，我用GitHub管理代码库并和来自世界其他国家的程序员一起维护开源项目。我也在Dribbble上浏览优秀的UI设计作品以获得设计灵感，我还在Freelancer上，做一些感兴趣的兼职项目。</p>
<p>当然，你应该出去旅行，因为你需要去发现新的东西，而不是因为你需要放松。</p>
<h1 id="◆-第二章-谈实践与认知" tabindex="-1"><a class="header-anchor" href="#◆-第二章-谈实践与认知" aria-hidden="true">#</a> ◆ 第二章 谈实践与认知</h1>
<p>程序员们其实是依靠他们所特有的程序员思维在进行编程，而他们中的佼佼者正是那些有着更高思维成熟度的优秀程序员们。</p>
<p>•长期不间断地编程实践。•持续地学习与借鉴（参考）。•学会反思，并像专家一样思考。</p>
<p>突破程序员思维</p>
<p>新一代的程序员不仅需要具备很强的编程能力，同时还需要具备从设计、运营、测试等各种不同角度去进行分析和判断的能力。</p>
<p>多年的开发工作，使程序员们不自觉地首先想到如何用技术手段去解决问题，然而，真正优秀的程序员一定善于透过技术发现问题的本质</p>
<p>要做到看清问题的本质并像专家一样给出意见，其实并不简单，这不仅需要你具备极强的技术功底，更需要你对问题所涉及的相关领域有足够的认识。你必须通过大量地学习编程之外的各种知识来完善自己的知识体系，并从中获得不同的视角。</p>
<p>找回创造力</p>
<p>有很多方法都能让我们找回创造力，关键是你是否愿意坚持那样去做。而我的方法也很简单，每天进行阅读，每周写一篇博客记录自己想到的东西。</p>
<p>另外，我也有一本小本子用来记录那些转瞬即逝的想法，虽然有些看起来是那么不切实际，但我都会把它们记录下来，没事的时候就去翻翻，这个过程中我可能会得到一些不错又可行的新点子，然后，我再尝试着花些时间把它做出来。虽然，它们中的大部分都不会产生什么实际价值，但我知道下一个优秀的创意或想法，可能就来自于它们。</p>
<h2 id="◆-二、全栈工程师如何快速构建一个web应用" tabindex="-1"><a class="header-anchor" href="#◆-二、全栈工程师如何快速构建一个web应用" aria-hidden="true">#</a> ◆ 二、全栈工程师如何快速构建一个Web应用</h2>
<p>如果你问10个全栈工程师，如何快速构建一个Web应用，我相信你会得到10个不同的答案，因为每一名全栈工程师的技术栈都不尽相同。</p>
<p>以设计见长的全栈设计师可能会告诉你，做一个很好的设计，然后套用一个博客系统或基于CMS的内容管理平台（如Drupal、Jommla、Wordpress）就可以快速建站；而前端全栈工程师可能会建议用HTML5+JavaScript（AngularJS或React）来写网站的前端，用Node.js来写后端服务。我最早是一名Java程序员，后来当了架构师，又自学设计，成为了一名全栈工程师。因此，我会更偏向于使用Java来构建稳定且易于扩展的后端服务，而用HTML5+CSS3+JavaScript，再结合一些流行的前端框架来快速写出一个Web应用来。当然，这绝对不是唯一或最优秀的技术组合，你需要根据不同的应用场景和你自身的专长来进行合理的选择。</p>
<p>网站开发的各个重要阶段（网站定位、功能设定、设计、架构、开发、部署、性能调优、数据统计、开发工具）</p>
<p>快速搭建出一个具备核心功能的应用原型——MVP（Most Viable Product，最小化可行产品），来验证自己的业务模型，然后再根据用户的需求和反馈来不断进行改进。</p>
<p>仅当确认文档能够产生价值时，才去编写它们。</p>
<p>对于我们这个小站来说，我们只需要先定义出合适的业务领域和实体模型。这里，我们定义出以下3个业务实体，并为这些实体添加所需要的字段：•User（用户）。•Resource（资源）。•Feedback（用户反馈）。</p>
<p>围绕着这3个领域模型，我们再定义出3个服务，并为它们增加相应的方法：•UserService（用户服务）。•ResourceService（资源服务）。•FeedbackService（用户反馈服务）。</p>
<p>现代网站设计工具（比如Blocs）</p>
<p>在做技匠社网站时，用Sketch所做的一个资源详情页面的设计。</p>
<p>AngularJS能满足我在全面性方面的要求，我可以使用它的Controller、Service、Directive等特性来构建出一个完整的Web应用。</p>
<p>Spring Boot：开发基于REST的服务，使用JSON作为数据交换格式。•MyBatis：提供基于SQL的持久层支持。•Redis：由于采用了前后端分离的做法，我用Redis来持久化用户Session信息。•Spring Security：提供安全方面的支持，能与SpringBoot无缝整合。•MySQL：在这个项目中我仍然使用了传统的关系型数据库。•Maven：项目的包依赖管理，以及项目打包。</p>
<p>•前后端分离之后，如何进行Session的管理。•如何实现安全的跨域请求。•在Spring Boot中如何整合MyBatis框架。•如何利用Spring Security来构建安全的REST服务。•如何利用云服务实现图片的上传与处理。</p>
<p>使用YSlow等工具是一个不错的选择，它能告诉你网站加载缓慢的原因，并给出优化的建议。</p>
<p>下面是一些常见的优化方法。•合并压缩静态文件：将JavaScript、CSS文件进行压缩（去掉不必要的空格、换行和注释）与合并（将多个CSS或JavaScript文件合并成一个文件），并使用GZIP进行压缩，可以提高网站的加载速度。•使用前端镜像库：对于网站中用到的第三方字体和前端代码库，我通过360和百度的前端镜像站点来获取，这样可以降低网站本身的流量开销，也可以提高网站的整体加载速度。•利用云存储和CDN进行加速：技匠社的资源分享具备图片上传功能，而图片是最占带宽的，3M的带宽根本支持不了几个用户的同时访问。因此，我选择使用了七牛云，我将用户上传的图片通过七牛云的API传到七云存储空间内，并直接利用它的CDN对这些静态资源进行加速，这样一来网站的图片及那些静态文件（我们将那些不会频繁修改的JavaScript、CSS等都放到了CDN上）就不会占用阿里云的带宽了。另外，不得不说七牛云的价格对于个人用户或初创企业来说还是比较优惠的，比如，10GB空间以内的存储都是免费的。</p>
<p>你只需要在百度统计中注册一个账号并加入你的站点，然后在你的网站头部加入一小段JavaScript代码就能实现最基础的网站统计功能了。</p>
<p>CodeKit可自动编译Less、Sass、Stylus、CoffeeScript、Jade &amp; Haml等文件，为JavaScript提供合并、压缩及错误检查，还可以优化JPEG和PNG图片，并为用户提供一个本地的测试环境。当然，你也可以不使用任何工具，直接通过Grunt或Gulp的插件去实现所有这些功能。</p>
<p>Sketch是我目前最常使用的设计工具。它只有几十兆，相较于Photoshop，它小巧得多。</p>
<p>能够快速构建出一个Web应用或APP是全栈工程师的核心竞争力，这也是为什么那么多初创公司都在寻找全栈工程师的原因。</p>
<h2 id="◆-三、如何成为一名优秀的全栈工程师" tabindex="-1"><a class="header-anchor" href="#◆-三、如何成为一名优秀的全栈工程师" aria-hidden="true">#</a> ◆ 三、如何成为一名优秀的全栈工程师</h2>
<p>他把全栈工程师定义为对性能影响有着深入理解的技术通才。</p>
<p>我认为全栈工程师应该同时是一位资深开发工程师、架构师，以及具有敏捷开发技能的程序员。</p>
<p>试想当一个很好的创意出现时，你可以一个人或主导一个团队去实现并不断完善它，这是一件多么让人兴奋的事啊！</p>
<p>•全局思维与技术前瞻性</p>
<p>初创公司往往资金有限，而一名优秀的全栈工程师能够帮助初创公司用最低的代价与最短的时间推出自己的产品。</p>
<p>[插图]</p>
<p>你应该将自己的精力聚焦在关键开发技能，以及一些必须掌握的附加技能上。</p>
<p>至少一门编程语言——你需要精通至少一门编程语言，如Java 、PHP、Swift、C#、Python、Ruby、Perl等，因为你的大多数核心业务处理都需要用这门语言来写。你既要掌握这门语言的语法，又需要非常熟悉如何基于这门语言进行项目的架构、设计、实现及测试。如果你选择的是Java，那么你就需要掌握面向对象的设计和开发、设计模式的应用、基于J2EE各个组件的开发，等等。</p>
<p>Java的Spring、MyBatis、Hibernate，Python的Django，PHP的thinkphp、yin，nodeJs的express，等等。</p>
<p>熟练使用这些开发框架或第三方库能够避免重复发明轮子，从而使你的工作事半功倍。更重要的是这些优秀框架或第三方库一般都得到持续的维护，是对你的产品或项目在质量与安全方面最有效的保障。</p>
<p>你至少需要掌握HTML5、CSS3、JavaScript等基本前端技术，同时进一步学习JQuery、LESS、SASS、AngularJS或REACT等前端框架或第三方库。</p>
<p>MySQL、MongoDB、Redis、Oracle、SQL Server</p>
<p>我要说的是，对于将持续学习作为一种生活习惯的人来说，学习新东西并不会成为一种负担，反而是一种乐趣。</p>
<p>优秀的全栈工程师需要走出去</p>
<p>参加技术大会——InfoQ、CSDN、GITC、优设、TED等网站都会定期举办各类技术大会。</p>
<p>做公开演讲——全栈工程师作为团队的核心成员，他一定需要在团队内部做技术、管理等方面的演讲。如果你是一个乐于分享的技术达人，那么也可以尝试录制个人课程（视频或音频），并在慕课、网易课堂、优酷，或荔枝、喜马拉雅等各种媒体上分享自己的技能和知识。不要因为自己并不是专家就不愿尝试，相信我，你用心制作的内容，会获得大家认可的，并收获一大批粉丝的。</p>
<p>个人博客——每天进步一点点，一年以后你便会获得质的飞跃。</p>
<p>参加线下活动——</p>
<h2 id="◆-四、为什么每个程序员都应该学习使用命令行" tabindex="-1"><a class="header-anchor" href="#◆-四、为什么每个程序员都应该学习使用命令行" aria-hidden="true">#</a> ◆ 四、为什么每个程序员都应该学习使用命令行</h2>
<p>在很长一段时间里，我每天上班的流程基本都是一样的：早上来到公司→打开电脑（启动Windows）→打开Eclipse（我是一名Java程序员）→写一天代码（期间我通过IDE集成的Tomcat服务器来调试我的应用）→下班前通过Eclispe的插件把修改过的代码提交到SVN代码仓库中→下班回家。</p>
<p>你可以使用NPM（Node Package Manager）来安装几乎所有的前端第三方工具或开源库。•你可以使用SASS、LESS这样的预处理工具，来大大降低CSS的编写难度，并使代码更加易于维护。</p>
<p>你还可以使用Grunt、Gulp这类基于任务的处理工具，进行从代码、测试到部署的整套自动化流程。</p>
<p>还有其他很多优秀的工具或库，如Jade、CoffeeScript、Express.js，它们都能在某个领域为你提供极大的帮助。</p>
<h2 id="◆-五、重构——系统改善之道" tabindex="-1"><a class="header-anchor" href="#◆-五、重构——系统改善之道" aria-hidden="true">#</a> ◆ 五、重构——系统改善之道</h2>
<p>系统比喻成一辆车，你需要经常对它做维护和保养，才能保证它</p>
<p>1．从构建工具开始</p>
<p>统重构的第一步便是引入构建工具或重写构建脚本。</p>
<p>•引入构建工具：对于后端Java程序来说，我最常使用的便是Groovy，目前也开始尝试使用Gradle。而对于前端来说Grunt或更新的Gulp都是不错的选择。•第三方包依赖与版本管理：通过定义全局属性文件的方式，如定义系统的版本号、名称等信息，并在构建脚本中明确定义引入第三方包的依赖关系与使用的版本，从而使整个开发团队都能使用统一且标准的开发环境。•实现自动化：通过定义不同的Target（注：Groovy中的一个任务称为Target），来实现不同的目标。比如，增量编译与本地部署、自动化测试、打全量版本包，等等。总之，将一切需要手工完成的任务，都利用工具去帮你完成。•写入开发手册：将构建工具的使用，不同Target针对的不同应用场景写入开发手册，能够有效降低新人的学习成本，并使整个团队的开发效率得到提升。</p>
<p>我们重构的目的往往是去解决系统的某些痛点，这些痛点也往往是系统的核心功能，因此，在你改动代码之前，需要详细分析修改可能造成的关联影响。下面是我在做关键功能重构时所采用的步骤：•详细Review该功能的需求。•针对需求，完善自动化单元测试案例。•将这部分单元测试的执行引入到每次自动化构建中。</p>
<p>微服务并非是一个全新的架构方法论，而是对SOA——面向服务架构的一次升级。它的出现源于云计算、容器技术、DevOps等技术，以及全新运维理念的不断成熟。</p>
<p>在技术层面，虽然业界已经出现了多个支持微服务的架构，但是我们选择的是Spring Boot，主要是因为它的背后有Spring团队强有力的技术支持与维护。我们的重构也很简单：•服务识别。•UI与服务的剥离。•构建服务。</p>
<h2 id="◆-六、程序员也该懂得-这样就好" tabindex="-1"><a class="header-anchor" href="#◆-六、程序员也该懂得-这样就好" aria-hidden="true">#</a> ◆ 六、程序员也该懂得“这样就好”</h2>
<p>要避免过度设计其实也很简单，要做到多看（看那些优秀的系统是如何设计类似功能的），多想（站在用户的角度去想他们所提需求背后真正的痛点和问题是什么），多做（不要只停留在需求文档上，应做出能够验证需求的功能原型然后不断确认和改进），多说（在每一个阶段都与用户保持有效的沟通）。</p>
<h2 id="◆-七、走出软件开发法则" tabindex="-1"><a class="header-anchor" href="#◆-七、走出软件开发法则" aria-hidden="true">#</a> ◆ 七、走出软件开发法则</h2>
<p>集成测试越早越好</p>
<p>几乎每隔2、3年我们就能看到软件开发领域诞生一套新的方法论，比如在软件架构领域，我们经历了面向模块、面向组件、面向服务（SOA），直到今天我们提出微服务架构。</p>
<h2 id="◆-八、我无法写出易读的代码" tabindex="-1"><a class="header-anchor" href="#◆-八、我无法写出易读的代码" aria-hidden="true">#</a> ◆ 八、我无法写出易读的代码</h2>
<p>我所推荐的方法是推行模式（Patterns），在项目进入开发阶段前，就将那些开发过程中会遇到的相同类型的问题进行分类，并为它们创建统一的模式（标准的处理方式），比如：•使用什么结构来表示数据本身。•采用哪种机制来进行数据加工。•如何进行统一的错误处理。•会话的管理及使用策略。•哪些地方需要记录日志。•包与方法的命名Name Convention。</p>
<h2 id="◆-九、一名全栈工程师的mac工具箱-设计、开发、效率" tabindex="-1"><a class="header-anchor" href="#◆-九、一名全栈工程师的mac工具箱-设计、开发、效率" aria-hidden="true">#</a> ◆ 九、一名全栈工程师的Mac工具箱（设计、开发、效率）</h2>
<p>1．设计类工具（1）Sketch 3（http://www.sketchapp.com/）</p>
<p>（2）Affinity Designer（https://affinity.serif.com/zh-cn/designer/）Affinity Designer是Mac上一个快速、流畅及精确的矢量图形设计软件。你可以使用它来做广告、图标、UI或是创作概念艺术。在全世界超过2500个应用商店评级中获得平均5颗星，并且从一开始就成为了“编辑推荐选择”，被特别推荐为2014最佳新应用程序之一，并因其令人惊叹的性能和功能在2015年6月的苹果全球开发者大会上获得了令人垂涎的苹果设计奖。</p>
<p>（3）Framer（http://framerjs.com/）原型设计的工具很多，比如，Flinto、Principle、Orrigmi等，但我却很少使用。如果一定让我推荐的话，我选择的是Framer Studio，因为，它允许我使用JavaScript代码来控制动效，这一点非常吸引我。</p>
<p>（4）PaintCode（http://www.paintcodeapp.com/）你可以使用PaintCode工具方便地进行图形设计，也可以将SVG或PSD文件导入到PaintCode中，然后它就能将你的设计转换成Objective-C、Swift或C#代码。</p>
<p>（5）Hype 3 Professional（http://tumult.com/hype/pro/）我一般只在网站或APP中使用简单的动效，但如果你希望在你的网页或APP中做出非常炫的动画效果，那么可以使用Hype，它能方便地设计动效并将它导出为HTML5代码。</p>
<p>（6）Pixave 2（http://www.littlehj.com/）设计师需要不断去收集优秀的设计作品，以此来提升自己的设计感觉。我之前一直在使用Ember，但它已经停产了，并且它并不能支持一些最新格式的设计文件，比如，Sketch、Affinity Designer等。Pixave 2是一个很好的替代者，它支持几乎所有与设计相关的文件格式。</p>
<p>（7）Iconjar（http://geticonjar.com/）作为设计师，你一定也收集了大量的图标素材。但你往往会发现当你真正需要去寻找一个图标时，却非常困难，Iconjar可以帮助你解决这个问题。你能够使用Iconjar导入所需的图标素材，并给它们打上标签，你也能够通过Iconjar提供的搜索功能，快速定位到你所需要的图标。</p>
<p>（8）Sip for Mac and iPhone（http://theolabrothers.com/）Sip是一款非常出色的iOS APP，它能帮助你从照片中创建色板，并且你可以在你的Mac或手机上随时随地使用它捕捉那些美丽的色彩。</p>
<p>2．开发类工具（1）Sublime Text 3（http://www.sublimetext.com/）前文第49页提到过相关内容。（2）Eclipse（https://eclipse.org/）前文第49页提到过相关内容。（3）Dash（https://kapeli.com/dash）Dash对开发人员非常有帮助，它使我们能够在离线的状态下查看如Angular、Swift、CSS等的技术文档。这使我在网络条件不好的情况下也能工作，并且极大地提升了我们的工作效率。</p>
<p>（1）Alfred（https://www.alfredapp.com/）Alfred是我见过的，最能将Mac的效率使用到极致的工具了。小到翻译一个英文单词、搜索一个文件，大到用一个命令完成本地开发环境的部署启动，都可以通过Alfred来完成。你可以将大部分的重复劳动让Alfred来帮助你完成。</p>
<p>（2）CheatSheet（https://www.cheatsheetapp.com/CheatSheet/）CheatSheet是我非常喜欢的一个小工具。任何流行的软件都会有一堆快捷键设置，通过这个工具，你只需要长按苹果电脑里的Command键，这个软件的所有快捷键就会显示在你的面前，你完全不用逐一去背，只要反复查看几次，你自然就能熟练运用那些快捷键了。</p>
<p>Ulysses是我最喜欢的一款MarkDown写作软件。它的最大特点在于，我可以将一篇文章分成多个小节，然后在编辑器中仅针对这个小节来进行写作，这能让我更好地保持专注。另外，它支持多种文件格式的导出，如HTML、PDF、Word等，这样我可以将我的文章非常方便地发布到不同的平台上。</p>
<p>Screenflow是我用过的最好的屏幕截图软件了，你可以使用自己设定的快捷键来截取屏幕图片并进行编辑。另外，它还支持录制视频的功能，还能进行后期的制作，比如，添加字幕、动画效果等。因此，我也打算用它来制作一些视频教程。</p>
<p>（7）LICEcap（http://www.cockos.com/licecap/）LICEcap是一款很小的免费软件，在屏幕上设定一个区域，然后就可以使用LICEcap来快速地录制GIF动画了。</p>
<h1 id="◆-第三章-谈个人发展" tabindex="-1"><a class="header-anchor" href="#◆-第三章-谈个人发展" aria-hidden="true">#</a> ◆ 第三章 谈个人发展</h1>
<p>•掌握这门语言的使用哲学：包括那些最佳实践、设计模式及它们背后所蕴含的原则。•深入理解语言的特性：每一门语言都有各自的特性，并且很多新的特性还会不断加入到语言的最新版本之中。充分了解这些特性，能够帮助程序员更准确、高效地使用它们。•了解语言的局限：任何程序语言都存在其局限性，这会让我们在解决某些问题时遇到麻烦。我们需要了解这些限制，并知道如何使用一些方法或技巧去绕过这些限制并解决问题。•理解语言的缺陷：有些语言在设计之初就存在一些先天不足，比如，Java语言中的日期处理，那些原始数据类型，可能会给你带来一些疑惑。了解这些缺陷，并尽可能在编程中避免涉及这些缺陷，会让你的程序在日后更易于维护。•了解语言的未来：有些编程语言如新生儿般茁壮成长，比如Swift、Go，有些则如青壮年般看上去年富力强，比如Java、PHP、Python，而有些则已进入暮年，不再受到关注，比如VB、Pascal。优秀的程序员能很快掌握一门新的编程语言，但只有了解语言的发展方向，才能让你更有信心地去应对未来。</p>
<p>优秀的程序员往往需要具备：•一定的语言表达能力：这样才能向他人准确而清晰地表达自己的设计或想法。•学会倾听：这样才能获得他人的优秀想法或意见，帮助自己取得进步。•有足够的信心成为一个领导者：尽管可能只是一个2、3人的团队，但那是一个很好的开始。•指导他人的能力：包括教授方法和思想，而不仅仅局限于技术本身。•持续学习的能力：你需要不断进步，否则即使你曾经优秀，也很难维持。•谦逊的态度：这会让你更像是一个大师。•尊重每一个人：与此同时，你也将会迎得他人的尊重。•敢于承担责任：责任与机遇并存，承担责任的同时机遇往往就会随之而来。</p>
<p>很少会出现因为技术原因导致项目失败的现象，大部分的失败往往来自于程序员们软技能方面缺失所导致的团队协作问题。</p>
<p>有很多因素会使一名程序员走向平庸，而最最直接的便是失去对编程的热情和兴趣。当一名程序员不再能够感受编程所能带来的乐趣时，编程对他来说，只是一项不得不去完成的工作，而他也将失去继续学习的动力，无法再与优秀沾边了。</p>
<h2 id="◆-二、成为一名自由程序员" tabindex="-1"><a class="header-anchor" href="#◆-二、成为一名自由程序员" aria-hidden="true">#</a> ◆ 二、成为一名自由程序员</h2>
<p>1．自由程序员的类型很多人把自由程序员定义为没有正式工作，在家里接活儿的程序员。而我认为下面这5种类型，都可以视为自由程序员。</p>
<p>•独立接包者：他们接的活儿都是基于项目的，但他们并没有任何雇员，而是独立地完成这些项目，然后通过结算获得收入。•兼职程序员：他们一般都有正式的工作，但会利用较为充足的业余时间（晚上或周六、周日）来接一些规模较小的私活儿，或者参与一些工作之外的项目。</p>
<p>•混合外包：他们本身可能就是一家公司的外包，但他们的时间相对比较自由，可以接其他工作来干，工作和私活儿对他们来说已经不存在清晰的界限了。</p>
<p>•临时工：可能是经朋友介绍，短时间参与项目的程序员，项目完成后他们能获得一定的报酬，但他们一般不会主动找活儿来做。</p>
<p>•团队接包者：一般都是在某个领域深耕多年的自由程序员，他们往往会雇佣一个小型开发团队，并通过经营一个网店或服务网站的形式，对外提供软件外包服务。他们能够承接一些较大的项目，收益一般也会更高。</p>
<p>•项目管理是你要面临的另一挑战，这并不仅仅指你如何管理项目的进度，更在于在整个项目期间，如何有效地获得客户的需求，管控他们的期望，以及进行风险的管理，等等。我见过很多项目，在经过一段短暂的蜜月期后，最终因为项目管理不当而不欢而散，无法收回尾款。而对你来说，除了金钱之外，最大的损失可能是你的声誉。</p>
<p>还需要拥有一定的法律及财务知识，因为很多项目特别是来自于企业的项目都需要你出具合同，你需要尽可能地在合同中保障自己的利益。当出现一些纠纷时，你也需要学会运用法律知识来保护自己。</p>
<p>像企业一样运作：即使你没有成立公司，你也应该把自己当作一个公司来进行运作。这意味着你需要懂得最基本的销售、市场、财务及商务知识。</p>
<p>•建立自己的品牌：你需要为自己建立品牌——Branding，互联网是让你为人所知的最佳场所。你可以从利用你的社交账号，博客网站开始，逐渐让大家知道你所做的事情及你的所长。•沟通至关重要：沟通非常关键，尤其对于那些习惯了使用技术语言的程序员来说尤其重要，你需要学会转变思维方式，并用非技术语言与你的潜在客户进行交流，并取得他们的信任。</p>
<p>下面是我知道的一些国内外程序员兼职网站，它们或许能够帮助你起步，成为一名自由程序员（注：以下网站并不一定适合所有程序员，你需要根据自己的情况进行尝试后再选择最合适自己的平台）。</p>
<p>（1）Coding码市（https://mart.coding.net/）</p>
<p>Coding码市是2015年7月底推出的软件众包平台。软件需求方可以在码市低价获取专业开发者技能资源完成项目开发，加速软件开发效率，节省人力成本，快速高质量地把想法落地成产品。而开发者则可以在码市找到合适的项目并将自身专业技能转变成财富。相较于猪八戒网，Coding码市是更单纯地服务于开发人员的众包平台。</p>
<p>（2）猪八戒网（http://www.zbj.com/）猪八戒网上拥有500万家中外雇主，1000万家服务商，交易规模和市场占有率也很高。程序员们可以承接如网站开发、APP开发、应用软件开发等工作。相对而言都是以二次开发为主，你需要有一定的技术或产品积累才能体现出自己的优势。</p>
<p>（3）Freelancer（https://www.freelancer.com/work/）国外知名的兼职网站，能够帮助你找到合适的国外兼职项目。由于项目基本是按国外程序员的平均小时费率计算报酬的，因此，如果你的英语不错，那么，在Freelancer上寻找兼职开发工作也是一个不错的选择。</p>
<p>（4）猿团（http://www.yuantuan.com/）猿团是为A轮之前的创业公司或那些小企业提供技术服务，一边对接兼职的技术团队，一边对接需求方。与其他同类竞品不太一样的是平台的技术兼职隶属于猿团，也就是相当于猿团为需求方定制产品，而具体工作则是转包给第三方团队完成。因此，如果你已经有一个比较稳定的技术团队，那么可以申请成为猿团的城市合伙人，并利用猿团品牌来接单。</p>
<p>兼职市场正在变得越来越大，国内的主要兼职网站的营收规模在2015年接近百亿元，并还在快速增长中。随着创新时代的来临，这一增长势头将会进一步加快。</p>
<h2 id="◆-三、专家与普通人的区别在于觉察力" tabindex="-1"><a class="header-anchor" href="#◆-三、专家与普通人的区别在于觉察力" aria-hidden="true">#</a> ◆ 三、专家与普通人的区别在于觉察力</h2>
<p>专家与普通人的最大区别在于他们能真正理解和解决问题：林璎所做的越战纪念碑设计原型虽然看上去非常稚嫩，远不及那些专业人士的作品，但她的设计却毫无争议地获得了采纳，其根本原因还是林璎最深刻地理解并揭示了越战纪念碑所需要表达的真正含义，那便是在缅怀越战逝者的同时，反思战争，珍惜来之不易的和平。可以说，只有林璎最好地理解了这次设计的目的，并完美地解决了问题。</p>
<h2 id="◆-四、程序员创业-你需要先避开这些坑" tabindex="-1"><a class="header-anchor" href="#◆-四、程序员创业-你需要先避开这些坑" aria-hidden="true">#</a> ◆ 四、程序员创业？你需要先避开这些坑</h2>
<p>心理学中有一个词叫作“自我效能”，指的是人们对自己能够取得成功的信念——“我能行”。而我发现这种心理暗示，在人们产生创业想法时显得尤为明显。你不应该被一时的热情冲昏头脑，应尝试着问问自己，既然我的这个想法那么好，那么为什么在那个行业（或领域）里没有人想着去做呢？是因为这个行业里没有一个人比我聪明？还是因为我想要解决的问题并非是市场的真正痛点，或者是因为实现它的成本过高，根本没有人愿意去做呢？尝试着去做更深入的市场调研，然后再决定是否开始。</p>
<p>没有一个具备良好操作性的商业计划。它们要么太大要么太小，甚至有些根本没有商业计划书。</p>
<p>在创业初期，你应该以确定自己的产品定位、核心功能、短期市场规划的目标为目的来写自己的商业计划书。因为在这个过程中，你能够进一步完善自己的想法，并形成一个在后续研发、运营过程中提供参考依据和方向的指南。</p>
<p>建议的初创团队可以在2～5人，其中至少应该有一名程序员、一名设计师、一名市场人员、一名投资者或决策者。</p>
<p>研发周期过长，产品缺乏焦点或特色</p>
<p>像增长黑客一样以最快的速度去推出一个可行的产品非常重要</p>
<p>这种最小成本最短时间做出一个最小化可行产品（MVP），是我最推荐程序员创业者们采用的。</p>
<p>与10年前的创业环境不同，今天你所创造的产品必须具有鲜明的特色，一经推向市场便能依靠产品的定位与功能特色迅速赢得用户。请记住，你的产品需要有一击即胜的鲜明特色，否则它将很快被人们遗忘。</p>
<p>过度关注产品研发，而忽略了市场</p>
<p>另一个程序员们容易犯的错误是太关注于产品本身而忽略了市场。即使是在产品上线之后，他们仍然会把大部分精力放在自己认为需要的新功能的研发上。这种做法其实是不可取的，一旦产品投入了市场，你就必须采取一切手段了解市场的反应，然后根据用户的反馈来提炼出用户真正的需求，改进并完善你的产品。</p>
<p>你也需要通过一些更有效的方法来获取用户的反馈，比如，采用免费策略，游戏化的激励举措等，都可以鼓励更多的用户来使用你的产品，并给出他们的反馈，从而帮助你的产品进步。</p>
<p>没有与你的用户维护关系，也不愿意向人求助</p>
<p>程序员们往往不愿意向人求助，这可能是因为他们太过习惯于向搜索引擎求助了吧。在创业过程中，你一定会遇到很多需要其他人帮助或参与的时候，比如，请求其他优秀人才的加入，寻求企业的赞助，拉风投，等等。主动寻求他人的帮助，能帮助你调动更多有效的资源来加速目标的实现。</p>
<p>过分信任专家，或对用户言听计从</p>
<h2 id="◆-五、程序员之-美" tabindex="-1"><a class="header-anchor" href="#◆-五、程序员之-美" aria-hidden="true">#</a> ◆ 五、程序员之“美”</h2>
<p>那些正在做的工作以及所钻研的技术可能都不是你们存在的真正意义，只有生活才是。而我们的修养也绝不在于掌握了哪些链接库，或理解一些Windows底层的编译原理，反而应该多在生活中做学问，培养些兴趣爱好，懂得去欣赏、体验与实践“美”（那些美好的事物）。之所以我会这样说，是因为看到了太多程序员在年轻时还能用技术去填满自己的生活，然而随着年龄的增长，在遇到一些不可避免的现实之后，就渐渐迷失了前进的方向，这时候才发现自己脑袋里除了一些已经快要过时的技术外便空空如也，便会感觉迷茫、无助，也只得浑浑噩噩、迷迷糊糊地去度过一生，这样岂不可惜？</p>
<p>说到要去欣赏和体验美，你一定希望知道它们都在哪里？其实，文学、音乐、绘画等，都是你可以从中获得美感的来源，而且任何一个门类都是如此浩瀚，足以让你取之不尽。对我来说，尝试着去欣赏音乐，无疑是自己最喜欢的。我从未上过任何与音乐有关的学校或培训班，唱歌也是五音不全，去听古典音乐更是完全出于偶然。</p>
<p>成为艺术家或许真的需要极高的天赋，然而学习欣赏，却是你我这些普通人通过练习也能获得的。你是否还记得自己学骑自行车和学游泳时的经历呢？一开始，一定会摔跤、也会喝上几口脏水，但你有没有发现，自己仿佛是在某一个不经意的瞬间，一下子就学会了骑车和游泳呢？当我们在练习的时候，身体的每一块肌肉都会被不断调动起来，去寻找骑车或游泳时所需要的平衡与向前的动力，即使一段时间不练，但在你的潜意识里仍会不断地去学习和尝试，一旦你重新踏上自行车或进入泳池时，便会惊讶地发现自己突然间学会了。</p>
<p>程序员们常年从事着编程工作，这使他们往往变得过于理性，这虽然能够帮助他们更好地胜任工作，却也在削弱他们对周围事物的感知能力及原本丰富的情感。我们往往变得不善于表达情感，眼光也只被那些技术所左右。然而，通过对那些优秀艺术作品的欣赏却能帮助我们恢复洞察力，更重要的是能通达我们的情感，而情感正是我们修养的基础。在公交车上，当有老人上车时，总会有些人马上起身让座，有一些则会选择视而不见，直到老人来到跟前，才极不情愿地起身。虽然都让了座，但给人的感觉却截然不同，前者是美的，让人觉得是有修养的，而后者则只是做了应该做的事而已。出现这种反差的原因，我想还是在于情感吧，前者能将其对自己父母的情感推及到所有老人身上，做出了非常自然地让座举动，而旁观者之所以体会到美，也正是因为感受到了这种情感，而非只是看到有人做了一件符合道德的事。同样，我们在欣赏一件艺术作品时，也会不自觉地拿自己的经历或通过联想与其匹配，试图与作品产生共鸣。</p>
<p>中国近代的著名学者王国维在他的《人间词话》中，曾以“有境界，则自成高格”来评价前人所写的词。我倒觉得，这句话同样可以用来喻人，人生的“高格”不正在于你我是否能够领略那些美好，并在生活中不断地去实践“美”吗？</p>
<h2 id="◆-六、建立自己的个人品牌" tabindex="-1"><a class="header-anchor" href="#◆-六、建立自己的个人品牌" aria-hidden="true">#</a> ◆ 六、建立自己的个人品牌</h2>
<p>建立自己的个人品牌</p>
<p>注重建立自己的个人品牌。</p>
<p>1．为什么设计师更注重个人品牌</p>
<p>设计师的简历总是经过精心包装，看上去赏心悦目、非常专业，而那些程序员的简历大多还用着老套的Word模板，丝毫没有新意。你或许会说，这是由于专业技能方面的区别造成的，但我却觉得，相较于设计师，程序员的个人品牌意识相对较弱，而这背后的原因存在于以下几个方面。</p>
<p>•设计师代表个人，而程序员代表集体：我们总是把设计师的成果称为作品，而把程序员的成果叫作项目或者产品。长期以来的工作模式，以及社会认知造成设计师们更有个人意识，而程序员的集体意识更强。</p>
<p>•设计师的个人紧迫感更强：虽然最近几年设计行业得到极大发展，但由于设计本身的门槛相对较低，因此那些做着最基础工作的设计师们的待遇和在团队中的地位仍然较低，这使他们有更强的紧迫感，迫切希望通过建立个人品牌扩大知名度，获得认可，并由此提升自己的待遇和地位。</p>
<p>•成功的先例很多：业界有一大堆通过建立个人品牌，进而建立个人工作室，获得成功的设计师的案例。通过他们创建的品牌，可以获得相当高的回报，有些小有名气的设计师做一次演讲或授课，都能获得丰厚的回报。这些对于普通设计师来说都是很好的成功案例。而对于程序员来说，大家对你的评价往往还在于你参与了哪些项目，有些什么技能等，很少会关注你的个人品牌。</p>
<p>开始建立程序员的个人品牌</p>
<p>程序员变得更加全能：随着专业领域的融合，以及所有与技术相关的门槛的降低，程序员将不再局限于某一门编程语言的开发，越来越多的程序员具备全栈开发的能力，而这些能力还在进一步扩展到设计、运营等领域。利用越来越丰富的云服务和好用的工具，程序员个体可以不依赖大型开发团队就创造出那些优秀的产品来。</p>
<p>•创造力被激发：个人能力的提升所带来的是创造力被激发，如果说设计师能利用设计改变人们对一个产品的使用体验和感受的话，那么程序员将能利用技术为我们解决生活中的大部分问题，</p>
<p>•众包行业的发展：众包行业的快速发展，也为程序员们带来了新的机遇。程序员个人或几人组成的团队可以在众包平台上承接项目，而那些信誉度高，评价好的个人和团队，他们的品牌价值也会越来越高，而随之而来的会是更加丰厚的回报。</p>
<p>3．如何建立个人品牌</p>
<p>建立程序员个人品牌的途径。•起一个好名字：一个好的名字是建立个人品牌的第一步，你当然可以直接以你的真实姓名作为个人品牌，但这往往是那些已经在某个行业具备一定知名度的专家所采用的，因为他们的名字本身已经是一个不错的品牌了。而对于刚刚起步的程序员来说，不妨起一个与你内心意愿或专业领域相符合，且标识性较高的名字。我给自己起的花名叫作“技匠”，顾名思义是技术工匠的意思，因为这个词能够很好地概括我的工作和追求，而我将自己的博客就命名为了“技匠志”，成立的社团叫作“技匠社”</p>
<p>•打造一个个人网站：个人网站就像你的个人名片，能让更多人了解你，也能让其他人更方便地找到你。你可以在你的个人网站上放上你所擅长的技能，你所做过的项目，如何联系到你，以及其他任何你觉得大家会对你感兴趣的内容。另外，你需要特别关注网站的设计，这就像一个人的穿着打扮，能够让人一眼看出你的品位与层次，如果你没有设计方面的经验，那么不妨花钱买一个模板或请人来做一些简单的设计。如果实在没有把握，那么我建议你尽可能地使用简洁甚至无修饰的设计，只要能让内容尽可能清晰地展现出来即可，那至少不会为你减分。</p>
<p>•写技术博客：在创建个人品牌的初期，很少有人会关注你，写一个技术博客会是不错的选择。写技术博客有不少技巧，但最重要的还是坚持与用心去写。坚持每周写一篇经过自己用心思考后的文章，并在相对固定的时间发布，渐渐地，你会发现读者自然而然地多了，他们还会给你的文章提出意见，有时还会向你咨询问题，请认真对待这些反馈，它们会帮助你补充思考中的遗漏，让你变得更加完善。渐渐地你将能够写出更优秀的文章来。</p>
<p>•开源自己的业余项目：开源自己的业余项目，也是一种建立个人品牌的有效途径。这里的业余项目并不一定是指那些真实的包含代码的项目，也可以是你在编写的一本在线电子书，或者是你搜集整理的关于某一项技术的资源集合，这些都能帮助你获得一大批的追随者。但更重要的是你需要不断地去更新和完善它，否则当它因缺少维护变得枯萎的时候，也就是你的那些粉丝离你远去的时候。</p>
<p>•参与知名的开源项目：有机会参与那些知名的开源项目也会让你身价倍增。在InfoQ全球架构师大会上，我曾听过一场关于开源的演讲，演讲者讲述了自己是如何通过参与最知名的大数据开源项目，而获得包括来自Dropbox、Facebook、Uber等公司的青睐的。通过参与那些知名开源项目，成为Contributor或Core成员，将让你在这个领域成为专家级的人物，你的个人品牌也会随之获得显著提升。</p>
<p>•参与更多线下活动：如果你觉得以上这些对你来说都有些难以操作的话，那么不妨从多参与线下活动开始。像CSDN、InfoQ、极客帮等知名互联网IT平台都会定期组织线下活动，有些是年度技术大会，有些则是针对某一技术领域的交流活动，虽然有些是收费的，但作为一项对自己的投资，参与这些大会和活动，能让你获得与世界同步的视野。另外，你在这些活动中还能认识不少技术大牛与行业专家，而你的机会也可能存在其中。他们可能不会帮助你建立个人品牌，但他们的意见和建议都能给你带来帮助或启发。</p>
<h2 id="◆-七、你不应该成为一匹独狼" tabindex="-1"><a class="header-anchor" href="#◆-七、你不应该成为一匹独狼" aria-hidden="true">#</a> ◆ 七、你不应该成为一匹独狼</h2>
<p>如果说一个人的梦想成功的概率只有5%的话，那么如果这个梦想同时是两个人或更多人的，那么相信它成功的概率就可以达到20%甚至更高。人们总是会认为自己的梦想或计划非常完美，简直无懈可击，但事实却证明他们往往想得太过理想而偏离了实际，而旁人却更容易站在相对客观的角度来帮助你做出评判和分析。因此，当你有一个好的想法时，先别急着动手，也别直接去找那些风投顾问，而是试着把它分享给你希望一起合作的伙伴，如果你的梦想也同样能打动他们，那相信你离成功便又近了一步。</p>
<p>程序员单枪匹马地去做一个产品或项目，更容易半途而废。这当然与他们一开始的想法可能就不切实际有关，但另一方面，在遇到困难时，放弃的代价相对更低，也是重要的原因之一（只有你为之付出了努力，而你完全不需要对他人负责）。</p>
<p>我曾参与过一些孵化项目的预审，看到过那些创业者满怀激情地演示自己产品的原型，可惜这些原型中的大部分都没有变成最终的产品，而那些能够坚持下来的创业者会对我说“他们感到最兴奋的事情，便是坐在公交车或地铁上，看着身边的人拿出手机打开自己所开发应用的那一刻”。</p>
<h2 id="◆-八、未来-有关程序员的10个预言" tabindex="-1"><a class="header-anchor" href="#◆-八、未来-有关程序员的10个预言" aria-hidden="true">#</a> ◆ 八、未来，有关程序员的10个预言</h2>
<p>预测一下未来10年，程序员这个职业可能发生的变化。</p>
<p>1．程序员将变得更加全能</p>
<p>如果你是一名iOS程序员，那么你一定能感受到最近几年市场的变化，从对iOS程序员趋之若鹜，到今天所谓互联网寒冬之下的少人问津，其背后的原因之一竟是市场上数不清的培训机构，像流水线般生产出过盛的iOS开发人员所致。同样，对于设计师群体而言，越来越多的公司对他们的要求已从单一的UI设计，转向能够同时具备前端开发能力。</p>
<p>今天我们能听到的很多技术领域的新词汇，比如，大数据、机器学习、云计算、人工智能、VR/AR、区块链、无人驾驶、物联网等，未来都将成为可以深入研究的领域和发展方向，它们的深度的和复杂程度也绝非掌握一门编程语言所可以比拟的。精通一种编程语言便能通吃各个行业和领域的时代将一去不返，程序员将变得更加“专一”，他们会尽可能早地确定自己的专业方向，并花费大量时间，努力去成为某一方面的专家，他们甚至可能不再被称为程序员，取而代之的是一些全新的称呼。比如，在大数据领域，我们会把那些从事数据分析的程序员称作数据分析师或数据科学家，同样，在其他领域也会有更多新鲜词汇被用来代表程序员。</p>
<p>3．工具大爆发让程序员们效率倍增</p>
<p>4．云服务加速创新</p>
<p>云服务将能为开发者提供大量即插即用的基础构件，这使程序员们不再需要重复发明轮子，再去创造诸如数据存储、图像处理、数据加密等基础服务，一切都将以API的形式在云端开放，基于这些基础服务，产品的研发与迭代速度都将明显加快，而成本却因云服务的按需收费而得到降低，这无疑将加快创新的步伐，相信越来越多优秀的产品和服务会不断被开发出来改善人们生活的各个方面。</p>
<p>在这杆互联网大旗下，诸如云计算、大数据等互联网技术与思维也正在快速渗透几乎每一个行业，越来越多有远见的企业提出了由IT驱动业务发展的公司战略，IT部门在那些传统行业中正变得越来越重要，它们不再只是负责信息系统维护的辅助部门，而需要去真正理解业务，并推动业务在互联网背景下的革新。</p>
<p>7．自由程序员将大量出现</p>
<p>8．程序员更加国际化</p>
<p>未来那些伟大的程序员，他们的贡献可能并不在于创造了一门新的程序语言或是一款优秀软件产品，而在于他们利用其开创性的思想，借助诸如大数据、人工智能等技术，帮助人类战胜疾病、能源匮乏、饥饿等世界难题。</p>
<p>国外越来越多的学校已经将编程作为一门必修课，纳入中学甚至小学的教育体系之中。国内也有越来越多的家长开始让孩子从小学习编程。编程并不是教会一门开发语言那么简单，它让人们得到一种新的思维方式，而这种思维方式如果能在更小的年龄阶段掌握，会让孩子们在长大后能更好地适应未来的工作和生活。</p>
<h2 id="◆-九、你也可以写出优秀的技术博客" tabindex="-1"><a class="header-anchor" href="#◆-九、你也可以写出优秀的技术博客" aria-hidden="true">#</a> ◆ 九、你也可以写出优秀的技术博客</h2>
<p>1）自建博客平台</p>
<p>采用的是Hexo（https://hexo.io/zh-cn/index.html）+Coding（https://coding.net）来搭建一个静态博客站点。</p>
<p>Hexo是一个基于Node.js的博客框架，只需在终端里输入几个简单的命令便可以完成一个静态博客网站的搭建，同时它还支持用Markdown来编写文章。另外，利用GitHub Pages、Heroku、Coding等代码托管平台的Paging服务，还可以实现博客更新内容的一键发布，非常快速、高效，而且没有任何租用服务器的花费，之所以选择Coding是因为它可以实现自有域名的绑定。</p>
<p>CSDN、慕课、稀土掘金都提供了不错的写作功能。</p>
<p>程序员在简书中是一个很大的读者群体，这意味着我写的文章如果足够好的话（能够上首页），便有机会被更多人读到。</p>
<p>2．如何起步</p>
<p>在你自己的博客里，其实你什么都可以写。你可以像写日记一样记录下你每天的所思所想，你也可以把它当作笔记，记录那些你工作中遇到的技术问题，以及你是如何解决它的。但是，如果你希望你的博客能够受到欢迎，我就不建议把它当作日记或笔记来进行记录了。你应该尝试写出更多高质量的文章，并不断挑战自己。</p>
<p>要想写好一个博客，你必须了解你的读者群是谁？你所擅长的领域在哪里？你内心希望写什么样的文章？</p>
<p>（2）从模仿和重写开始</p>
<p>通过模仿和重写，你会渐渐培养起写作的感觉，并且越写越好。下面是我经常采用的写作步骤：</p>
<p>①确定一个要写的主题。②在网上寻找到那些能够帮助你完善观点的参考资料。③列出文章的提纲。④根据提纲完善内容。⑤反复修改，直到文章通顺易读（有时我也会找人试读，并听取他们的意见）。⑥给文章配一个好的标题。⑦发布你的文章。</p>
<p>我发现有两类非常有意思的博客作者，一类是刚开始写博客的新手，他们往往热情高涨，每周都会发好几篇文章，但这类作者一般坚持不了多久，文章的数量便会逐渐减少，到了后面甚至一两个月都没有更新了；而另一类作者却是写作的老手，他们为了维持热度，每隔一两天便会发布一篇文章，但文章的质量却不稳定，大多数文章都像在完成任务一样，被一篇一篇地制造出来，敷衍了事。</p>
<p>其实以上两类作者我们都不应效仿，我的建议是每周一篇，如果你的业余时间足够充裕的话，也可以写两篇，但你必须保证每一篇文章的质量，至少你是经过自己大量思考用心去完成的，即使这样的文章没能受到很多欢迎，但至少你会从中收获很多。</p>
<p>博客文章是不是越长越好呢？根据统计，那些内容较长的文章确实更容易得到用户的喜爱并获得转载，但那同样需要你花费更多的时间，而且你不应该以增加篇幅为目的去写文章。在我看来，2000～3000字会是一个比较合适的字数。因为，用2000～3000字就基本可以有效地阐明你对一个问题或一件事的观点。另外，考虑到目前的读者大部分都使用手机进行阅读，2000～3000字对于移动端的阅读体验来说，长度也比较适中，不容易让读者产生阅读疲劳。</p>
<p>发布窗口指的是你在周几，以及哪个时间段内来发布你的文章。比如，在简书上，周六周日的阅读者数量会相对较低，因此，如果你在休息日发布文章的话，就很难获得较高的阅读量。同时，你需要考虑你的读者群，比如，我文章的读者大多是程序员，他们更可能在上下班的路上，或晚上睡觉前来浏览博客文章，那么你就可以选择在这些时间点去发布你的文章。当然，你也可以通过在不同时间段发布文章，然后对比文章阅读效果的方法，来确认适合你文章发布的日期和时间段。</p>
<p>利用社交媒体进行推广也是目前流行的营销方式，我会在我的微信订阅号里同步发布博客文章，如果文章足够优秀，便能获得订阅用户的转载，使文章的阅读量得到提升。但我从不在自己的微信中推广自己的文章，因为那里都是自己的朋友和亲人，而不是读者。选择合适的社交媒体进行推广有助于使你所写的文章更好地得到传播，但有时选择不当，也会给你个人带来负面的影响。</p>
<h1 id="◆-第四章-谈编程中的教与学" tabindex="-1"><a class="header-anchor" href="#◆-第四章-谈编程中的教与学" aria-hidden="true">#</a> ◆ 第四章 谈编程中的教与学</h1>
<p>•Web前端开发（开发网站，基于HTML5的手机APP等）：JavaScript。</p>
<p>•后端开发（企业应用，后端服务）：Java（跨平台），C#（Windows平台）。</p>
<p>•移动开发：Swift（iOS平台），Java（Android平台）。</p>
<p>•3D或游戏开发：C。</p>
<p>•大数据或人工智能：Python，Java。</p>
<p>（2）已经有一个很好的点子，并希望实现它</p>
<p>•搭建网站：JavaScript + HTML5。</p>
<p>•做一个APP：Swift（iOS平台），Java（Android平台）。</p>
<p>（3）希望为那些初创公司工作可以选择JavaScript，因为越来越多的初创公司直接使用JavaScript来构建他们的前端和后端应用（比如，使用基于JavaScript的Node.js来开发后端服务等）。</p>
<p>（4）希望教孩子编程可以先让孩子尝试Scratch或Playground之类的游戏类编程学习软件，当孩子对那些基本编程知识有所了解，并具备一定逻辑思能力后，就可以转而学习Python、Java等高级语言了。</p>
<p>（5）只是想建一个个人博客或搭一个论坛或企业服务站点你可以学习PHP，因为几乎所有优秀的基于CMS的建站平台都是用PHP写的，包括WordPress、Drupal、Joomla，等等。</p>
<p>•选择从最简单的编程语言开始：Python。</p>
<p>•难度稍微高一些，但应用场景更广的语言：Java。</p>
<p>如果你暂时对学习哪种编程语言没有任何想法，或只是为了提高自己想学习一种编程语言，那么我的建议是Python。</p>
<p>1）《Scratch少儿趣味编程》Scratch是美国麻省理工学院设计开发的一款编程工具，是适合少儿学习编程和交流的工具和平台，有中文版且完全免费。这本书结合孩子们学习的语文、数学、科学、社会、音乐、体育等科目，手把手地教大家如何用Scratch设计程序（如设计一个自动写作文的程序），配有各式卡通形象，通俗易懂，寓教于乐。</p>
<p>（2）《趣学JavaScript——教孩子学编程》JavaScript可能是目前最流行的开发语言，这本书用轻松愉快的方式，通过耐心的、按部就班的示例，以及充满趣味的图示，帮助你轻松地学习编程知识。</p>
<p>（3）《父与子的编程之旅：与小卡特一起学Python》这本书得到了很多人包括教育专家的推荐，经过了孩子们的亲身检验。这本书同样适合大人阅读，如果你想自己学习编程，就赶紧拿起本书，探索看似神秘的编程世界吧！</p>
<p>◆ 二、为什么我们不再购买技术类书籍</p>
<p>《斯蒂夫·乔布斯传》</p>
<p>《精益创业》《增长黑客》《疯传》《游戏化思维》</p>
<p>《设计中的设计》《为什么设计》《设计的觉醒》《白》</p>
<p>尤瓦尔·赫拉利的《人类简史》、龙应台的《野火集》、克里希那穆提的《生命之书》、沈复的《浮生六记》</p>
<p>《代码大全》、Effective Java、《JavaScript语言精粹》</p>
<p>◆ 三、我眼中的技术干货与湿货</p>
<p>年轻人喜欢干货，因为他们急切地渴望成长，那些所谓的技术干货就是他们眼中的高效助长剂。我的身边也有一些这样的年轻程序员，他们非常努力，每天都花大量的时间去阅读网上的各种技术干货，当与他们谈论技术时，他们也总是能够头头是道地讲出一大通新鲜的技术名词，可一旦回到现实工作中，却可能连一些最简单的问题都无法处理好。这不由让我联想到，大棚里的蔬果总有着漂亮的外形，但说到口味和营养，却仍是那些在自然环境下经过风吹日晒，在雨露滋养中生长的会更胜一筹。程序员也是一样，一味追求干货以期获得快速的成长，只会让你如过度施肥的植物般，很快遇到瓶颈而失去持续成长的动力。湿货在我眼中就像阳光和雨露，它们可能来自于那些大师、专家或者像你我这样普通人的经验、感悟或方法，或许看上去并不能直接带给你什么，但在这些湿货的滋养下，你却能在无声无息之中提升自己的思维、觉察力、感悟力，而这些正是帮助你去消化那些干货的有效润滑剂。</p>
<p>•演讲：闲时我会看TED的演讲，除了技术相关的，我也看一些与人文艺术有关的演讲。从这些各个领域的人身上，我获得了很多灵感，也使我发现了不同的兴趣。除了技术你还应该去发现不同的兴趣爱好，这会使你变得更好。</p>
<p>•博客：我会追随一些不错的博客，比如，Medium上那些我喜欢的程序员和设计师，老设计师James Greig的博客（http://greig.cc/），里面有很多不错的想法，当然还有著名的Coding Horror（https://blog.codinghorror.com/），虽然现在更新得很少，但一些老的博客仍然很值得一读。</p>
<p>•播客：与单纯的阅读相比，播客的形式更容易调动人的思维。我经常听的播客有Developer Tea（https://spec.fm/podcasts/developer-tea），它是国外著名的程序员播客，内容非常丰富，还有IPN（http://ipn.li/）的《一天世界》《博物志》《太医来了》《壁下观》等等，主播普遍具有中西方融合的文化背景，能在技术、人文、艺术等各个领域给我带来不同的启发。</p>
<p>•写作：写作无疑是令我改变最多，也是影响最大的，我也写过一些很热门的干货文章，但最近已经很少写了，我更希望去写那些自己需要进一步理解和思考的问题。对我来说，写作是一个将自己还没消化的干货反复咀嚼变成湿货，然后再加工成能够让更多人接受的干货的过程。无论你写些什么，坚持下去，你会发现写作能够推动你去深入理解更多问题。</p>
<h1 id="◆-第五章-谈自学设计" tabindex="-1"><a class="header-anchor" href="#◆-第五章-谈自学设计" aria-hidden="true">#</a> ◆ 第五章 谈自学设计</h1>
<p>Sketch已经大幅超越Photoshop成为设计师们首选的UI设计工具。</p>
<p>•小巧快捷：Sketch只有41M，相较于1.6GB的Photoshop来说显得非常小巧。因此，无论是安装，还是启动、运行，Sketch都非常快捷。</p>
<p>•专为UI设计而生：Photoshop是一个图片处理工具，它包含了大量的图片处理功能，但这些对于UI设计师来说是多余的，并会成为UI设计师们工作时的噪声，降低他们的设计效率。而Sketch则专注于UI设计，它的所有功能都只为UI设计服务。比如，统一的计量单位Pixel使你不必关注其他计量单位（cm、ml、Picas等），支持HSB、RGB颜色模型和色板功能，使用Symbol可以方便地复用你的设计元素，可针对任意设计元素或元素组导出不同分辨率的图片等等。另外，你不用再面对一个一半功能都不会去碰的工具栏，也完全不用去关心那些与UI设计无关的东西，这使你更容易学习和掌握这个设计工具。</p>
<p>•强大的插件功能：虽然Sketch的核心非常小，但它却提供了非常强大的插件功能。针对不同的设计场景，可以使用不同的插件。比如，你可以使用SketchPalettes保存你的常用色板，并与朋友方便地分享；使用Magic Mirror可以将你的设计方便地展示到不同的实体模型（如iPhone、iPad、书的封面等）；也可以使用Sketch Content Generator来批量地产生内容，这能为设计师节省大量的时间。此外，还有像Measure、Dynamic Button、Sketch Constraints等许多非常优秀的插件都可以帮助你大大提升工作效率，从而使你更能够专注于设计本身。</p>
<p>Designer News（https://www.designernews.co/）是一个使我获得高质量设计文章的优秀网站，在这里我可以看到最新的来自全球设计师的优秀分享。当然，我也在优设（http://www.uisdc.com/）、推酷（http://www.tuicool.com/）、Medium（https://medium.com/）等网站上阅读那些具有思想性的设计文章</p>
<p>另一个获得灵感的方法是收集优秀的设计作品。Ember是我用过的用来收集设计素材的最佳工具。更棒的是它支持订阅功能，可以从Dribbble这样的网站自动下载设计作品，可让我非常方便地浏览和收集。</p>
<p>使用Pintrest（https://www.pinterest.com/）来收集手机上看到的优秀设计，并分类添加到我在Pintrest上创建的Board中。（下图为我的Pintrest主页（https://www.pinterest.com/techmask/））</p>
<p>想一想你平时喜欢做的事情，阅读、散步、享用美食或者看展览。这其中的每一件都与一种艺术形式相关联：写作、环球旅行、烹饪、摄影。你会发现当你不断完善某一项技能的同时，其他技能也会得到加强。对于设计来说，上面提到的写作、摄影、旅行等都是对设计能力的很好补充。</p>
</div></template>


