export const data = JSON.parse("{\"key\":\"v-d40882d2\",\"path\":\"/docs/theme-reco/7.PHP%E9%AB%98%E6%80%A7%E8%83%BD%E5%BC%80%E5%8F%91%EF%BC%9A%E5%9F%BA%E7%A1%80%E3%80%81%E6%A1%86%E6%9E%B6%E4%B8%8E%E9%A1%B9%E7%9B%AE%E5%AE%9E%E6%88%98-ok%E5%85%A8%E9%83%A8%E6%95%B4%E7%90%86%E5%AE%8C.html\",\"title\":\"PHP高性能开发：基础、框架与项目实战\",\"lang\":\"en-US\",\"frontmatter\":{\"0\":\"t\",\"1\":\"i\",\"2\":\"t\",\"3\":\"l\",\"4\":\"e\",\"5\":\":\",\"6\":\"7\",\"7\":\".\",\"8\":\"P\",\"9\":\"H\",\"10\":\"P\",\"11\":\"高\",\"12\":\"性\",\"13\":\"能\",\"14\":\"开\",\"15\":\"发\",\"16\":\"：\",\"17\":\"基\",\"18\":\"础\",\"19\":\"、\",\"20\":\"框\",\"21\":\"架\",\"22\":\"与\",\"23\":\"项\",\"24\":\"目\",\"25\":\"实\",\"26\":\"战\",\"27\":\"-\",\"28\":\"o\",\"29\":\"k\",\"30\":\"全\",\"31\":\"部\",\"32\":\"整\",\"33\":\"理\",\"34\":\"完\",\"35\":\" \",\"36\":\"d\",\"37\":\"a\",\"38\":\"t\",\"39\":\"e\",\"40\":\":\",\"41\":\"2\",\"42\":\"0\",\"43\":\"2\",\"44\":\"0\",\"45\":\"/\",\"46\":\"0\",\"47\":\"5\",\"48\":\"/\",\"49\":\"2\",\"50\":\"9\"},\"headers\":[{\"level\":2,\"title\":\"◆ 第5章 好用的PHP开发环境—— PHPStorm\",\"slug\":\"◆-第5章-好用的php开发环境——-phpstorm\",\"link\":\"#◆-第5章-好用的php开发环境——-phpstorm\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第6章 PHP依赖的自动化管理工具——Composer\",\"slug\":\"◆-第6章-php依赖的自动化管理工具——composer\",\"link\":\"#◆-第6章-php依赖的自动化管理工具——composer\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第2篇 框架进阶篇\",\"slug\":\"◆-第2篇-框架进阶篇\",\"link\":\"#◆-第2篇-框架进阶篇\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第8章 ThinkPHP命令行操作与接口开发实战\",\"slug\":\"◆-第8章-thinkphp命令行操作与接口开发实战\",\"link\":\"#◆-第8章-thinkphp命令行操作与接口开发实战\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第3篇 项目实战篇\",\"slug\":\"◆-第3篇-项目实战篇\",\"link\":\"#◆-第3篇-项目实战篇\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第11章 Crontab计划任务管理\",\"slug\":\"◆-第11章-crontab计划任务管理\",\"link\":\"#◆-第11章-crontab计划任务管理\",\"children\":[]}],\"git\":{},\"filePathRelative\":\"docs/theme-reco/7.PHP高性能开发：基础、框架与项目实战-ok全部整理完.md\"}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
