<template><div><h3 id="_1-头条广告" tabindex="-1"><a class="header-anchor" href="#_1-头条广告" aria-hidden="true">#</a> 1.头条广告：</h3>
<p><img src="@source/docs/theme-reco/img/广告行业知识/image-20230305212821903.png" alt="image-20230305212821903"></p>
<h4 id="按天展示广告-cpd" tabindex="-1"><a class="header-anchor" href="#按天展示广告-cpd" aria-hidden="true">#</a> 按天展示广告(CPD)</h4>
<p>CPD广告（全称：Cost per day）：一天内的展示成本，简单理解为“按天包位置”，但会保证最低展示量。
按天展示广告，即在固定时间——自然日的24小时内，固定位置——推荐流前四次刷新的第四位，进行展示的广告，其几乎可以覆盖所有当日头条用户。</p>
<h5 id="开屏广告" tabindex="-1"><a class="header-anchor" href="#开屏广告" aria-hidden="true">#</a> 开屏广告</h5>
<p>截至2014年底，每天至少有1800万人在使用今日头条。该广告位可以让你的产品或活动出现在今日头条第一屏，所有打开今日头条的用户都将先看到持续数秒的静态或动态画面展示。</p>
<h5 id="信息流广告" tabindex="-1"><a class="header-anchor" href="#信息流广告" aria-hidden="true">#</a> 信息流广告</h5>
<p>信息流广告和新闻资讯长得一模一样，当用户习惯性阅读新闻标题时，你的slogan或活动信息就会自然地融入其中，被用户接受。 在推荐信息流中，所有涉及图片的新闻都以小图呈现，是今日头条的一种原生广告产品；大图模式可以让用户在一整屏信息中率先看到你。</p>
<p>信息流广告大图</p>
<p>信息流广告小图</p>
<p>信息流下载广告大图</p>
<p>信息流下载广告小图</p>
<p><img src="@source/docs/theme-reco/img/广告行业知识/image-20230305213209020.png" alt="image-20230305213209020"></p>
<h5 id="补充固定位保量广告-gd" tabindex="-1"><a class="header-anchor" href="#补充固定位保量广告-gd" aria-hidden="true">#</a> 补充固定位保量广告(GD)</h5>
<p>GD广告（全称：Guaranteed Delivery）：保证交付量广告。
补充固定位保量广告，即按照提前约定的广告展示量，来进行售卖的固定位广告形式。GD广告会出现在一天中，用户前六次刷新推荐频道的其中一次的第四位。</p>
<h4 id="竞价广告-cpm-cpc-cpa" tabindex="-1"><a class="header-anchor" href="#竞价广告-cpm-cpc-cpa" aria-hidden="true">#</a> 竞价广告(CPM/CPC/CPA)</h4>
<p>CPM（全称：cost per mille）：千人展示成本，即广告被展示1000次所需要的费用。
CPC（全称：cost per click）：单次点击成本，即广告被点击一次所需要的费用。
CPA（全称：cost per action）：单次下载成本，即APP被下载一次所需要的费用。仅限安卓APP。
竞价广告，即根据实时竞价，在信息流中以不固定位置出现，并按照广告效果付费的广告形式。竞价期间，出价较高的广告主可获得优先展示资格，其广告效果同时可获得更多保证。</p>
<h5 id="信息流广告-1" tabindex="-1"><a class="header-anchor" href="#信息流广告-1" aria-hidden="true">#</a> 信息流广告</h5>
<h5 id="详情页广告" tabindex="-1"><a class="header-anchor" href="#详情页广告" aria-hidden="true">#</a> 详情页广告</h5>
<p>在资讯详情页中出现的广告，位于资讯全文结尾的下方。广告展现形式有三种：一句简单文字介绍；或一张小图＋一个标题＋一句简单的介绍，或放置一张图片banner。通过点击这些图示，可直接跳转至广告页面。</p>
<h4 id="所有广告位" tabindex="-1"><a class="header-anchor" href="#所有广告位" aria-hidden="true">#</a> 所有广告位</h4>
<h5 id="开屏-静态不可点击-静态可点击-动态不可点击-动态可点击-广告" tabindex="-1"><a class="header-anchor" href="#开屏-静态不可点击-静态可点击-动态不可点击-动态可点击-广告" aria-hidden="true">#</a> 开屏 静态不可点击\静态可点击\动态不可点击\动态可点击 广告</h5>
<p>计费：CPD包天
投放：可按省投放</p>
<p><img src="@source/docs/theme-reco/img/广告行业知识/kaiping1.jpg" alt="今日头条开屏广告"></p>
<h5 id="信息流-小图-落地页-广告" tabindex="-1"><a class="header-anchor" href="#信息流-小图-落地页-广告" aria-hidden="true">#</a> 信息流 小图 落地页 广告</h5>
<p>计费：CPD\CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_s_luodi.jpg" alt="今日头条信息流小图落地页广告"></p>
<h5 id="信息流-组图-落地页-广告" tabindex="-1"><a class="header-anchor" href="#信息流-组图-落地页-广告" aria-hidden="true">#</a> 信息流 组图 落地页 广告</h5>
<p>计费：CPD\CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_z_luodi.jpg" alt="今日头条信息流组图落地页广告"></p>
<h5 id="信息流-大图-落地页-广告" tabindex="-1"><a class="header-anchor" href="#信息流-大图-落地页-广告" aria-hidden="true">#</a> 信息流 大图 落地页 广告</h5>
<p>计费：CPD\CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_d_luodi.jpg" alt="今日头条信息流大图落地页广告"></p>
<h5 id="信息流-小-大图-电话拨打-落地页-广告" tabindex="-1"><a class="header-anchor" href="#信息流-小-大图-电话拨打-落地页-广告" aria-hidden="true">#</a> 信息流 小\大图 电话拨打&amp;落地页 广告</h5>
<p>计费：CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/xinxiliu-s-boda.jpg" alt="今日头条信息流拨打电话广告"></p>
<h5 id="信息流-小-组-大图-文章-广告" tabindex="-1"><a class="header-anchor" href="#信息流-小-组-大图-文章-广告" aria-hidden="true">#</a> 信息流 小\组\大图 文章 广告</h5>
<p>计费：CPD\CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_ds_wenzhang.jpg" alt="今日头条文章广告"></p>
<h5 id="信息流-小图-app直接下载-广告" tabindex="-1"><a class="header-anchor" href="#信息流-小图-app直接下载-广告" aria-hidden="true">#</a> 信息流 小图 APP直接下载 广告</h5>
<p>计费：CPD\CPC\CPM\CPA(CPA仅限安卓)
投放：可按城市区县\兴趣投放</p>
<p>两种安装方法： 1、点击广告进入下载页，再安装。 2、点击“立即下载”直接下载、自动安装，无需再点</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_s_xiazai.jpg" alt="今日头条APP下载广告"></p>
<h5 id="信息流-大图-app直接下载-广告" tabindex="-1"><a class="header-anchor" href="#信息流-大图-app直接下载-广告" aria-hidden="true">#</a> 信息流 大图 APP直接下载 广告</h5>
<p>计费：CPD\CPC\CPM\CPA(CPA仅限安卓)
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xinxiliu_d_xiazai.jpg" alt="今日头条信息流大图APP下载广告"></p>
<h5 id="详情页-横幅-落地页-广告" tabindex="-1"><a class="header-anchor" href="#详情页-横幅-落地页-广告" aria-hidden="true">#</a> 详情页 横幅 落地页 广告</h5>
<p>计费：CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xiangqingye_hengfu_luodiye.jpg" alt="今日头条详情页告"></p>
<h5 id="详情页-app下载-广告" tabindex="-1"><a class="header-anchor" href="#详情页-app下载-广告" aria-hidden="true">#</a> 详情页 APP下载 广告</h5>
<p>计费：CPC\CPM
投放：可按城市区县\兴趣投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/yangshi_xiangqingye_xiazai.jpg" alt="今日头条详情页APP下载广告"></p>
<h5 id="城市频道-信息流-小-组-大图-落地页-文章-广告" tabindex="-1"><a class="header-anchor" href="#城市频道-信息流-小-组-大图-落地页-文章-广告" aria-hidden="true">#</a> 城市频道 信息流 小\组\大图 落地页\文章 广告</h5>
<p>计费：CPD
投放：只能按城市投放</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/xinxiliu-chengshi.jpg" alt="今日头条城市频道广告"></p>
<h5 id="专题板块-信息流-小-组-大图-落地页-文章-广告" tabindex="-1"><a class="header-anchor" href="#专题板块-信息流-小-组-大图-落地页-文章-广告" aria-hidden="true">#</a> 专题板块 信息流 小\组\大图 落地页\文章 广告</h5>
<p>计费：CPD。
投放：只能全国投放 已支持CPC竞价方式投放，可定向。</p>
<p><img src="http://toutiao.appun.cn/yangshi/images/xinxiliu-bankuai.jpg" alt="今日头条频道广告"></p>
<h3 id="_2-今日头条根据用户的阅读兴趣推送新闻-如何做到的" tabindex="-1"><a class="header-anchor" href="#_2-今日头条根据用户的阅读兴趣推送新闻-如何做到的" aria-hidden="true">#</a> 2.今日头条根据用户的阅读兴趣推送新闻，如何做到的？</h3>
<p>通过用户以往阅读的新闻类别、文章标签推测用户的兴趣。用户阅读的新闻越多，推测用户兴趣越准。你看的新闻、文章越多，我越了解你。</p>
<p>例如一个最近要装修的用户会经常留意装修相关文章，装修陷阱、装修技巧、室内设计等等。此时，这个用户就具有了装修属性，向他推送装修相关的广告就会更精准。装修过后，用户会大幅减少阅读相关文章数量，那么这个用户就不具备装修属性了。买车也是相同的道理。对于母婴、育儿来说这个周期会更长。</p>
<p>对于一个喜好美食用户来说，他的兴趣是长期的。</p>
<p>通过阅读新闻、文章推测用户兴趣，这是除了百度搜索外最精准的获取用户需求的方法。</p>
<p>可以根据以下纬度投放广告：</p>
<ol>
<li>
<p>性别</p>
</li>
<li>
<p>年龄</p>
</li>
<li>
<p>兴趣</p>
</li>
<li>
<p>关键词</p>
</li>
<li>
<p>城市\区</p>
</li>
<li>
<p>作息时间</p>
</li>
<li>
<p>天气</p>
</li>
<li>
<p>职业</p>
</li>
<li>
<p>运营商</p>
</li>
<li>
<p>手机操作系统</p>
</li>
<li>
<p>手机品牌</p>
</li>
<li>
<p>网络类型</p>
</li>
<li>
<p>文章类别</p>
</li>
<li>
<p>根据用户兴趣不同，动态显示广告标题</p>
</li>
</ol>
<h3 id="_3-推广计划有哪些类型" tabindex="-1"><a class="header-anchor" href="#_3-推广计划有哪些类型" aria-hidden="true">#</a> 3.推广计划有哪些类型？</h3>
<p>落地页面，今日头条文章，应用下载，电话拨打，详情页广告，段子应用下载，段子落地页面</p>
<h5 id="_3-今日今日头条广告产品" tabindex="-1"><a class="header-anchor" href="#_3-今日今日头条广告产品" aria-hidden="true">#</a> \3. 今日今日头条广告产品</h5>
<p>3.1. 开屏广告</p>
<p>用户打开APP展现的广告，按天购买。</p>
<p>3.2. 什么是CPT广告</p>
<p>Cost Per Time，即按时长计费广告，按时长计费是包时段包位置投放广告的一种形式，今日头条是按天售卖的广告位置。强曝光、独占性，广告主选择广告位和投放时间，费用与广告点击量无关，代表用户第Y次刷新的第X个位置，4-1指的是一个用户每天第1次刷新时第4位的广告。目前今日头条有4-1，4-2，4-3，4-4这4个位置可以通过CPT方式售卖；</p>
<p>3.3. 什么是CPM广告？</p>
<p>Cost Per Mille，千次展示成本，即按展示付费</p>
<p>3.4. 什么是CPC广告？</p>
<p>Cost Per Click，每个点击成本，即按点击付费</p>
<p>3.5. 什么是GD广告？</p>
<p>Guarentee Delivery，保证递送的广告，即保量广告，按展示量定价</p>
<p>3.6. 今日今日头条推广的广告类型具体含义？</p>
<ol>
<li>
<p>落地页面：点击跳转到h5页面，进行推广的广告；</p>
</li>
<li>
<p>今日头条文章：通过今日头条文章达到推广目的；</p>
</li>
<li>
<p>应用下载：APP推广，用户点击后可以进行直接下载</p>
</li>
<li>
<p>电话拨打：用户点击后可以直接拨打电话；</p>
</li>
<li>
<p>详情页广告：文章读完后展现的广告。</p>
</li>
<li>
<p>段子应用下载：在“内涵段子”平台上进行APP推广；</p>
</li>
<li>
<p>段子落地页面：在“内涵段子”平台上进行推广的落地页面。</p>
</li>
</ol>
<h5 id="_5-出价设定" tabindex="-1"><a class="header-anchor" href="#_5-出价设定" aria-hidden="true">#</a> \5. 出价设定</h5>
<p>5.1. 什么是CPC出价？</p>
<p>CPC出价是您愿意为一次点击所支付的费用，出价和广告质量度息息相关，在质量度完全相同的情况下，出价越高，广告获得展现的机会越大，建议您根据自己所能承受的最大价格出价，获得好的推广效果。</p>
<p>5.2. 什么是CPM出价？</p>
<p>CPM出价是您愿意为广告千次展示所支付的费用，出价和广告质量度息息相关，与cpc混合竞价，在质量度完全相同的情况下，出价越高，广告获得展现的机会越大，建议您根据自己所能承受的最大价格出价，获得好的推广效果。</p>
<p>5.3. 什么是最低出价，我的出价是否可以低于最低出价？</p>
<p>最低出价是指广告上线展现，设定的最低价格。您的出价不能低于最低出价，如果低于最低出价将不能获得展现机会，且不能提交成功。</p>
<p>5.4. 什么是建议出价？我的出价高于建议出价，一定能投放出来广告吗？</p>
<p>建议出价是根据定向受众和竞争广告的出价确定的，如果出价高于建议出价，一般是能投放出来广告的。</p>
<p>5.5. 竞价排名基本规则是什么？</p>
<ol>
<li>
<p>CPC广告是结合广告的出价和质量度预估进行排序。</p>
</li>
<li>
<p>CPM广告是按照CPM的出价高低进行排序。</p>
</li>
<li>
<p>CPC&amp;CPM广告同时竞价时，会综合评估广告质量度与出价进行排序。</p>
</li>
</ol>
<p>5.7. 出价越高，获得展示的机会就越多吗？</p>
<p>我们竞价平台是出价和质量度两个因素来共同决定的，出价高，质量度低，广告也不一定能获得展现。</p>
<p>5.8. 平均点击价格为什么会不一样？</p>
<p>点击价格是根据您的出价和质量度共同决定的，与别的客户也有竞争关系，同时也是系统根据即时的情况实时计算的。在不同时刻，由于以上因素的变动，点击价格都会发生变化。</p>
<p>5.9. 为什么广告计划结束后，还有继续扣费的情况？</p>
<p>广告计划结束后，会有一部分缓存，用户看到也会算一次展现，今日头条设定的规则是计划结束后继续扣费3小时。</p>
<p>5.10. 什么是尽快投放？</p>
<p>价格和质量度达到要求后，根据广告投放的需求，尽快的展现广告。</p>
<p>5.11. 什么是平均投放？</p>
<p>价格和质量度达到要求后，根据广告的投放需求，匀速的展示广告。</p>
<p>5.12. 什么是按小时投放？</p>
<p>价格和质量度达到要求后，根据广告的投放需求，按小时展示广告。</p>
<p>5.13. 我可以看到别的广告主的出价吗？</p>
<p>不能。出价作为您的商业策略的一部分将受到今日头条广告平台的严格保护，其他客户将无法获知您的出价信息，您也无法查看其他客户的出价信息。</p>
<p>5.14. 为什么广告暂停后仍有数据？</p>
<p>暂停按钮的意义在于停止继续投递广告，但是对于已经投递出去的广告，我们仍会统计用户浏览和点击所产生的数据，即为缓存。</p>
<p>5.15. 为什么暂停的广告还要收费？</p>
<p>对于收费，我们从两个维度进行控制：当所设置的预算和结束日期，任意一 项指标到达后，将停止收费。在整个投放周期内暂停广告，仍将会对缓存收取费用。若计划不再予以投放，应修改结束时间，则视为投放结束。</p>
<p>5.17. 关于后台的总花费是怎么算出来的？平均单价为什么会比最低竞价低？</p>
<p>总花费是依照所选择的投放形式根据效果进行计费的（点击/展示），由于广告完成投放后还会有缓存数据的产生，而这一部分我们并不计费，导致平均出价降至低于最低出价。</p>
<p>5.18. 为什么点击率很高，我却刷不到广告？</p>
<p>广告根据实时的竞价情况赢得展示量，并非一次性投放给所定向的受众。同时预算不足以覆盖所有受众的情况下，更难以确保每个人都可以看到广告。</p>
<p>5.19. 怎么解决广告投放缓慢的问题？</p>
<p>投放缓慢的根本原因是受众对广告不接受或者没有投放给正确的受众，更换品质更高的素材可以增强受众的直观感受；同时可以依照受众分析对广告的定向进行进一步的优化，避免覆盖过广导致点击率稀释。除去上述的办法，单纯增加竞价，也可以避免进入投放缓慢的状态。</p>
<p>5.20. 为什么广告状态投放中，展示和点击都很少？</p>
<p>当天整体广告的库存过于饱和的时候，所有广告的展示量都会受到影响；如果在竞价系统中，大多数广告的出价都高于您的广告，您的广告也会在展示量上处于劣势。此外，由于广告组中的计划会瓜分相同定向人群的展示量，组内投放中的广告过多时，每个计划都只会分到有限的展示。</p>
<p>6.2. 什么是地域定向？</p>
<p>您选择地域的定向方式以后，只有当该地域的用户登录今日头条后，才会出现您的广告。对不同地区的潜在客户制定差异化的投放计划，从地域角度精准定位您的客户，目前支持省市级二级地域定向。</p>
<p>6.3. 什么是平台定向？</p>
<p>分iOS／Android/，定向iOS，只有使用iOS系统的用户能看到，定向Android，只有使用Android系统的用户能看到广告。</p>
<p>6.4. 什么是网络定向？</p>
<p>定向wifi环境，只有在使用wifi环境的用户能看到推广内容。</p>
<p>6.5. 什么是兴趣定向？</p>
<p>根据您推广产品的特征，选择您认为对应潜在客户的兴趣投放，加上今日头条对用户的精准分析，可以帮助您提高广告点击率。</p>
<p>6.6. 什么是智能托管？</p>
<p>帮助优化推广的工具，不仅可以方便快捷的一键式投放，自动搜素精准人群，而且Ctr效果大幅度提升，帮助客户挖掘潜在目标，使用的越久，越能精准的帮你找到目标人群。</p>
<p>7.3. 什么是展示数？</p>
<p>用户看到广告的曝光次数</p>
<p>7.4. 什么是点击数？</p>
<p>用户看到广告后点击广告的次数</p>
<p>7.5. 什么是点击率？</p>
<p>点击广告次数／展示曝光次数＝点击率</p>
<p>9.2. 质量度是什么？</p>
<p>质量度是广告的质量得分，与账户历史表现，点击率，落地页加载速度和相关性，创意的相关性以及推广客户的信用都息息相关。</p>
<p>9.3. 质量度跟广告展示有什么关系？</p>
<p>质量度越高，广告获得展示的机会越大。</p>
<p>9.4. 质量度为什么会有变化？</p>
<p>质量度的影响因素有很多， 随着点击率变化、创意修改、账户其它调整等，以及其他客户优化行为等等），质量度也将不定期地更新。</p>
</div></template>


