import{_ as p,o as n,c as t,f as o}from"./app-df98666f.js";const e={},a=o(`<p>[XCAR 成都 资讯]</p><pre><code>经典搞笑台词之一

1.大什么大?哥什么哥?你有没有公德心啊!让不让街坊睡了!明天还要上班的。真是一群败类!

2.兄弟从前的情感生活，那也是颇为凌乱的。

3.我花8万买了个西周陶罐，昨儿到《鉴宝》栏目进行鉴定，专家严肃地说：&quot;这哪是西周的?这是上周的!

4.我要让全世界知道我很低调!

5.我一秒钟几十万上下，我会和你去踢球?

6.施主，贫僧是来化缘的，请问有酱肘子么?炸鸡腿也行，善哉。

经典搞笑台词大全，句句经典难忘

经典搞笑台词

经典搞笑台词之二

1.始终没有沦为一个优秀的大学生，靠的就是坚强的品质!

2.同时绽放在夜空里的花火，看得到彼此美丽的时刻，我却无法照亮你的一生。

3.鸡也有爱国的!

4.贫僧乃少林寺方丈，法号梦遗。阿弥陀佛，我随风而来，随风而去。

5.错!这并不是个普通的箱子，它是箱中之神，简称箱神!

6.我觉得一定有很多人暗恋我，因为这么多年了，也没有人跟我表白!

经典搞笑台词大全，句句经典难忘

经典搞笑台词

经典搞笑台词之三

1.人要是无聊啊，鼻涕泡都能拿来玩会。

2.不经历星期一上午的崩溃，就不知道星期五下午的可贵。

3.什么是坏人，白天脱裤子的男人，晚上不卸妆的女人。

4.不能因为咱俩有过节，你就把我当节过。

5.一分钟有多长?这要看你是蹲在厕所里面，还是等在厕所外面。

6.小时候最怕的，不是梦见自己找厕所没有找到。而是人还没醒过来，厕所找到了。

爱情公寓搞笑台词

1、一菲：霸气侧漏。

2、“这年头猪都涨价，凭什么你不能涨价。”

3、好男人就是我我就是曾小贤。

4、我真想在你脑子里装个抽水马桶把你脑子里那些恶心的东西都冲掉……那他整个脑子都要被冲掉了。

5、我本来还想替男生争光的，现在真的光了。

6、死不可怕，坐着等死才可怕。

7、谁家的孩子不看好，马路上是跳橡皮筋的地方吗？

8、小贤：以前是电视剧里插播广告，广告一出来，观众全部上洗手间了，现在倒好，广告里插播电视剧，片头曲一出来，观众全去厕所了！

9、我们是两个站在街头即将放飞理想的有志青年。

10、张伟：我是三届法学院夏令营柔道殿军蝉联者，而且最后一届差点就成了季军！

11、打人不提倡打脸上自尊，我们兄弟连心，只要你敢对我们任何一个人使用暴力，我们另外两个就会，报警的。

12、我闻到了奸情的味道。

13、我们是两个站在街头即将放飞理想的有志青年。

14、青菜里面有青虫，粉丝里面有铁丝

15、如果没有规则，那么输赢就没有意义，输赢没有意义，那么比赛就没有意义。

16、新一代都市女性，上得了厅堂，下得了厨房，杀得了木马，翻得了围墙，开得起骑车，买的起洋房，斗得过小三，打得过流氓！

17、天呐，我跳进日本海都洗不清了。

18、我当了皇帝，就封你当太子。

19、悠悠：吵架是不好的行为……干脆决斗吧！

20、你这跟直接去投胎有什么区别？

21、上得了厅堂，下得了厨房，杀得了木马，翻得了围墙，开得了汽车，买得起洋房，斗得了小三，打得赢流氓。大家都要幸福啊。

22、人生如戏，爱的是一个，结婚生子的又是另一个。很正常。

23、她要做的不是菜，是太太。

24、“你是李小璐！”“你什么眼神啊！”“那你一定是周迅！”“对，没错，是我，这都被你看出来了！”

25、你今天晚上必须给我上线，否则，我就把你名字写到碑上去。

26、我会十几种不同的死法。

27、“截肢是不能生小孩的手术吧。”“那叫结扎。”

28、“这戒指里有一行字！”“我知道，‘madeinChina’！”

29、我是曾哥跟你说了信我信我……

30、你头和屁股又装反了吧。

31、他和猪的区别就在于，猪不能变成人，但是他隔三差五就变成猪。

32、我肯定会被砍成薯片的。

33、关谷：你每天都跟他们聊到半夜，他们哪有时间创造人类啊！

34、你是什么座的？我是肉做的。

35、曾小贤：好男人就是我，我就是曾小贤。

36、帮我把胡萝卜切成肉丁。

37、现在生米都已经煮成稀饭了。

38、如果开着一辆车，车里坐在小红和小明，请问车主是谁？答案：是如果

39、左眼跳，桃花开，右眼跳，菊花开。

40、谁家的孩子不看好，马路上是跳橡皮筋的地方吗？

41、意见一致，我说了算。意见不一致，她说了算。

42、逃得了和尚，逃不了方丈。

43、机会如雨点般的向我打来。但我却一一躲过。

44、你怎么能说他脑子进水了呢？前提是，也要有脑子啊。

45、现实生活没有彩排，都是现场直播。

46、面对现实吧，生活往往比那些偶像剧的口味要重的多。

47、一菲：要想生活过的去，身上必须带点绿~！

48、比赛就是比赛，你可以不参加，参加了呢，就要遵守比赛规则，承担一切后果。

49、彪悍的人生是不需要解释的！

50、唾沫是用来数钞票的不是用来讲理的。

51、没有金刚钻就别揽瓷器活，没有金箍棒就别穿小短裙。

52、“妈咪，你也懂网球。”“当然啦，我特别喜欢邓亚萍。”

53、你真是比李连杰还甄子丹！

54、子乔：你还英明？你就是个人名！

55、送外卖的：同是天涯香肠嘴，相煎何太急！

56、子乔：根据她的做菜水平，青菜里有青虫，粉丝里有铁丝！

57、张伟：现在生米已经煮成稀饭了！

58、你有什么身份你就有个身份证。

59、人生自古谁无死，早死晚死都得死。

60、我当了皇帝，就封你当太子。

61、“这里就有一部国产片，桃花侠大战菊花怪。”“坑爹的吧。”

62、我不是什么名流我就是个人流！

63、胡一刀是你什么人？

64、当官不为民做主，不如回家卖红薯。

65、小贤：我拉坏了要吃肚子。

66、一菲：你今晚必须给我上线，否则，我就把你的名字写到碑上去。

67、悠悠：拜托，这么老的片子，你考古啊！

68、小贤：我真不是故意要知道的，你可以格式化我啊！

69、我现在不仅淡定，而且蛋疼！

70、羽墨：我对时间过敏！

71、相聚和离别，仿佛一个转身，一圈接着一圈，连成生命的舞蹈，有的人还会回来，有的人知道再见太难。

72、一菲：常言道，冰冻三尺，非微波炉不能解冻！

73、会说话的猩猩都比强一万倍，我骂你是缩头乌龟都侮辱了这个词。

74、说的好，说了一大堆，我没怎么听懂。

75、“你就是口井———横竖都二！”

76、吵架总是不好的，不如，干脆决斗吧？

77、还好不是红酒否则我的衣服就废了还好不是硫酸否则你的脸就废了。

78、关谷：柯南要是活着也会被气成毛利小五郎的！

79、这部剧真的不错，特别是你们那个编剧，实在是太有才了啦。他是智障学校毕业的吧。他写的剧情，比绵羊音还要糟糕，摸过的键盘，连阿米巴原虫都活不下去；他和猪最大的区别就是，猪不能随便变成人，而他隔三差五就变成猪。我猜他是用猪蹄写的剧本，我建议他吃点痔疮药，治疗一下他的口蹄疫。

80、子乔：我愿意用我的感情，包括肉体偿还一切！

81、我一口盐汽水喷死你。

82、跟我打赌，不是看你要什么，而是看我有什么…

83、张伟：我从来不吃口香糖，又不能咽下去。

84、我一口盐汽水喷死你。

[XCAR 成都资讯]

1.当面对两个选择时，抛硬币总能奏效。并不是因为它总能给出对的答案，而是在你把它抛在空中的那一秒里。你突然就知道，你希望的结果是什么了。——曾小贤《爱情公寓》

2.28岁怎么了，我最痛恨的就是年龄歧视！黄忠六十跟刘备，德川家康七十打天下，姜子牙八十为丞相，佘太君百岁挂帅，孙悟空五百多岁西天取经，白素贞一千多岁还下山谈恋爱呢！——秦羽墨《爱情公寓》

3.在我安定下来，找到一个适合的终生伴侣之前，我得先找到我自己。——宛瑜《爱情公寓》

4.爱情不是时光旅行，所有人都想回到一开始，可没有人能做到。过去的，就让它过去吧，该放下的，总要学会放下。——吕子乔《爱情公寓》

5.彪悍的人生不需要解释。

6.不用解释了，我来告诉你什么是解释，解释就是通过观察和思考说明事物变化的原因或事物之间的联系或事物发展的规律，你解释就是为了掩饰，掩饰的就是事实，事实就是罪恶的开始，人类喜欢掩饰正是人类最大的悲哀。

7.你让我走，我走了；你让我回来，对不起，已经走远了。——李金铭《爱情公寓》

8.从不温柔、从不体贴、从不讲理、说不得、打不得、骂不得、惹不得……新三从四德。——胡一菲《爱情公寓》

9.我的优点是我很帅，但我的缺点是我帅的不明显。

10.那时候天还是蓝的，水也是绿的，鸡鸭是没有禽流感的，猪肉是可以放心吃的。那时候照像是要穿衣服的，欠债是要还钱的，丈母娘嫁闺女是不图你房子的，孩子的爸爸…也是明确的。

11.火车是朝前开的，去哪儿并不重要，关键在于窗外的风景。——吕子乔《爱情公寓》

12.你就是一口井，横竖都二。——胡一菲《爱情公寓》

13.曾小贤：我不是那种随便的人！胡一菲：你随便起来不是人！

14.相聚和离别，仿佛一个转身，一圈接着一圈，连成生命的舞蹈，有的人还会回来，有的人知道再见太难。

15.我承认我很喜欢你，我也曾经为你，疯狂过、迷失过、伤心过，可我已经无法再说服自己再去爱你了，我们俩的世界离得太远了，我不能因为贪图自己一时的满足，而耽误了自己，也耽误了你。

16.与其纠结着无法改变的过去，不过微笑着面对未来，因为生活，没有如果。

17.你再出去晒晒太阳吧，晒得再黑一点，就没人叫你白痴了！--关谷神奇《爱情公寓》

18.故事还在继续，我们却越走越远。上线，是为了打发寂寞；隐身，是为了躲避失望。失去的不再回来，回来的不再完美，完美的不是我的，我的又在哪儿呢？也许我的命运真的就是这样子糟乱，这样不堪吧。人生有时候就是这样的……

19.永远不要歧视疯子他只是和你的世界观不同而已

20.人的一生都会扮演很多角色，如果你不高兴，你可以把剧本扔了。不过记住，有一份剧本是真正属于你的，千万别丢错了。

[XCAR 成都资讯]

【爱情公寓语录】

1、关谷：饿着，那你就多吃点啊。悠悠：他说的是恶兆。恶是凶恶的恶，兆是凶。——《爱情公寓4》

2、我曾经尝试用面条上个吊，用降落伞跳过楼，用豆腐撞过头，用薯片割过脉!——《爱情公寓4》

3、小贤：学士硕士全灭，男博士仅能自保，要打赢女博士，哼哼，只有靠圣斗士了。——《爱情公寓2》

4、张伟：形势比预计的还要糟糕，做贼心虚曾经是中华民族的传统美德，现在也消失了。——《爱情公寓2》

5、子乔：我跟她说我离开她是因为我是那威星人，我说我的星球需要重建，所以我就走了。——《爱情公寓2》

6、小贤：你小心，我放心。你贪心，我担心。你有心，我开心。你花心，我恶心。你负心，我伤心。一声祝福一片心，你的月亮我的心，新春祝福是真心。——《爱情公寓2》

7、一菲：我要是见不着那个男人我就让你消失!生物学和社会学双重意义上的消失!——《爱情公寓1》

8、宛瑜：狗饼干含有丰富的护发素和去屑配方，吃了以后头发去无踪，头屑更出众!——《爱情公寓1》

9、展博：姐，你不是说早起的鸟儿有虫吃吗?

一菲：我发现我错了，是早起的虫子被鸟吃。——《爱情公寓1》

10、子乔：曾小贤，你是一个男人，能让你兴奋的应该是魔鬼的身材而不是魔鬼的后妈!——《爱情公寓2》

11、一菲：现在演戏的都唱歌去了，唱不了歌的都写书去了，写不了书的都演戏去了，演戏也不行就又唱歌去了。演艺圈是个圈嘛!——《爱情公寓2》

12、一菲：有道理，让我算算有多少人听你的节目。一，二，三，四……60亿乘以0是多少来着?——《爱情公寓2》

13、诺澜：小贤他只是轻微的面部发抖，手脚出汗，毛孔张开，并且他的椅子有点不太适合他，你长痱子了吗?——《爱情公寓3》

14、关谷：我知道你知道别人不知道你知道，可是我以前看过你的演出，所以你应该知道我知道你知道啊。——《爱情公寓2》

15、一菲：我觉得这事儿完全不靠谱儿，中国男足世界杯夺冠和你的离谱程度其实差不多。——《爱情公寓1》

16、那你给我解释一下，为何在你的鞋子里会有一块砖头，而且这块砖头还会发光?——《爱情公寓4》

17、小贤：有道是，晚会无真唱，采访无实话，电台无美女，这是传媒界不变的三大定律!——《爱情公寓3》

18、关谷：活到老，学到老，原来这就是服部半藏流传下来的东西，那他一定死不瞑目了。——《爱情公寓3》

19、羽墨：根本就没有什么UPUP丰胸操，都是我编出来的。如果你们真的有需要，垫硅胶才是王道。——《爱情公寓2》

20、展博：佘山只是一个丘陵，海拔还不到一百米，没有雪，没有瀑布，没有薰衣草，更没有高高的，骨灰。——《爱情公寓3》

21、小贤：那你们女生有什么健康的爱好啊，不就是上上网，逛逛街，上上网，逛逛街，看电视，上上网，逛逛街。——《爱情公寓3》

22、小贤：口香糖……网络传言说如果5片一起吃，通过咀嚼的动作也可以营造出饱的感觉，而且最关键——不会胖，最适合失恋的人群!——《爱情公寓2》

23、子乔：头戴三叉束发紫金冠体挂西川红棉百花袍身披兽面吞头连环铠腰系勒甲玲珑狮蛮带手持方天画戟坐下嘶风赤兔马之吕小布是也。——《爱情公寓3》

24、一菲：吕子乔上厕所塞马桶，买易拉罐没有拉环，买奶茶没有吸管，吃西瓜都是西瓜子，排队永远被人插队，永远挤不上公交车，所有女友一年内全部出家。——《爱情公寓3》

25、子乔：关二爷啊，咱们这么多年交情了，你这次不能不帮我啊。如果你能保佑我读过这次难关，我吕小布发誓，以后永远永远永远永远永远不上开心网了。——《爱情公寓2》

26、展博他们开车送曾小贤，展博开的太慢，后面有人按喇叭，一菲拿出个牌子让子乔放在后面，上面写着：驾校开除，自学成才，新手上路，擅长急刹。——《爱情公寓1》

27、一菲：你脑子里装的都是屎吗?曾小贤：我脑子里装的都是你。我不是那个意思。——《爱情公寓4》

28、关谷：今天老师让我造句，说形容一个人很开心，所以我说了“含笑九泉”。——《爱情公寓1》

29、小贤：我允许你在我的世界里走来走去，但绝不允许你在我的世界里跑来跑去。——《爱情公寓1》

30、关谷：我要对你的生活负责，我是一个要结婚的男人，面对现实生活应该脚踏实地。——《爱情公寓4》

31、史小明：我记得我睡着之前，已经写了一半，醒来之后发现，前面那一半，只是个梦。——《爱情公寓4》

32、美嘉：这就是你们新新人类的爱情观，你们赢了，地球都是你们的，我们全是奥特曼。——《爱情公寓4》

33、子乔：如果你没有征兆向女孩表白你通常会被误以为准备抢劫准备借钱准备殉情。——《爱情公寓1》

34、曾小贤：我已经拉下脸和她谈过了，手表的表，生鱼片的生，气球的气，连起来读就是：不要(表)生气啊。——《爱情公寓4》

35、小贤：我不是随便的人!

一菲：你随便起来不是人!——《爱情公寓1》

36、警察：二十分钟之前我就看着你们吐到现在，我活了四十多年，没见过这么无聊的人。关谷：那你还看了二十分钟。——《爱情公寓4》

37、一菲：俗话说情人眼里出西施，那西施眼里出什么?

小贤：(想了一会)眼屎啊!——《爱情公寓1》

38、张伟娘娘腔：我一个大男人怎么会八卦呢。这才是咱们女人的正常的条件反射嘛，讨厌啦，你不要在意这些细节。——《爱情公寓4》

39、悠悠：是我不好，我太喜欢话剧了，可又怕选不上。后来我想，不能在一棵树上吊死，所以我就在两棵树上都挂了绳子……——《爱情公寓2》

40、子乔：肠胃缺乏有机调理，导致消化功能紊乱，再加上现在地球自转越来越慢，引力越来越小，哎，不容易啊!——《爱情公寓1》

41、美嘉：看看你那张大脸，每次站你旁边我手机都没信号，走到马路上都看不到太阳!看见你我相信基因真的是会突变!——《爱情公寓1》

42、子乔：现在你的眼神很像梁朝伟，眉宇间有点金城武的味道，拿啤酒的动作，乍一看像吴镇宇。就是脸长的像曾志伟。——《爱情公寓4》

43、展博：蛋炒饭也称饭炒蛋里面只有三样东西：饭、蛋、盐。我姐有4样，还有她的秀发。

一菲：今天有第5样，我的假指甲掉进去了。——《爱情公寓1》

44、一菲：我和展博以前是连体婴儿，两岁前我们俩脑子还长在一块呢。

小贤：对，然后医生刀一快，把脑子全给了展博。——《爱情公寓1》

45、一菲：有件事情我一直想说，可是不知道该不该说。

子乔：你拍古装片呢，这是你的台词吗?太假了。——《爱情公寓1》

46、导演：小姑娘，这叫古装魔幻苦情剧。现在光拍动作片哪儿还有阿姨妈妈要看，你要是没有婆媳、孽债和第三者，根本就别想上黄金档。——《爱情公寓2》

47、子乔：在课堂上，从来都是老师管老师讲，学生归学生睡，人鬼殊途，需要沟通吗?张伟：点名的时候还是要沟通的。——《爱情公寓4》

48、子乔：结婚以前，还有别的男人对你好，结婚以后，你就只剩下我了，可是婚后，我一定要对你更好，这样你才不会失落，不是吗?——《爱情公寓4》

49、一菲：做什么不重要，重要的是你能不能离我近点，不然我怎么保护你。

展博：你不可能保护我一辈子，你也会嫁人。——《爱情公寓4》

50、悠悠：我怕到时候没有光驱读啊，你想现在都已经开始普及蓝光了，到时候还不红光，白光，司马光都出来了，读张DVD我还要去博物馆啊?——《爱情公寓2》

51、一菲：冷静，冷静。心急吃不了热豆腐。

小贤：嗯，如果心不急，那豆腐很可能会让别人给吃了!——《爱情公寓2》

52、美嘉：工作账号，谢绝闲聊，若要强聊，每字五毛，标点符号，半价收费，千字以上，八折优惠，语音视频，暂未开通，在线支付，提供发票，诚征代理。——《爱情公寓1》

53、张伟：今天又不是过年，有哪条法律规定，我不送红包就应该遭到鄙视?

小贤：法律也没有规定过鄙视你需要得到你本人的同意啊。——《爱情公寓2》

54、悠悠：娱乐圈水太深，大家都是女人，你说女人何苦为难女人。所以啊，好好保重，女人一定要对自己好一点，特别是做演员的女人。一旦病倒了，就会有别的女人抢了你的饭碗，甚至花你的钱，住你的房，睡你的老公，还打你的娃!——《爱情公寓2》

55、关谷(唱)：巨龙巨龙你差两年，永永远远地差两年…

关谷(唱)：我不是蝗虫，我不是蜈蚣，我只要贱哥哥，完美的爱情。——《爱情公寓1》

56、关谷：可是你之前还看了40集的《我的亲娘在哪里》，80集的《离婚了不哭》，还有160集的《当媳妇熬成婆》。恭喜你……你经历了一个女人的一生!——《爱情公寓2》

57、一位听众说：对不起，去年去北极时把你妈妈弄丢了(原版是去年把你妈妈从5楼阳台上推了下去)，在此点一首孙楠的《你快回来》，请你原谅!——《爱情公寓1》

58、展博：姐，如果有一个人深深地伤害了你，那你要多久才能原谅他?

一菲：原谅他?原谅他是上帝的事情，我的任务，就是送他去见上帝!——《爱情公寓1》

59、张伟：(尔康的声音)上次在王爷府第一次见到你。

张伟：(花泽类的声音)每当你想哭的时候，你就倒立，这样，眼泪就不会流下来。——《爱情公寓4》

60、小贤：一群医生联合集体搞促销，我就认为那个睡眠日就是一群卖床垫的发明出来的，还有那个住房日，肯定就是房地产搞出来的，老百姓哪记得住那么多日子，又不放假?——《爱情公寓2》

[XCAR 成都资讯]

1、中华武器那么多你不学偏学剑。上剑不学学下剑。铁剑不学学银剑。终于学得人剑合一，成了剑人。

2、男人都是蜡烛，不点不亮。

3、多少年后，我们都还会记得那个留下我们无数欢笑和泪水的地方叫——爱情公寓!

4、爱情公寓似然天马行空，但是每个人都能在里面找到自己的影子，不管你爱纠结，爱直白，爱卖萌，爱耍帅，但都请不要忘记爱自己，爱你身边的朋友。

5、你丫是绵羊音啊，一开始跑偏了再也跑不回来了是不是?

6、我明白，我现在留的泪，都是当初选专业时脑袋里进的水。

7、人类的极限是由少数人创造的，不能一概而论。

8、你信不信我一巴掌把你拍墙上，抠都抠不下来!

9、没人牵手，我就揣兜。

10、小公鸡点到谁，我就选谁。

11、那种笑容，甜蜜优雅，仿佛春风拂过泸沽湖，秋雨浸润九寨沟。

12、没了寂寞，谁陪我。

13、听别人的故事，留自己的泪。

14、逃得了和尚，逃不了方丈。

15、原谅他是上帝的事情，我的任务，就是送他去见上帝!

16、左眼跳，桃花开，右眼跳，菊花开。

17、谁家的孩子不看好，马路上是跳橡皮筋的地方吗?

18、你见过四十岁的花童吗?

19、你头和屁股又装反了吧。

20、机会如雨点般的向我打来。但我却一一躲过。

21、面对现实吧，生活往往比那些偶像剧的口味要重的多。

22、帮我把胡萝卜切成肉丁。

23、你有什么身份你就有个身份证。

24、跟我打赌，不是看你要什么，而是看我有什么…

25、打人不提倡打脸上自尊，我们兄弟连心，只要你敢对我们任何一个人使用暴力，我们另外两个就会，报警的。

26、唾沫是用来数钞票的不是用来讲理的。

27、吵架总是不好的，不如，干脆决斗吧?

28、还好不是红酒否则我的衣服就废了还好不是硫酸否则你的脸就废了。

29、你头和屁股又装反了吧。

30、你这跟直接去投胎有什么区别?!

31、如果开着一辆车，车哩坐在小红和小明，请问车主是谁?答案：是如果。

32、逃得了和尚，逃不了方丈。

33、我真想在你脑子里装个抽水马桶把你脑子里那些恶心的东西都冲掉……那他整个脑子都要被冲掉了。

1、别听那些边抠脚边绞尽脑汁编心灵鸡汤的人告诉你应该怎么活着,说人生意义不在于赚了多少钱的不是巨有钱就是穷。只追求精神境界大多肉体不中看

2、很多年纪大还一事无成的长辈喜欢在年轻人面前吹牛逼。对于这种人,我们要尊敬。因为我们不仅同样一事无成,而且还是晚辈。

3、那些所谓的各种梦想,用通俗的语言讲无非是”多挣点儿钱”。

毒鸡汤的搞笑说说;赶快来喝点吧

4、每天夜里下定决心从明天开始改变,好好生活努力奋斗,第二天中午在被窝里翻个身:操,改天吧。

5、年轻人如果不知道自己想过什么样的生活,要成为什么样的人,那就先以世俗的看法来作为标准。一定不会错得太远。

6、每个人都以为自己与众不同,其实很容易分门别类。你没有什么不同的,你和你差不多环境成长的人基本都是一样的。

7、很多人说自己没钱但很幸福,是因为他们没尝过有钱又幸福的滋味。

8、总是觉得过去的自己很傻逼,其实再过一段时间,你就会发现,现在的你也很傻逼。

9、你知道吗?全世界的人口总数是奇数,这意味着,总有一个傻逼注定要单身。

10、又一年了,其实大家心里都清楚,明天不会是一个更新的自己,只会是一个更老的自己。

11、世上99%的事情都能用钱解决,剩下的1%,需要更多钱解决。

12、上帝是公平的,给你了丑的外表,还会给你低的智商,以免让你显得不协调。

一、装漂亮好累啊，幸好我是真漂亮。

二、现在有点讨厌自己了，尽管我再怎么努力，也只是别人眼中的美女。

三、你们一定要好好读书，不要像我一样靠着一张可爱的脸混吃混喝。

四、我是一个很自律的人，我既然说了要减肥，我就天天说。

五、小时候总想把头发梳成大人模样，长大后才发现，其实大人并没有什么头发。

六、吾日三省吾身，省着点吃，省着点买，省着点用。

七、我也想轻看自己，可我的体重不允许。

八、女娲一边捏土一边笑，盘古问她怎么了？女娲：“做人呐，最重要的就是开心。”

九、有公主病的，大部分不是公主，只是有病。

十、枯藤老树昏鸦，挣钱还不够花，依旧寡人孤家，我丑没人肯瞎。

十一、其实每次嘴上和你发完脾气，我都特别后悔，因为当时我真想动手打死你。

十二、世界是我们的，也是那些孩子们的，但迟早是那帮孙子们的！

十三、“为什么你给别人那么多情感建议，自己至今还是一条单身狗？”“你什么时候见过教练下场参与比赛的？”

十四、假如可以选择生活，我宁愿简简单单。一个茶杯、一间茅屋、一亩良田、一亿存款。简简单单，挺好。

十五、有人总说自己过得不好，一上秤却又胖了不少。

十六、当你生活不顺心的时候，不要慌。看看你的钱包和存款，哭出来就好了。

十七、老师你别再费心给我换座位了，我坐哪都能聊。

十八、像我这么单纯的孩子，从来不分析尔虞我诈的历史问题，更不会做那么有心机的数学题！

十九、我终于明白军训为什么要前后左右的转身了，这样才能晒得更均匀。

二十、每个学生最擅长的事情就是：在四个选项里排除两个错的，然后在剩下两个里面，选个错的。

二十一、课堂上最纠结的三句话：“看书干嘛？看黑板！”“看黑板干嘛？看我！”“看我干嘛？看书！”

二十二、别人发动态好想谈恋爱，一星期收获了爱情，我发动态好想谈恋爱，一年后还在发。

二十三、别人一夸我，我就担心，担心别人夸得不够。

二十四、每到夜晚，我的房间就好吵，所有零食都开始窃窃私语，表现自己，恨不得跑到我的床上跳进我的嘴巴里来。

二十五、往往是街边那些不起眼的店铺才能做出真正的美味。而那些富丽堂皇，灯红酒绿的大饭店，我没吃过。

二十六、谈恋爱应该处处让着男朋友，让他做饭，让他洗碗，让他洗衣服，让他赚钱。

二十七、如果规定一个人一生只能对一个好，我情愿那个人就是你，我无怨无悔，至死不渝！但偏偏没规定…那就算了！

二十八、老说自己老婆是败家娘们的男人，都是在炫耀：一是炫有老婆，二是炫有钱，三是炫又有老婆又有钱。

二十九、钱不是万能的，是九千九百九十九能，剩下的一能，是不能感受到贫穷的痛苦。

三十、扪心自问，如果你是别人，你愿意和自己搞对象么？想都不敢想，哪有这种福气！

一、生活就像淋浴，方向转错，水深火热。

二、单身至今的原因：熟人不好下手，生人不好开口。

三、目前的社交状况：生死之交遍布天南海北，同城找不到人约饭。

四、遇到喜欢的人就大胆去追，追不到怕什么，重在参与嘛。

五、不想洗衣服怎么办。取个媳妇就可以了，如果媳妇贤惠，就给你洗衣服了；如果媳妇彪悍，你就学会洗衣服了。

六、不当家不知柴米贵，不拍照不知自己肥。

七、一直坚信自己会瘦，现在只是胖着玩玩，可没想到玩着玩着就嗨了。

八、都说婚姻是爱情的坟墓，可是如果没有房子，你连坟墓都进不去。

九、现在银行卡我连密码都不想设置了，用六位数字去保护两位数的存款，想想都心累。

十、大多数人目前的状态就是，学不进去，玩不痛快，睡不踏实，浑身不对劲，吃的特别多。

十一、父母忽悠孩子叫教育；孩子忽悠父母叫欺骗；互相忽悠叫代沟。

十二、为什么要提醒我“钱不是万能的”？我才没那么贪心呢。我只想要钱而已，就没指望它万能。

十三、如果你觉得自己，整天累得跟狗一样。你真是误会大了，狗都没有你这么累。

十四、本想一口一口吃掉忧愁，没曾想却一口一口吃成肉球。

十五、你长得这么漂亮，首先要感谢你的爸妈，要不是他们给了你一双巧手，你能把自己P得这么美吗？

十六、我的人生目标是三十岁时，在北京拥有一套自己的房子。现在我的目标已经实现一半了：我已经三十岁了。

十七、世界上两件事最难：一是把自己的思想装进别人的脑袋，二是把别人的钱装进自己的口袋。前者成功了叫老师，后者成功了叫老板，两者都成功了叫老婆。

十八、冬天有三好：外面好冷，衣服好贵，我好穷。

十九、有的家庭，几根面条就能撑起热腾腾的日子；有的家庭，一堆金币反而把日子折腾得七颠八倒。

二十、为什么有的男生撩着撩着突然就不理你了，大面积撒网，选择性捕捞，你被放生了。

二十一、不努力的女生，会有买不完的地摊货，逛不完菜市场。努力的女生，你就没时间逛地摊，因为你只能加班叫外卖逛淘宝！

二十二、当生活中遇到倒霉的事情，千万不要沮丧，打起精神来，你要相信，更倒霉的还在后头。

二十三、别沮丧了。虽然你不曾拥有一场说走就走的旅行，但至少还有一个说胖就胖的体型。

二十四、生活不易，也不要借酒浇愁，难过了就早点睡觉，酒也得花钱，能省一瓶是一瓶。

二十五、女人一定要对自己好一点。一旦累死了，就会有别的女人花你的钱，住你的房，睡你的老公，打你的娃！

二十六、你要记住，无论最后我们疏远成什么样子，一个红包，就能回到当初。

二十七、人生没有彩排，每天都是直播；不仅收视率低，而且工资不高。

二十八、为啥到了婚龄就该结婚，到平均寿命就该死吗？

二十九、人干点好事儿总想让鬼神知道，干点坏事儿总以为鬼神不知道，我们让鬼神太为难了。

三十、能用钱解决的问题都不是问题，但，如何有钱才是你最大的问题。

1、和同事一块儿旅游，有个寺庙香火旺盛，不少人都去磕个头，捐点香火钱。

我：“李哥，咱们也烧点香吧！”

老李哼了一声，说：“哪有佛度人，只有佛度金。”

我去。。。这不止一针见血，简直就是扎血管上啊！

2、某副局长竞争局长，晚上连做三梦：第一梦见自己穿雨衣打伞，第二梦见墙头上骑自行车，第三梦见与小姨子背对背裸睡。

次日让老婆解梦。

老婆说：一、穿雨衣打伞你多此一举。二、墙头上骑车是走投无路。第三个梦那是你痴心妄想！看来你提拔够呛。

副局长听后当即病倒入院。

岳母闻讯来看望，知情后一拍大腿说：好梦啊！穿雨衣打伞那是双保险；墙头上骑车说明你技高一筹，能力强；梦见和小姨子背对着裸睡，我就知道你迟早会翻身的。。。

副局长大笑三声当场病愈出院。

3、独腿老大喝了一口酒对小弟说：“知道大哥这腿咋没的么？”

小弟摇摇头，大哥说：“东风吹，战鼓擂，想当初我怕过谁？走过南，闯过北，火车道我轧过腿。。。”

小弟：“大哥，您这腿是让火车轧的？”

大哥：“不，前两年这么吹牛时让人打的。”

4、今天坐高铁回家注意到身边一名男子，他穿得干净、得体，脸庞留下少许岁月痕迹。

他忧郁的眼神，时而静静望窗外，像是思考过往人生；时而双眼微闭，让疲倦的身体有片刻歇息。

根据个人多年行为模式研究、心理学观察及社会经验判断——――这人十有八九是手机没电了。

5、姐夫带着侄子，我带着儿子出去玩，路上，儿子和侄子因零食分配不均吵起来了。。。

侄子吼道：“你坐我家的车，吃我爸爸买的零食，现在还跟我吵架，你凭什么呀？！”

儿子：“就凭我妈是你爸小姨子。。。”

名句集锦

1、记着，诸神眼里的傻瓜和世人眼里的傻瓜是大不一样的。——奥斯卡·王尔德《自深深处》

2、活着是天下上最罕见的事，大多数人只是存在，仅此而已。——奥斯卡·王尔德

3、任何地方，只要你爱它，它就是你的天下。——奥斯卡·王尔德

4、生活模拟艺术，生活究竟上是镜子，而艺术却是现实的。——奥斯卡·王尔德

5、人生有两个悲剧，第一是想得到的得不到，第二是想得到的得到了。——奥斯卡·王尔德

6、我们一度犯过并十分厌恶的罪孽，我们又会舒畅地一犯再犯。——王尔德《道林格雷的画像》

7、只有两种人最具有吸引力，一种是无所不知的人，一种是一无所知的人。——奥斯卡·王尔德《道林格雷的画像》

8、真正的傻瓜，诸神用来取乐或讽刺的傻瓜，是那些没有自知之明的人。——奥斯卡·王尔德

9、实在，每一种乐趣和快感可能都含有幸灾乐祸的成分，险些没有例外。——奥斯卡·王尔德

10、仇恨，你还不知道呢，以心智论是永恒的否定，以感情论是萎缩退化的一种情势，它消灭一切，除了自己。——奥斯卡·王尔德

11、每个谣言的根据，都是一种不道德的确定。——王尔德《道林格雷的画像》

12、芳华是惟一值得拥有的东西。

13、切莫低头丧气，即使失去了一切，你还握有未来。——奥斯卡·王尔德

14、男人的爱情如果不埋头，那他和任何女人在一起都会感到幸福。——奥斯卡·王尔德

15、生活在阴沟里，依然有仰望星空的权利。——奥斯卡·王尔德

16、每个圣人都有不可告人的过去，每个罪人都有洁白无瑕的未来。——奥斯卡·王尔德

17、爱自己是终身浪漫的开始。——奥斯卡·王尔德

18、做你自己，因为别人都有人做了。——奥斯卡·王尔德

19、为了自己，我必须宽恕你。一个人，不能永世在胸中养着一条毒蛇；不能夜夜起家，在魂魄的园子里栽种妨害。——奥斯卡·王尔德

20、不敷真诚是伤害的，太真诚则绝对是致命的。——奥斯卡·王尔德

21、事物是否确实存在，取决于是否有人谈论。——王尔德《道林格雷的画像》

22、一个人总是可以善待他毫不在意的人。——奥斯卡·王尔德

23、永世宽恕你的敌人，没有什么能比这个更让他们恼怒的了。——奥斯卡·王尔德

24、你不知羞辱地索取，毫无感激地担当。——奥斯卡·王尔德

25、过自己想要的生活不是自私，要求别人按自己的意愿生活才是。——奥斯卡·王尔德

26、老年人相信一切，中年人猜疑一切，青年人什么都懂。——奥斯卡·王尔德

27、很多东西如果不是怕别人捡去，我们一定会抛弃。——奥斯卡·王尔德

28、我不想营生，我想生活。——奥斯卡·王尔德

29、反复无常和终生的爱之间的差别就在于前者更恒久些。

30、愚人创造了天下，智者不得不活在其中。——奥斯卡·王尔德

31、年轻的时间我以为钱就是一切，如今老了才知道，确实云云。——奥斯卡·王尔德

32、若诸神要惩罚我等，必先让我等如愿以偿。——奥斯卡·王尔德

33、浪漫的本质是不确定性。——奥斯卡·王尔德

34、恨是盲目的，爱亦然。——奥斯卡·王尔德

35、生活并不复杂，复杂的是我们人自己。生活是单纯的，单纯的才是精确的。——奥斯卡·王尔德

36、没有人富有到可以赎回自己的过去。——奥斯卡·王尔德

37、我不乐意袒露我的魂魄让那些好奇的凡夫俗子瞧个没完。——奥斯卡·王尔德

38、请把你的心给我，与我为伍，这个天下太残酷了，我有些害怕。——奥斯卡·王尔德

39、一个人不哭的那一天也就是他的心变硬的那一天，而不是他的心布满高兴的那一天。——奥斯卡·王尔德

40、优美的肉体是为了享乐，优美的魂魄是为了痛苦。——奥斯卡·王尔德

41、定义一样东西，就意味着限定了它。——奥斯卡·王尔德

42、我们谁也忍受不了和我们同样毛病的人。——奥斯卡·王尔德

43、要是一个人吸引我，他无论选择什么方式表达自己，对我来说都很可爱。——奥斯卡·王尔德

44、你知道的比你认为知道的多，但比你想知道的少。——王尔德《道林格雷的画像》

45、人真正的完善不在于他拥有什么，而在于他是什么。——奥斯卡·王尔德

46、公众惊人地宽容。他们可以原谅一切，除了天才。——奥斯卡·王尔德

47、自恋是一生浪漫的开始。——奥斯卡·王尔德

48、如今是这样一个时代，看得太多而没偶然间欣赏，写的太多而没偶然间思想。——奥斯卡·王尔德

49、魂魄是天主赏给人类最高贵的礼品。

50、人想恢复芳华，只消重演过去干的蠢事就够了。——奥斯卡·王尔德

51、哪怕是再平常的事，只要你把它隐藏起来，就显得饶故意见意义。——奥斯卡·王尔德

52、我爱他，是因为他像爱情本身应有的样子。——奥斯卡·王尔德

53、我交朋侪，都是因为他们长得好看；我结识人，都是因为他们有好的性格；我选敌人，都是因为他们有聪明。——王尔德《道林格雷的画像》

54、过去的事情唯一可爱之处就在于它已颠末去。——奥斯卡·王尔德

55、美是唯一不受时间伤害的东西。——奥斯卡·王尔德

56、生活中说真的是分不出大事小事的，凡事大小轻重都一样。

57、天堂和地狱都在我们每个人自己身上。——奥斯卡·王尔德

58、我们教给人们怎样影象，却从来不教他们怎样成长。——奥斯卡·王尔德

59、性格的根基在于意志力。——奥斯卡·王尔德

60、把人分成好和坏的是荒谬的。人要么是迷人，或者乏味。——奥斯卡·王尔德

61、男人结婚是因为疲劳，女人结婚是因为好奇，结果双方都大失所望。——奥斯卡·王尔德

62、现世的担子太重了，不是一个人担得起的，人世的烦恼也太大了，不是一颗心受得了的。

63、我宽恕了你的过去，固然我对我们的未来只字未提。——奥斯卡·王尔德

64、才貌出众的人多半在劫难逃。——奥斯卡·王尔德

65、我喜欢人胜于原则，而我喜欢没有原则的人更胜于这天下上的任何东西。——奥斯卡·王尔德

66、一旦你确实必要爱，你就会发现它正在等待着你。——奥斯卡·王尔德

67、不要低头丧气，即使失去一切，来日诰日仍在你的手里。——奥斯卡·王尔德

68、你一旦为自己找到一个错误的借口，你不久就会再为自己找到一百个借口。——奥斯卡·王尔德

69、每件赏心悦目的东西背后，总有一段悲哀的隐情，连最不起眼的小花要开放，天下也得经历阵痛。——奥斯卡·王尔德

70、在高兴和欢笑的反面，大概尚有粗暴、生硬和无感觉的东西，但在悲哀之后始终是只有悲哀。痛苦与高兴不同，它不戴面具。——奥斯卡·王尔德

71、如果我写不出美丽的书，至少我可以读到美丽的书，尚有什么能比这更使我快乐？——奥斯卡·王尔德

72、给我们赦免的，是忏悔而不是牧师。——奥斯卡·王尔德

73、一个人要做一件愚笨透顶的事，常常是出于最崇高的动机。——奥斯卡·王尔德

74、我们每每只欣赏天然，很少思量与天然共生存。——奥斯卡·王尔德

75、美丽的东西有了过失，要不分青红皂白的原谅他，丑陋的东西有了过失，要掉臂天地良心的鄙视他。——奥斯卡·王尔德

76、世上只有一件事比被人议论更糟糕了，那就是没有人议论你。——奥斯卡·王尔德

77、女人是用来爱的，而不是用来了解的。——奥斯卡·王尔德

78、老年人的悲剧，不在于他身体的朽迈，而在于他的心依然年轻。——奥斯卡·王尔德

79、一个不伤害的想法不值得被称为想法。——奥斯卡·王尔德

80、我们之所以把别人想得很好，是因为我们各人都替自己担心。乐观主义的基础纯粹是恐惊。——奥斯卡·王尔德

81、一个人爱情的时间总是以自欺欺人开始，而以诱骗别人告终。——奥斯卡·王尔德

82、恭维不会使女人飘然，却每每使男人丧志。——奥斯卡·王尔德

83、忠贞不贰的人只知道爱的小零小碎，而喜新厌旧者才懂得爱的大悲大痛。——奥斯卡·王尔德

84、神是奇怪的。他们不但借助我们的恶来惩罚我们，只使用我们内心的优美、善良、慈悲、关爱，来扑灭我们。——奥斯卡·王尔德

85、嘲笑一个处于痛苦中的魂魄是一件可骇的事，嘲笑者的生活是不美的。——奥斯卡·王尔德

86、说出真理是一件痛苦的事，但被迫说谎更痛苦。——奥斯卡·王尔德

87、不管是伟大的人还是渺小的人，除了用自己的手扑灭自己之外，没有什么别的东西能够扑灭他。——奥斯卡·王尔德

88、感情的长处在于会使我们迷失方向，而科学的长处就在于它是不动感情的。——奥斯卡·王尔德

89、美丽要比善良好，善良要比丢脸强。——奥斯卡·王尔德

90、对于忠告，你所能做的，就是把它奉送给别人，忠告从来就不是给自己准备的。——奥斯卡·王尔德

91、恶大莫过于浮浅。——奥斯卡·王尔德

92、失败会形成习惯。——奥斯卡·王尔德

93、男女之间不存在纯粹的交情，有的只是爱恨情仇。——奥斯卡·王尔德

94、别人信仰看不见的东西，我信仰人可以触摸、看到的东西。——奥斯卡·王尔德

95、往事常常可以抹掉，本事是悔恨、克制或忘记。——奥斯卡·王尔德

96、真实的爱是当她脱离后你还能爱上别人。——奥斯卡·王尔德

97、结婚是想象战胜了理智，再婚是盼望战胜了履历。——奥斯卡·王尔德

98、我们内心的恶魔，把这座都会变成了地狱。——奥斯卡·王尔德

99、坦率地说出自己的内心话不但是一种道德上的责任，而且还是一种令人快慰的事。——奥斯卡·王尔德

100、空想家只能在月光下找到自己的路，他的惩罚是第一个望见黎明。——奥斯卡·王尔德

101、一种想法是否有价值，同谈出这个想法的人是否出于至心毫无关系。——奥斯卡·王尔德

102、性格的基础是意志力，而我的意志力则完全受你的意志力的支配，这听起来好像很奇怪，但却是千真万确的。——奥斯卡·王尔德

103、每个人生下来都是王，而大多数人却在放逐中死去。——奥斯卡·王尔德

104、我敬佩简朴的快乐，那是复杂的最后遁迹所。——奥斯卡·王尔德

105、社会仅仅以一种精力概念而存在，真实天下仅仅是个体的。——奥斯卡·王尔德

106、女人代表着物质战胜了理智，正如男人代表着理智战胜了道德。——奥斯卡·王尔德

107、一个愤世嫉俗的人知道所有东西的价格，却不知道任何东西的价值。——奥斯卡·王尔德

108、真实生活是无序的，但想象却有某种严密的逻辑。正是想象使悔恨尾随着罪恶，也正是想象使每一罪恶生出奇形怪状的子女。——奥斯卡·王尔德

109、我可以抗拒一切，诱惑除外。——奥斯卡·王尔德

110、死去的东西每每死而不去。——奥斯卡·王尔德

111、有文化修养的人能在优美的事物中发现优美的寄义。这是因为这些优美的事物里蕴藏着盼望。——奥斯卡·王尔德

112、人生就是一件蠢事追着另一件蠢事而来，而爱情则是两个蠢东西追来追去。——奥斯卡·王尔德

113、我们思想着的是永恒，逐步通过的却是时间。——奥斯卡·王尔德

114、来自敌人的乐成可以忍，来自朋侪的乐成却不能忍。——奥斯卡·王尔德

115、履历是一个人给自己所犯的错误取的名字。——奥斯卡·王尔德

116、肉体的罪恶无足轻重，因为它们是该由医生治疗的病症，如果它们必要治疗的话；只有魂魄的罪恶是可耻的。——奥斯卡·王尔德

117、那种只知道价格，不知道价值的人，要之何用。

118、神是奇怪的，他们惩罚我们，不但因为我们的恶行和堕落变态，也因为我们的优美和蔼良。——奥斯卡·王尔德

119、成为自己生活的旁观者，可以避免生活中烦恼。——奥斯卡·王尔德

120、痛苦，不像痛快，是不带面具的。——奥斯卡·王尔德

121、我不要去天堂，那边的人我一个也不认识。——奥斯卡·王尔德

122、恨使人视而不见。——奥斯卡·王尔德

123、天主为每个孤独的人都准备了一个天下。——奥斯卡·王尔德

124、了解朋侪，是一件非常伤害的事。——奥斯卡·王尔德

125、每个伟人都有信徒，而传记总由叛徒来写。——奥斯卡·王尔德

126、与其去结交可靠的朋侪，倒不如使自己的朋侪可靠。——奥斯卡·王尔德

127、摆脱诱惑的唯一方法是屈服于它。

128、如果你想告诉人们真相，请让他们开怀大笑，否则他们会反攻你。

129、人应该通过自己的天性去了解万物，如果他们对此无所感知也不能明白，那么仅靠他人告知是徒劳无益的。

130、我唯一的缺点就是没有缺点。

1、结束友情的方式有许多种，但是要记住，最有效最彻底的却只有一种：借钱不还。绝对好使！

2、很多女生就连一个瓶盖都打不开，其实都是装的，你让她拆个快递试试，分分钟给你打开，什么工具都不用！

3、从小妈妈就跟我说不能交一些不三不四的朋友，我觉得我都有做到，而且做得非常好。因为我的朋友都很二。

4、说实话，机会就像秃子头上一根毛，你抓住就抓住了，抓不住就没了，没了你就“光头”了！

5、每次在我一个人很孤独的时候，我都会打开电脑放一部鬼片，没过一会就感觉身边全部都是人！

6、每天醒来的第一件事情，就是看看手机短信，看有没有给我转错一笔巨款，事后继续睡觉！

7、最近一直忙着减肥，我朋友便说我是吃饱了撑的。对此，我只想说：你说的没错，的确是吃饱撑的！

8、装满石头的瓶子还能灌进去水，但装满水的瓶子却不能再放一颗石头。这说明吃自助餐的时候不要先喝饮料。

9、小时候经常指着课本上丑的图片对同桌说：看，这是你。同桌就翻遍整本书寻找比这个更丑的图片说：看，这是你！

10、千万不能跟老婆吵架，一吵架你就会发现，吵着吵着她就哭了，然后你去哄她，这时候你就会认错！

11、考试是一个人的事，可是分数却是七大姑八大姨以及隔壁老王等一帮子闲杂人等的事。

12、人和人之间的距离，太近了会扎人，太远了会伤人。所以，请保持你死我活的距离。

13、许多人年纪轻轻就取得了基础的成就，这时候不要老是问人家爹是谁，你那是典型的为自己的无能找借口。

14、我们在困难时候最能依靠的人，也是得意时最容易忽视的人。比如父母，好心但是不优秀的朋友，还有备胎！

15、吹牛逼是一些人的天性，当对于一些话题自己乏善可陈时，就会搬弄外援：我有个朋友，拥有比你们更牛逼的经历！而我是他朋友，我也很牛！

16、闺蜜哭诉着自己被处了八年的对象劈腿，我不禁感叹男人没一个东西。整整八年的感情啊！竟然抵不过我的一次勾引……

17、社会精英阶层一边啃着心灵鸡腿和心灵鸡胸，一边为我们送上了心灵鸡汤，说人生的价值并不在于你挣了多少钱和外在是否美。

18、根据实践证明：当面说别人坏话，别人会非常愤怒，难堪。所以中伤别人一定要在背后。

19、有个百万富翁被告知得了绝症只剩下半年时间，伤心之余找了个杀手，让在自己最开心的时候杀掉他。几天后，百万富翁接到误诊的通知，正笑得开心，被杀手杀了。

20、时光飞逝，一天的时间马上就要过去了。怎么样，你的梦想是不是距离你又远了呢？

1、走投无路还走什么走，直接坐车啊。

2、脱了衣服我是禽兽，穿上衣服我是衣冠禽兽！

3、睡眠是一门艺术，谁也无法阻挡我追求艺术的脚步！

4、上帝说要有光，我说我反对，于是，世界上有了黑暗。

5、男人靠征服世界来征服女人！女人靠征服男人来征服世界！

6、自从我变成了狗屎，就再也没人踩到我头上。

7、男人膝下有黄金，我把整个腿都切下来了，连块铜也没找着！

8、读10年语文，不如聊一个月QQ。

9、如果朋友可以出卖，每个值五块的话，我也能发笔小财了。

10、师太，你就从了老衲吧！…很久很久以后…师太，你就饶了老衲吧！

11、小时候我以为自己长大后可以拯救整个世界，等长大后才发现整个世界都拯救不了我。

12、从猴子变成人需要成千上万年，从人变回猴子只用一瓶酒。

13、我们可以躲开大家，却躲不开一只苍蝇。生活中使我们不快乐的常是一些芝麻小事。

14、笨男人+笨女人=结婚；笨男人+聪明女人=离婚；聪明男人+笨女人=婚外情；聪明男人+聪明女人=浪漫爱情。

15、女人拥有无数个QQ号只为了调戏一个男人，男人常用一个QQ号上面加满各种各样的女人。

16、如果你问周围朋友词语，如果十个人，九个人说不知道，那么，这是一个机遇，如果十个人，九个人都知道了，就是一个行业。

17、与人交往的时候，多听少说。这就是，上帝为什么给我们一个嘴巴两个耳朵的原因。

18、姐不是广场上算卦的，唠不出那么多你爱听的嗑。

19、我要做个臭豆腐一样的男人，闻着臭吃着香，这叫内涵。

20、我也不知道人为什么而活，所以我至今还活着。

21、有人对你说，我家冲马桶都用矿泉水，你怎么回应？老子尿出来的都是皇家礼炮。

22、现在的天气，自来水可直接泡方便面。

23、小三算什么，他充其量也只不过是个人。

24、谢谢你，谢你大爷，谢你全家，谢你祖宗十八代。

25、心不跟爱一起走，说好就一宿。

26、新时代的女性，上的了厅堂，翻的了围墙，斗的了小三，打的了流氓，就是下不了厨房。

27、幸福就好，不要晒出来，因为晒多了，迟早有一天会晒干的，所以低调。

28、英雄不问出路，流氓不看岁数！

29、我悄悄的来，悄悄的走，挥一挥匕首，不留一个活口。

30、生活真他（和谐）妈好玩，因为生活老他（和谐）妈玩我。

31、世界上我只相信两个人，一个是我，另一个不是你。

32、不是我不想当淑女，是生活把老娘逼成了泼妇…

33、我特别困的时候，道德标准也没有醒，老师们要小心了。

34、总觉得，床吧，铺得太整齐，会有点安度晚年的意思。嗯，还是凌乱些，比较有朝气。

35、发呆这事儿，如果做的好就叫深沉。如果做的不好，那就很有可能睡着……

36、夜深人静的时候，我常常问自己，当初决定来地球，到底是对是错。

37、有钱的时候说，钱是挣出来的。没钱的时候说，钱是省出来的。

38、我知道你没把我当个数，其实我压跟没把你放在眼里过。

39、物价与欧洲接轨，房价与月球接轨，工资与非洲接轨。

40、喜欢我的人都是好人。不喜欢我的人都是坏人。讨厌我的都不是人。

41、下午去湖里游泳，突然下起暴雨，我赶紧潜进水里避雨。

42、夏天就是不好，穷的时候连西北风都没得喝。

43、先别鄙视我，给你个号码牌，先排队，到你的时候再鄙视。

44、我也曾青春逼人，可惜现在青春没了，就剩这么个逼人了。

45、我一直认为你很特别，只是没想到是这么特别的人渣。

46、只要你过得比我好，我就受不了。

47、只要瘦，什么都百搭，要是胖，什么都白搭。

48、我现在是思想很东坡肉，情感却很椒盐排骨。

49、我想做个温柔的人，只是温柔都被贬值了。

50、终于发现自己有了一个习惯，如果堕落也算是一种习惯的话。

51、众里寻她千百度，蓦然回首，那人依旧对我不屑一顾。

52、拽什么拽，再拽，就把你踹到南极去和企鹅跳华尔兹。

53、我喜欢白天，因为白天能作白日梦。

54、做自己想做的事，别的，就让猪乱说去吧。

55、昨晚我拿你的承诺去喂狗，第二天早上发现狗死了。

56、醉过方知己蠢，爱过才懂傻帽。

57、最近压力大，啃旺旺雪饼比别人啃烟还厉害…

58、总觉得，床吧，铺得太整齐，会有点安度晚年的意思。嗯，还是凌乱些，比较有朝气。

59、装逼只是瞬间，不要脸那才是永恒！

60、有一种态度叫有情犯贱，有一种状态叫没事找抽。

61、遇到你之前，我的世界是黑白的，遇见你之后，哇靠，全黑了。

62、原本想一口一口吃掉忧愁，不料却一口一口吃成胖子。

63、有人嫩得一掐就出水，我却怂得一掐就出鼻涕泡儿。

64、月老，你是不是把我的红绳玩断了？

65、在东北，有一种运动叫滚犊子。

66、曾经有个女的想改造我，结果她在最后只拆了我的零件，却再也没跟我装上…

67、这世界上妖怪越来越多了，唐僧越来越少了。

68、直到遇见了你，我才知道恐龙其实是可以再次出现的。

69、有困难要上，没困难创造困难也要上。

70、有没有暗恋我的人呢？暗恋我的你们别害羞呀，爱要大声说出来。

71、现在的社会，插队都得排队。

72、我真想掐死现在懦弱心软的自己！

73、先学会不生气，再学会气死人。

74、现在的孩纸真没礼貌，上课时老是不跟我讲话。

75、现在的花心，是因为当初的比任何人都用心。

76、现在的女人：后看，风调雨顺。前看，颗粒无收。

77、我要像仙人掌一样坚强，还要学会扎坏人。

78、只想优美转身，不料华丽撞墙。

79、以你的理解能力，我解释了你也不见得懂，所以，你继续渺茫吧。

80、对不起，我无法把你忘记，也许你伤我很深，也许我爱你甚至爱我自己…记住，我爱你。

81、感谢所有陪我走到现在的人尤其感谢打算仍然硬着头皮陪我走下去的人。

82、你看，这么多人，这么大的世界，我遇到了你，你也遇到了我，多好。

83、用扯淡的态度，面对操蛋的人生。

84、所谓的好学生只不过是做坏事没有被老师发现而已。

85、遇见喜欢的，就得主动犯个贱。

86、理发师永远听不懂剪短一点点的概念。

87、要不是打不过你，早就跟你翻脸了。

88、胖子的心声：嘴里很享受，心里很想瘦。

89、我爱你是真心话也是大冒险。

90、对女人不好的男人，下辈子都投胎做卫生巾去！

91、整夜整夜的干坐在电脑前面以某种等待的姿态发呆。

92、没有人陪你走一辈子，所以你要适应孤独；没有人会帮你一辈子，所以你要一直奋斗。

93、告诉你们一个鬼故事，马上就要开学了，苦逼的作业快涌过来了。

94、你会慢慢发现那些说过陪你到老的一个个朋友都是一只只的狗。

95、有时候不知道自己到底在硬撑什么但我知道我一直在为难自己。

96、无聊的最高境界，开着电脑，按着手机，望着电视。

97、更多的时候我们身边没有西瓜没有啤酒也没有爱的人。

98、我一直以为，我没有对不住任何人，但现在我知道，我最对不住的，就是我自己。

99、哥混到现在，拿得起，放得下的只有筷子。

100、据说，你流出来的眼泪，是你脑子里进的水。

1.你情敌和曾经背叛你的人同时掉入河中，并且他们不会游泳，你是选择蹦迪还是去KTV？

2.我在马路边，看到一分钱，刚要弯腰捡，原来是口痰，我靠…谁吐这么圆。

3.这个世界上没有谁离不开谁，就算是一条鱼，离开了水，也能烤着吃。

4.自己挖坑自己跳，爬不出来自己笑，人生就是偶尔的精明和大多数时候的脑残。

5.瞧你这长相，不用化妆就能去演恐怖片了。

6.别说你一无所长，熬夜玩手机你是一把好手。

7.说起我男朋友的优点，总结起来就是五个字：会挑女朋友。

8.我一在强调做人要低调，可你们非要给我掌声和尖叫。

9.一定要记住那些陪你聊到深夜的人，就是因为他们，才让你熬夜导致黑眼圈那么重，皮肤这么差的。

10.谈恋爱应该处处让着男朋友，让他做饭，让他洗碗，让他洗衣，让他赚钱，女生呢就辛苦一点，负责吃，负责喝，负责买买买。

11.怎么形容自己的厨艺，烧得一手好厨房，说起来你可能还不信，是锅先动的手。

12.对今天解决不了的事情，也不要着急。因为明天也可能还是解决不了。

13.同学帮我补习了三个月，终于，他的成绩也降下来了。

14.只要瘦，什么都百搭，要是胖，什么都白搭。

15.我的悲伤不给你看，我怕你忍不住笑场。

16.言语上的老司机，行为上的大怂逼。别看有些人天天开着小黄车，其实连女生的手都没拉过，比如我。

17.中华文化，博大精深，了解一下。

18.有没有懂跑车的朋友，求推荐一款万到万的跑车，要求性能好，起步快，马力大，舒适性高的，外观时尚又好看的，我拿来当手机壁纸。

19.有时候觉得自己变丑了，拿出身份证来一看发现自己多虑了。

20.今天朋友发信息说想跟我借点钱，我给他回：十万以下千万别跟我开口，十万以上我也没有。

21.年轻的时候，我们常常冲着镜子做鬼脸；年老的时候，镜子算是扯平了。

22.我又不是人民币，怎样能让人人都钟爱我？

23.每天都在上演的三件事，晚上睡不着，早上起不来，后悔睡的太晚。

24.路见不平一声吼，吼完继续往前走。

25.做一个成熟的大人，秋衣塞进秋裤里，秋裤塞进袜子里。

26.你说我打游戏菜有什么意义呢？我又不会把游戏删了，我只会把你删了。

27.那年我背井离乡，导致一村人都没有水喝。

28.长得好看点的人人生可能是传记，可能是小说，可能是散文。而你，只能是个段子。

29.你走了真好，不然总担心，你要留下来吃饭。

30.我观察你很久了，终究还是觉得地球不适合你。我这有张去火星的票，给你吧！

31.实在无聊，买个地球仪吧。世界那么大，你不但可以看看，还可以转转。

32.为了想清楚我昨天为什么失眠，今天我又失眠了。

33.四川人为了挽留对方，说过哪些卑微的话？

34.周一到周五是出卖自己灵魂的日子，周六和周日是赎回自己灵魂的日子。

35.我发现一个问题，我喜欢和长得好看的人讲话，怪不得我老是自言自语。

36.当裤子失去皮带，才懂得什么叫做依赖。

37.我用一麻袋的钱上大学，换了一麻袋书；毕业了，用这些书换钱，却买不起一个麻袋

38.人生有时就像电脑，说死机就死机，没得商量。

39.爱情如电池一样，总有没电的时候。

40.不能自拔的，除了爱情，还有别人地里的萝卜。

41.有些事情无须争辩，表面服从，偷偷反抗。

42.我们都太爱自己了，两个太爱自己的人，是没法长相厮守的。

43.谎言，经过包装，有了一个更好听的名字：誓言。

44.人不快乐，是因为人虽可像猪一样懒惰，却无法像猪那样懒得心安理得。

45.生活中没有参照物的人，可怜；选错参照物的人，可悲。

46.婚姻是爱情的坟墓——如果没有房子，你连坟墓都进不去。

47.你我之间本无缘分，全靠我颜值死撑。

48.每个人出生的时候都是原创，可悲的是，很多人渐渐都成了盗版！

49.在这世上惟一比别人议论更糟的一件事，那就是无人议论你。

50.爸妈还真以为我懒，不想出去，要是有钱的话，你连我的人都见不着。

51.有人告诉我，这世上再也没有比爱情更复杂的东西了，我一本数学书甩他脸上。

52.白天是搞笑废物，晚上是抑郁怪物。

53.暗恋是什么，暗恋就是没有配高射炮的雷达，最后默默地就锁定了敌机。

54.我的悲伤怎么能给你看呢，我是怕你忍不住笑翻了场。

55.为什么上流社会的人，都那么喜欢做点卑鄙下流的事呢。

56.你可能不知道为什么节目中间要插播段广告把，那是因为主持人和嘉宾要上厕所。

57.你爱我吗，爱我就给我穿上洁白的婚纱，然后再用你那疯狂的手扒光。

58.人品就那么一点点，记着省着点儿花，挥霍是很可耻的。

59.你知道吗？做爱做的就是那点事，交配交的就是个人。超经典搞笑句子能笑死人的

60.请不要用那种小狗般无辜的眼神盯着我好吗，会让我特别想吃狗肉。

61.憎恨别人就像为了逮住一只耗子，而不惜烧毁你自己的房子，但耗子不一定能逮到。

62.多想想自己的错，就会慢慢忘记别人的过。

63.所有的人都站在一边并不一定是好事，譬如他们都站在船的一边。

64.年轻的时候，我们常常冲着镜子做鬼脸；年老的时候，镜子算是扯平了。

65.这个世界就这么不完美，你想得到些什么，就不得不失去些什么。

66.不喜欢你的人就是不喜欢，别试图拿着树枝去钓鱼，鱼都当你傻逼。

67.请你用慈悲心和温和的态度，把你的不满与委屈说出来，别人就容易接受。

68.你可以像猪一样生活，但不可能像猪那样心安理得。

69.所有的人都是平凡的，有些人因知道这一点而真正成了平凡的人。

70.难过一会儿就行了，时间如此宝贵，哪能都浪费在难过上。

71.你不要一直不满人家，你应该一直检讨自己才对。问问自己，当初怎么会瞎了眼认识这个人的。

72.越长大越发觉，情绪稳定是种难得的品质。

73.在你说对不起的时候，那句话很神。比如在你犯错的时候，你说对不起，所有事情都会好了，但是你一直不说对不起，事情就会变得越来越大。

74.太斤斤计较的人，不适合恋爱，适合买菜。

75.人都有蹬鼻子上脸的天性，神都是供出来的，混蛋都是惯出来的。

76.喝醉，从来就不是酒精的罪过，而是感情的度数太高。

77.聪明人说话，是因为有话要说。愚蠢的人说话，是因为得说这话。

78.你并不内向，只是不想搭理那些不重要的人。

79.人生路上一定要胆大心细脸皮厚。如果你为了人家的一句话就大发脾气，或者是飘飘若仙，你的心其实是在跟着别人的话走。把自己的快乐托付在别人随便的一句话上面，是很愚蠢的一回事。

80.穿的一个比一个危险，长得一个比一个安全。

81.如果你容不下我，不是你的心胸太狭小，就是我的人格太伟大。

82.铁杵能磨成针，但木杵只能磨成牙签，材料不对，再努力也没用。

83.听说女人如衣服，兄弟如手足。回想起来，我竟然七手八脚的裸奔了年!

84.我不是随便的人，我随便起来不是人。

85.我的未来不是梦，我的未来是噩梦。

86.结婚当然是件好事，上瘾就麻烦了。

87.不要说别人脑子有病，脑子有病的前提是必须有个脑子。

88.不蒸馒头争口气行吗?

89.不要乐观的像个屁一样，自以为能惊天动地。

90.步步高打火机，哪里不会点哪里。

91.男人不能惯，越惯越混蛋。女人就得宠，越宠越有种，还是别人的。

92.我认为我颓废，原来我报废了!

93.我心眼儿有些小，但是不缺，我脾气很好，但不是没有!

94.我也曾有过一双翅膀，不过我没用它在天上翱翔，而是放在锅里炖汤。

95.夏天就是不好，穷的时候我连西北风都没得喝。

96.现在再找白马王子，你out了，现在都找宝马王子。

97.即使有人骂我神经病，我也会坚强的抬起头蔑视的对他说“你难道和我一个医院的?

98.戒烟容易，戒你太难!

99.考试时，本想要咸鱼翻锅的，他奶奶的，没想到粘锅了。

100.没有人在世界上能够“弃”你，除非你自己自暴自弃。因为我们是属于自己的，并不属于他人。

101.从前有人在我空间里跑堂，不到两秒钟，嘎的一下就死了。

102.大部分人一辈子只做三件事：自欺、欺人被人欺。

103.你的年龄有多大，我不关心。我想知道，为了爱，为了梦，为了生机勃勃的奇遇，你是否愿意像傻瓜一样冒险?

104.顾客不是上帝，顾客只是上当。

105.人间正道是沧桑，活的不要太嚣张。

106.如果你年轻却不激进，那么你就是个没心的人，如果你老了却不保守，那么你就是个没脑的人。

107.如今这社会，女的照相照胸，男的照相照车谁知道胸是不是挤的，车是不是你的。

108.你肺活量是多少啊，能把牛B吹的这么大。

109.一时的冲动，子孙的危机!

110.用一颗滚烫的心，可以换一个结果。用钞票却可以随意改变这个结果。

111.有钱就败家，没钱就拜神。

112.有一个很古老的传说，说是在北邮校园内能看到美女的人会长生不老。

113.春色满园关不住，我诱红杏出墙来。

114.到处都有痛苦，而比痛苦更为持久且尖利伤人的是，到处都有抱有期望的等待。

115.和你擦肩而过你却不知道是我，因为我把头扭过去了。

116.穿别人的鞋，走自己的路，让他们打的找去吧。

117.多多关注三峡在线，便可分享更多经典盘点。

118.路见不平一声吼，吼完继续往前走。

119.你那么喜欢劈腿，怎么不去跳芭蕾舞。

120.女人先表现自己大方，男人就不敢小气。

121.卧梅又闻花，卧枝伤恨低。邀闻卧石碎，卧湿达春绿。

122.人生不能像做菜、把所有的料都准备好才下锅。

123.本无意与众不同，怎奈何品味出众。

124.闭上眼睛，我看到了我的前途。

125.不怕虎一样的敌人，就怕猪一样的队友!

126.出生时你哭着，所有都笑着，离去时你笑着，所有都哭着。

127.人生的悲哀就在于，当你想两肋插刀的时候，却只有一把刀。

128.您复杂的五官，掩饰不了您朴素的智商。

129.每次跟别人吵架后，总感觉没发挥好，还想再吵一次。

130.这世界上最美好的事情，莫过于吃肉。从来不会背叛，从来不会欺骗，吃一斤，长一斤，永远真诚相待。

131.你别有事没事儿的老梦见我干嘛，你不知道我很忙吗？

132.请你不要老觉得整个世界抛弃了你一样，因为世界根本就没空搭理你。

133.骂骂你就算了，为什么非要等我打你呢，难道这样你才能知道我文武双全吗。

134.你知道吗？不能自拔的不是只有爱情，还有别人地里的萝卜。

135.就算吃醋也要装的跟喝了酱油似的，不能让别人瞧不起！

136.脱了衣服你是禽兽，穿上衣服你是衣冠禽兽！

137.在女孩子花一样的年纪里，你长成了一棵多肉植物。

138.突然发现，我对自己未来的所有计划都有同一个开头：等我有了钱。

139.我很懒，没什么特长，但熬夜是一把好手。

140.在这个世界上，总有很多事情无法解释。比如有的人吃饭长智商，有的人吃饭长脂肪。

141.每当生活击倒了我，我不会马上振作起来，我通常就躺在那儿顺便打个小盹儿。

142.我叫小可爱，长大了叫大可爱，老了叫老可爱，以后死了叫可爱死了。

143.最好的默契就是：你懂我的故作矜持，我懂你的图谋不轨。

144.我最害怕的是你们混得比我好，那样我会不安，可是我更担心你们过得不好。

145.老师，小刚明天要请假，因为他明天可能要病了。

146.不到长城非好汉，到了长城吧，好汉不吃眼前亏。

147.好学生考完试：“考完了——坏学生考完试：”靠。完了!。

148.以关心老婆为荣，以忽视老婆为耻;以伺候老婆为荣，以麻烦老婆为耻;以赞美老婆为荣，以批评老婆为耻;以顺从老婆为荣，以顶撞老婆为耻;以下班回家为荣，以夜不归宿为耻;以诚实专一为荣，以沾花惹草为耻;以上缴工资为荣，以窝藏奖金为耻。

149.虽然你哭的时候一样很漂亮。不要生气了，但据科学论证生气和哭泣会让人老得很快，会变得不漂亮。虽然你老成怎么样,怎么不漂亮，我都会同样的爱你。可你自己喜欢漂亮的啊，所以以后不能哭了。

150.结婚前，你喝可乐我喝牛奶，我吃萝卜你吃白菜，你喜进商场，我乐意逛街;结婚后，我喝可乐我吃白菜，每天陪你到商场逛几圈;为你而改变，你爱我就爱!

◆女之间会有纯友谊吗?

神回复：有，越丑越纯。

◆同学问我，锄禾日了几个人。我答：一个啊，就是当午。

神回复：不对，是三个，因为锄禾日当午，汗滴和下土。

◆你看我的头像牛逼吗?

神回复：像。

◆昨天第一次和女友去开房，就遇到了警察查房，还有比这更悲剧的吗?

神回复：有，警察当着你面问你女朋友，为什么每次都是你。。。

◆前几天感觉胸口很闷，就去看了医生。医生看着我的X光片，皱着眉头对我说：“你以后要少抽点烟了。”

神回复：虽然很不情愿，但是我还是听从了医生的建议。回来之后我就买了几包烟，开始学习抽烟了。

◆平安夜你给女友花了多少钱?有种进来晒晒!勿装逼，实事求是!我自己花了两千五!给她买了一件scat的外套一千八!一瓶Dior香水五百多，外加吃东西买花买烟火买小礼品，总共两千五百大洋!你们呢?

神回复：没赶上平安夜~~她是后半夜来找我的。她穿着一件scat的外套一千八!喷的Dior香水大概五百多，还带了好多小礼品…我还是比较高兴的~于是掏了198房费..

◆男生嫌弃女孩子不够他们女神标准的时候，请先确保你的长相赢过看妹子们手机里的至少一位男神。

神回复：女生嫌弃男孩子不够她们男神标准的时候，请先确保你的功夫赢过男孩子们硬盘里至少一位女神。

◆我追求一个漂亮女生，要不要告诉她我老爹有三处房子一套别墅，存折里有几千万?

神回复：说了，她就成了你后妈。。。

◆中午在淘宝看了会儿棺材，几乎都包邮，呵呵心情忽然变得好好。

神回复：已经入土五天了，感觉里面很干爽。今天头七借别人附体成功，补个好评。“好卖家!有空下来玩哦。”

◆想开家超市，可周围都是连锁的，给超市起个什么名字能瞬间打败他...

神回复：超市入口

◆有种姑娘没有大小姐脾气，你说干嘛就干嘛，支持你去做你想做的事，关心你的生活，自信独立，不会因屁大点的事儿就去折腾你，不会因为你签了一笔大单子，就拉你去商场消费一圈。这就是男人喜欢她的原因。

神回复：这个人就是娘啊，这个人就是妈。

◆买一双新鞋，左脚磨出了泡。脱了鞋一看，一只是7号，一只是8号。让售货员坑了。

神回复：哈哈，别怪售货员，一只是建筑面积，一只是实测面积。

◆长这么大见过两次我妈啪啪啪，一次是小时候跟我妈睡的时候半夜醒过来，一次是高中的时候下午翘课回家，重点是，对方都不是我爸。

神回复：未必不是你爸啊

◆地震当天所有学生都慌忙从宿捨楼逃出来，只见一群群男生到处在找他们的女盆友。可奇怪的是，没有一个人找到，好像他们女盆友都消失了。

神回复：你TM的不知道她们还没化妆么。。

◆一位台湾朋友说：“汉字简化后，親不见，愛无心，產不生，厰空空，麵无麦，運无车，導无道，兒无首，飛单翼，湧无力，有雲无雨，開関无门，鄉里无郎，聖不能听也不能说，買成钩刀下有人头，輪成人下有匕首，進不是越来越佳而往井里走，可魔仍是魔，匪仍是匪。”

神回复：汉字简化后，黨内无黑，團中有才，國含宝玉，愛因友存，美还是美，善还是善，虽醜无鬼，只不过臺无吉，灣无言

◆你是不是从来都没有爱过我?哪有啊，我一直就很爱你啊!

神回复：那你不直的时候呢?

◆1.我听见一阵急促的敲门声。2.我醒了过来。3.我打开了门，看见你站在门外。4.你说想我了，然后给了我一个结实的大拥抱。——其实正确顺序是1，3，4，2

神回复：如果是2413呢?细思极恐。

◆如果市长被绑架了，要求拿1000万去赎，要不然就用汽油烧死他，你会捐多少?

神回复：10升汽油

◆一个苹果如何切两刀平均分给三个小朋友吃?

神回复：先让一个小朋友吃苹果，然后杀了它取出苹果。然后让第二个吃，在杀了取出苹果给第三个吃...这样就好了3人2刀吃苹果~~

◆CCTV说，150万只角马，35万只瞪羚，20万只斑马在非洲旱季开始迁徙，这是世界上最大规模的哺乳动物的迁徙……

神回复：这算什么，难道你没见过春运么……

◆我姐怀孕，她老公要她打掉，理由是嫌弃蛇宝宝。。。。有听过更奇葩的打胎理由吗?

神回复：把他身上长得最像蛇的部分一起打掉吧!

◆为什么每次中国领导人访问日本，日本方面都比较冷淡，甚至机场连欢迎标语都没挂?

神回复：你说怎么挂?热烈欢迎中国老朋友来““日”?

◆五一到了，你还是一个人么?

神回复：妈逼难道我会变成一条狗么!!!

◆劝劝这些年少轻狂的少年们吧。

神回复：骚年们，还是少看点av多出去找找妹子吧，千万别像我：别人的孩子都会买手纸了，我的孩子还在手纸上。别人的老婆都会生气了，我的老婆还要打气!!!

◆一个M爱上了另一个M,然后怎么办?

神回复：变成八条......

◆你怎么能要求一个人连你的样子都没见过就爱上你呢?

神回复：你怎么能要求一个人见过了你的样子之后还爱上你呢?

◆用一句话证明你看过四大名著。

神回复：军师救我，妹妹救我，哥哥救我，悟空救我。

神回复吐槽帝，你把我的三观还给我……

◆据说大地震前有三个明显征兆：1.井水异常;2.牲畜反应异常;3.专家出来辟谣。

神回复：第二条和第三条重复了......

◆中国有没有原创的娱乐节目啊?

神回复：有啊，新闻联播......

01.一男子网上写道：“最近公司效益不错，每天都加班到很晚，每次一开门就看见老婆气鼓鼓的躺在床上不理我，大家说我该怎么办？”

神回复：“把气放了不就好了吗？”

02.为什么大家都说夫妻之间没有隔夜仇，床头吵架床尾和呢？

神回复：一B勾销。

03，甲：你滚滚！

乙：我不是烟，浓烟才滚滚。

04，甲：提倡一家子合葬。

乙：活着窝居，死了还窝居。

05，甲：听说以后男人讨不到老婆。

乙：没关系，我更容易守住贞操。

06，甲：爱上网人的人大部分是穷人。

乙：真不信互联网能网到一条大鱼。

07，甲：我老婆老是怀不上二孩。

乙：咳，那是因为我没有住你家隔壁。

08，甲：如今骗子到处横行。

乙：那是骗子发现了巨大的傻子市场。

09，甲：女人最喜欢男人什么？

乙：喜欢男人硬来。

10，甲：你知道我很有乡土情结吗？

乙：知道你爱吃土鸡土鸭土猪。

11.某人写道，今晚成功约炮两个女人，一位是还没有交往过男朋友但是长的有点磕碜的女孩，另一位则是长的还行但是是有点风骚的已婚妇女，你们说我该到谁那里去呢？纠结！

神回复：有什么好纠结的，凤姐和潘金莲你选谁！

12、有个解小便经常会湿着自己鞋子的美女，有一天，她刚解完小便就对路边停放的一辆轿车踢了几脚，请问这是什么牌子的车？

神回复：BYD。

13、在电视上看到什么最开心？

神回复：自己发布的广告。

14、什么谷不能吃，还可以在上面溜达？

神回复：河谷和山谷。

15、什么谷不能吃，但人人想拥有它？

神回复：硅谷。

16、羊最怕去哪个国家？

神回复：匈（凶）牙利。

17、大白为什么最怕吃奶糖？

神回复：因为大白兔（吐）奶糖。

18、什么电照得最远，还是免费的？

神回复：闪电。

19、怕什么来什么的东西是什么？

神回复：就是“什么”这个东西。

20、和尚最希望你放生，但是不希望你放什么？

神回复：放屁。

21、不会生育的美女叫什么？

神回复：绝代佳人。

22、不幸毁容的美女叫什么？

神回复：绝色美女。

23、绝不碰美女的帅哥叫什么？

神回复：绝色美男。

24、什么人最爱翻别人的鼻孔？

神回复：鼻喉科医生。

25、两个哑巴的爱情故事标题叫什么？

神回复：爱你在心口难开。

26、什么车怎么打都打不烂？

神回复：出租车。

27、提心吊胆的安全活儿是什么？

神回复：卖猪心猪肝。

28、有些护士最希望别人动手动脚，请问这是哪种护士？

神回复：服侍脑瘫病人的护士。

29、有一只苍蝇有日行万里的本领，有人却没把它当成宝贝，而是一拍子打死了它，请问这是怎么回事？

神回复：因为它遇到了飞机清洁工。

30、人可以吹牛，牛可以吹什么？

神回复：吹牛鼻涕。
</code></pre><p>[XCAR 成都 资讯]</p><p>相信大家都很喜欢看爱情公寓吧！喜欢爱情公寓里人人妙语连珠、插科打诨的画面吧。以下是出国留学网小编为您整理的“爱情公寓语录”，希望您喜欢!更多爆笑语录请关注出国留学网实用资料栏目!</p><p>【爱情公寓语录】</p><p>1、关谷：饿着，那你就多吃点啊。悠悠：他说的是恶兆。恶是凶恶的恶，兆是凶。——《爱情公寓4》</p><p>2、我曾经尝试用面条上个吊，用降落伞跳过楼，用豆腐撞过头，用薯片割过脉!——《爱情公寓4》</p><p>3、小贤：学士硕士全灭，男博士仅能自保，要打赢女博士，哼哼，只有靠圣斗士了。——《爱情公寓2》</p><p>4、张伟：形势比预计的还要糟糕，做贼心虚曾经是中华民族的传统美德，现在也消失了。——《爱情公寓2》</p><p>5、子乔：我跟她说我离开她是因为我是那威星人，我说我的星球需要重建，所以我就走了。——《爱情公寓2》</p><p>6、小贤：你小心，我放心。你贪心，我担心。你有心，我开心。你花心，我恶心。你负心，我伤心。一声祝福一片心，你的月亮我的心，新春祝福是真心。——《爱情公寓2》</p><p>7、一菲：我要是见不着那个男人我就让你消失!生物学和社会学双重意义上的消失!——《爱情公寓1》</p><p>8、宛瑜：狗饼干含有丰富的护发素和去屑配方，吃了以后头发去无踪，头屑更出众!——《爱情公寓1》</p><p>9、展博：姐，你不是说早起的鸟儿有虫吃吗?</p><p>一菲：我发现我错了，是早起的虫子被鸟吃。——《爱情公寓1》</p><p>10、子乔：曾小贤，你是一个男人，能让你兴奋的应该是魔鬼的身材而不是魔鬼的后妈!——《爱情公寓2》</p><p>11、一菲：现在演戏的都唱歌去了，唱不了歌的都写书去了，写不了书的都演戏去了，演戏也不行就又唱歌去了。演艺圈是个圈嘛!——《爱情公寓2》</p><p>12、一菲：有道理，让我算算有多少人听你的节目。一，二，三，四……60亿乘以0是多少来着?——《爱情公寓2》</p><p>13、诺澜：小贤他只是轻微的面部发抖，手脚出汗，毛孔张开，并且他的椅子有点不太适合他，你长痱子了吗?——《爱情公寓3》</p><p>14、关谷：我知道你知道别人不知道你知道，可是我以前看过你的演出，所以你应该知道我知道你知道啊。——《爱情公寓2》</p><p>15、一菲：我觉得这事儿完全不靠谱儿，中国男足世界杯夺冠和你的离谱程度其实差不多。——《爱情公寓1》</p><p>16、那你给我解释一下，为何在你的鞋子里会有一块砖头，而且这块砖头还会发光?——《爱情公寓4》</p><p>17、小贤：有道是，晚会无真唱，采访无实话，电台无美女，这是传媒界不变的三大定律!——《爱情公寓3》</p><p>18、关谷：活到老，学到老，原来这就是服部半藏流传下来的东西，那他一定死不瞑目了。——《爱情公寓3》</p><p>19、羽墨：根本就没有什么UPUP丰胸操，都是我编出来的。如果你们真的有需要，垫硅胶才是王道。——《爱情公寓2》</p><p>20、展博：佘山只是一个丘陵，海拔还不到一百米，没有雪，没有瀑布，没有薰衣草，更没有高高的，骨灰。——《爱情公寓3》</p><p>【爱情公寓经典名言】</p><p>展博：静若处子动若疯兔。</p><p>小贤：他们两个人只有一墙之隔，就从未见过面。因为他们一个总是向左走，一个总是坐电梯。</p><p>婉瑜：你好，我要一个强暴鸡米花</p><p>子乔：事成之后我俩五五分成</p><p>美嘉：先说好，谁是五</p><p>我要藏宝图，你给我张地图，啊?这还是张世界地图?”——陆展博</p><p>“吃烧饼吃出啤酒盖儿，吃馄饨吃出樟脑丸，打苍蝇手拍在钉子上，去青松观烧香，手机掉到功德箱里拿不出来了。”——热心听众</p><p>“一辆宝马车速280码向你处开来，后面跟着一辆奔驰在飙车，慢着，后面还跟着一辆拖拉机更牛，还打着左变道灯，他想超车!”——交通警察</p><p>“人家是陈圆圆，你?(瞄胸)陈扁扁!”——吕子乔</p><p>公交车师傅(对跟踪宛瑜的保镖)：“哎，要么投币要么刷卡要么下车，选一样。”</p><p>两位保镖对视，然后下车。</p><p>公交车师傅：“真是~连公交都坐不起，还敢冒充黑客帝国。”</p><p>宛瑜：“师傅，我们现在离市中心远吗?”</p><p>公交车师傅：“刚才不远，现在挺远的。”</p><p>“您好，我要一份肯德基。”</p><p>服务员：我们这里有很多种，请问您要哪种?</p><p>“我要点一份肯德基!”</p><p>：“对!没错!红色的地毯是80米，怎么搞的，竟然少了我5米，这老板也太缺德了吧?猪肉涨价地毯也来给我缺斤少两?他们的地毯不是猪皮做的吧?”</p><p>曾小贤：“听众朋友们，好男人就是我，我就是好男人，我就是——曾小贤。”</p><p>美嘉：我一口盐汽水喷死你!!!</p><p>胡一菲：“我和展博以前是连体婴儿，两岁前我们俩脑子还长在一块呢。”</p><p>曾小贤：“对，然后医生刀一快，把脑子全给了展博。”</p><p>宛瑜(唱歌)：“啦啦啦啦啦啦”</p><p>拖拉车大叔：“闺女，你这歌是跟我学的吧?”</p><p>宛瑜：“啊?大叔，你也会?”</p><p>拖拉车大叔：“我们家的鸡就是这样，鸡爪的动作和你一样，一提一放，一提一放……还有挤奶的动作，这样这样，我也不知道从哪时起，好多小青年就开始学我”</p><p>宛瑜：“大叔，你真逗，那你是Hip-hop的创始人咯”</p><p>拖拉车大叔：“啥?撞死人(创始人)?我开拖拉机慢得很，从来没撞过人”</p><p>曾小贤：“我们收到一封特别的来信，是来自与这对新婚的特别月老，也就是我们这对公寓的创始人。”</p><p>展博(极度郁闷)：“怎么又撞死人(创始人)?”</p><p>新郎新娘进场)</p><p>陈美嘉(HC住)：“好帅哦~!~!~”</p><p>屡子乔：“这就是传说中的王铁柱和甜二妞吗?”</p><p>陈美嘉：“请问你是街道办事处下属公寓住户委员会妇女主席，吗?”</p><p>曾小贤(愤怒地)：“副主席!”</p><p>陈美嘉：“啊!副主席~~他现在已经不是神父了，请问我们可以...</p><p>我的优点是我很帅，但我的缺点是我帅的不明显。</p><p>准律师也是律师，臭鸡蛋就不是鸡蛋了?</p><p>机会像雨点般向我打来，可我都一一闪过了。</p><p>我现在不止淡定，而且蛋疼……</p><p>尔康!你敢跟朕抢女人，朕砍了你!(重点在“尔康”)</p><p>一菲你真厉害，徒手毙老鼠，真是比李连杰还甄子丹!</p><p>其实我是天才，只可惜天妒英才。</p><p>我真不是什么名流，我就是个人流。</p><p>现在生米煮成稀饭了，你满意了?</p><p>那种笑容，甜蜜优雅，仿佛春风拂过泸沽湖，秋雨浸润九寨沟。</p><p>拿破仑说过，不想吃天鹅的癞蛤蟆，不是好癞蛤蟆，当然我不是说我是癞蛤蟆，我是说，即使我是癞蛤蟆，我也不会娶母癞蛤蟆。</p><p>可以，当然可以，我也挺喜欢她的……不过我喜欢过的女星一般都没有好下场，我以前喜欢饭岛爱，后来她死了，我还喜欢过酒井法子，后来她就去吸毒了。……你说长泽雅美会去吸毒吗?</p><p>造化弄人呐，上厕所我右眼皮一直在跳，结果抽完马桶就看到你了</p><p>我是三届法学夏令营的柔道殿军蝉联者。而且最后一届差一点点就拿到季军了。</p><p>一菲，我拿什么跟你赌，不是看你要什么，而是看我有什么。</p><p>数羊这个办法是从国外传过来的，英语里“羊”的发音是Sheep，和睡觉Sleep很接近，念多了就会就会有心理暗示。可是英文的心理暗示，中国人怎么用呢?!我有一套新的，更直接，更有效——就是数水饺。水饺——睡觉，这才是中国人的心理暗示!</p><p>我必须先澄清一下，我错过了自己的婚礼和我的未婚妻跟别人跑了这两件事没有因果关系!</p><p>我本来还想替男生争光的，没想到现在真的光了。</p><p>有句名言说得好，鲜花往往不属于赏花的人，而属于牛粪。</p><p>内心独白：当那个女孩听到关谷声音的那一刻，两个人的爱情就已经死了。关谷居然创造了网恋领域可以和见光死相提并论的又一悲剧——声……死……恋!</p><p>形势比预计的还要糟糕，做贼心虚曾经是中华民族的传统美德，现在也消失了。</p><p>就算不能拥有永久美丽的爱情，有颗永久值钱的钻石也是好的呀!</p><p>梦游梦话：我堂堂大清帝国就这么亡了，朕不甘心啊!朕不甘心啊!</p><p>梦游梦话：奉先，如果我做了皇帝，就封你当太子!</p><p>【小贤：看不出你还懂IT啊，具体做什么?】【张伟：刻光盘。】</p><p>领导说了，再刻半年光盘，我就可以转正了。</p><p>【小贤：有哪一集交代一菲是我的!】【张伟：那我可以追一菲了?!】【小贤：去你的!门儿都没有!】</p><p>【子乔：悟性不错啊小子，还会举一反三，果然比一菲的笨蛋弟弟强多了。】【张伟：那个笨蛋弟弟后来怎么样?】【子乔：他?他泡走了我们公寓最漂亮的富家千金。】</p><p>【莫兰：你是什么座的?】【张伟：我是肉做的!】</p><p>【张伟：失败倒确实是常事，不过我从来就没有胜过!我以为莫兰就是那个我要找的人，可她居然嫌我不是富二代!】【子乔：富二代?】【张伟：工资够付房贷和车贷，付二贷!】</p><p>【张伟：我终于明白了，这个厕所标志上的第三个人到底是谁。男人，女人，胡一菲!】【子乔：这只是表象，我跟你说...</p><p>1、我绝不向恶势力低头，打死你我也不干。</p><p>2、人生自古谁无死，早死晚死都得死。</p><p>3、你真是比李连杰还甄子丹!</p><p>4、你怎么能说他脑子进水了呢?前提是，也要有脑子啊。</p><p>5、三个臭皮匠，臭死诸葛亮。</p><p>6、我是曾哥跟你说了信我信我……</p><p>7、机会如雨点般的向我打来。但我却一一躲过。</p><p>8、好男人就是我，我就是曾小贤。</p><p>9、彪悍的人生是不需要解释的!</p><p>10、我才不会跟白痴计较，否则别人会分不清谁是白痴。</p><p>11、人生如戏，爱的是一个，结婚生子的又是另一个。很正常。</p><p>12、左眼跳，桃花开，右眼跳，菊花开。</p><p>13、我肯定会被砍成薯片的。</p><p>14、哈哈哈!老虎不发猫，你当我病危啊!</p><p>15、帮我把胡萝卜切成肉丁。</p><p>16、你有什么身份你就有个身份证。</p><p>17、你今天晚上必须给我上线，否则，我就把你名字写到碑上去。</p><p>18、跟我打赌，不是看你要什么，而是看我有什么…</p><p>19、唾沫是用来数钞票的不是用来讲理的。</p><p>20、你这跟直接去投胎有什么区别?!</p><p>21、这那是转折点呐?分明是骨折点。</p><p>22、富二代：工资能付车贷，房贷，付二贷。</p><p>23、踩到香蕉皮摔倒了，一定要爬起来继续踩，踩烂掉它就不滑了。</p><p>24、逃得了和尚，逃不了方丈。</p><p>25、青菜里面有青虫，粉丝里面有铁丝。</p><p>26、独坐沙发，望不尽天涯路。</p><p>27、男人都是蜡烛，不点不亮。</p><p>28、一菲：我们是有身份的客人，别弄得跟装修队一样。</p><p>29、别拿虾米不当海鲜。</p><p>30、小公鸡点到谁，我就选谁。</p><p>31、柯南要是活着，也会被气成毛利小五郎的。</p><p>32、你丫是绵羊音啊，一开始跑偏了再也跑不回来了是不是?</p><p>33、面对现实吧，生活往往比那些偶像剧的口味要重的多。</p><p>34、自恋加脑残，那可是自残哪!</p><p>35、那种笑容，甜蜜优雅，仿佛春风拂过泸沽湖，秋雨浸润九寨沟。</p><p>36、一菲：跟她沟通的时间越长我就越喜欢猪，猪永远是猪，人有时候不是人!</p><p>37、臭鸡蛋难道不是鸡蛋?</p><p>38、口香糖……网络传言说如果5片一起吃，通过咀嚼的动作也可以营造出饱的感觉，而且最关键——不会胖，最适合失恋的人群!</p><p>39、听别人的故事，留自己的泪。</p><p>40、要在江湖混，最好是光棍。</p><p>41、那句话怎么说来着——大丈夫能伸能缩</p><p>42、你小心，我放心。你贪心，我担心。你有心，我开心。你花心，我恶心。你负心，我伤心。一声祝福一片心，你的月亮我的心，新春祝福是真心。</p><p>43、你每天都和他们聊到半夜，他们哪有时间创造人类呢?</p><p>44、莫兰：你是什么座的?张伟：我是肉做的!</p><p>45、好狗不挡路，挡路的——都是...</p><p>1、曾小贤：听众朋友们，好男人就是我，我就是——曾小贤。</p><p>2、曾小贤：我的人生一直在现场直播!</p><p>3、曾小贤：这TM也可以，你们是演奥特曼的吧!</p><p>4、婉瑜：他说他是台长。</p><p>曾小贤：太可笑了，现在居然有人还姓台，过了一会儿，反应过来……</p><p>5、主持人：你打游戏吗?</p><p>曾小贤：偶尔。</p><p>主持人：星际还是魔兽?</p><p>小贤：连连看!</p><p>主持人：喷……</p><p>6、曾小贤：如果你要请假、我这还有更强的杀招。Find 点free，find 点time，take a children，go home look look，go home look look look.(找点空闲找点时间领着孩子常回家看看回家看看)</p><p>7、曾小贤：张伟、我的鸡翅要变态辣的!</p><p>8、曾小贤：这里四个半男人，怕什么。</p><p>展博：明明是三个半?</p><p>曾小贤：一、二(指子乔和小贤)，一菲算两个，你算半个。</p><p>9、曾小贤：淡定不是装的。孙子才是装的。</p><p>10、曾小贤：我现在知道为什么有那么多假奶粉了，先买一些奶粉，倒水冲好，然后晒干，这就是手工奶粉。你这叫菲鹿奶粉。</p><p>11、曾小贤：看不出你还懂IT啊，具体做什么?</p><p>张伟：刻光盘。</p><p>12、曾小贤：学士硕士全灭，男博士仅能自保，要打赢女博士，哼哼，只有靠圣斗士了。</p><p>13、曾小贤：Lisa榕，我诅咒你这辈子吃方便面没有调料包!!</p><p>14、曾小贤：你小心，我放心。你贪心，我担心。你有心，我开心。你花心，我恶心。你负心，我伤心。一声祝福一片心，你的月亮我的心，新春祝福是真心。</p><p>15、曾小贤：这个世界上有三种人、男人、女人、女博士。女博士是人类中的战斗机、身上笼罩着多层光环。</p><p>16、曾小贤：听别人的故事，留自己的泪。</p><p>17、曾小贤：大家好、欢迎收看《小贤有约》、我是你们的新小贤，曾朋友。啊……可以重来一遍吗?</p><p>18、胡一菲：我和展博以前是连体婴儿，两岁前我们俩脑子还长在一块呢。</p><p>曾小贤：对，然后医生刀一快，把脑子全给了展博。</p><p>19、胡一菲：我不是随便的人。</p><p>曾小贤：你随便起来不是人。</p><p>20、胡一菲：我不会在同一个地方摔倒两次了!</p><p>曾小贤：当然，绿毛龟都是四脚着地，你让它摔给我看看。</p><p>21、曾小贤：纳尼亚疗养院，一针包治疗效好，不烦不躁睡得早，八折酬宾花钱少，全国推广期，破盘价只要998,立即入院，你还将获赠八星八箭镶钻菜刀一把，纳尼亚疗养院，效果好!(最后小贤拿出一个金手指)</p><p>22、曾小贤：你是说，它是一只老鼠，但是名字叫：小强?</p><p>23、胡一菲：俗话说情人眼里出西施，那西施眼里出什么?</p><p>曾小贤：眼屎!</p><p>24、曾小贤：一百种人就有一百种意见，你不可能让所有的人都满意，因为不是所有的人都是人。</p><p>1、跟我打赌，不是看你要什么，而是看我有什么…</p><p>2、下次结婚必须叫你</p><p>3、一菲喊道：“大家，此刻时刻紧，任务重，务必发奋，不能够出任何差错，听明白了吗?”</p><p>4、关关雎鸠，在河之洲，窈窕淑女，what&#39;s you QQ?</p><p>5、关谷：(视频中)张伟他是个律师，高端大气上档次。(张伟穿着雨衣自拍)</p><p>6、张伟娘娘腔：我一个大男生怎样会八卦呢。这才是咱们女生的正常的条件反射嘛，厌恶啦，你不好在意这些细节</p><p>7、张伟:像咱们女生</p><p>8、厕所，陪我去上一下老公</p><p>9、你是什么座的?我是肉做的</p><p>10、一菲：俗话说情人眼里出西施，那西施眼里出什么?曾小贤：眼屎。</p><p>11、鄙人姓黄，字辉冯。。。</p><p>12、原来向人道歉，能够用一块表。。。一盒生鱼片。。。一个气球。。</p><p>13、诺澜：他是不是恋爱了?曾小贤：不，他是变态了</p><p>14、上得了厅堂，下得了厨房，杀得了木马，翻得了围墙，开得了汽车，买得起洋房，斗得了小三，打得赢流氓。</p><p>15、一菲：我只听说过黑化肥挥发会发灰，没听说过催化肥挥发会发臭的啊美嘉：你好强啊</p><p>16、青菜里面有青虫，粉丝里面有铁丝</p><p>17、诺澜：药……药……曾小贤：切克闹</p><p>18、关谷：饿着，那你就多吃点啊。悠悠：他说的是恶兆。恶是凶恶的恶，兆是凶。</p><p>19、帮我把胡萝卜切成肉丁。</p><p>20、关谷：巨龙巨龙你差年，永永远远的差年。</p><p>21、天使与你同在</p><p>22、还好不是红酒否则我的衣服就废了还好不是硫酸否则你的脸就废了。</p><p>23、相聚和离别，仿佛一个转身，一圈之后一圈，连成性命的舞蹈，有的人还会回来，有的人知道再见太难。</p><p>24、我太太个性钟爱企鹅，因此咱们打算移民去非洲，顺便能够看看袋鼠</p><p>25、你真是比李连杰还甄子丹!</p><p>26、打人不提倡，打脸伤自尊</p><p>27、死不可怕，坐着等死才可怕。</p><p>28、张伟：我已经找到花泽类的感觉了。一菲：把他撞死算了</p><p>29、美嘉：你就是坨被狗撒过尿的口香糖。一菲：化粪池堵塞的凶手，拿去火化都怕污染大气层。美嘉：动物世界的败类</p><p>30、美嘉：验血是不是有学历要求</p><p>31、我当了皇帝，就封你当太子。</p><p>32、子乔：此刻你的眼神很像梁朝伟，眉宇间有点金城武的味道，拿啤酒的动作，乍一看像吴镇宇。就是脸长的像曾志伟</p><p>33、死不可怕，坐在这儿等死才可怕</p><p>34、子乔：楼主，咱们进来了。别误会，楼主，咱们是来看你最后一眼的。关谷：楼主，不得不说，你的头实在太大了，咱们四个加在一齐都救不了楼主。张伟：楼主，你再坚持一下。一菲：人家都下线了</p><p>35、不以结婚为目的的恋爱就是耍流氓。</p><p>36、不按常理出牌，柯南要是活着，也会被气成毛利小五郎的。</p><p>37、意见一致，我说了算。意见不一致，她说了算。</p><p>38、张伟：(花泽类的声音)每当...</p><p>下面是出国留学网提供的爱情公寓经典骂人语录，欢迎阅读。</p><p>1.美嘉：看看你那张大脸，每次站你旁边我手机都没信号，走到马路上都看不到太阳!</p><p>2.子乔：你脑袋被门挤了吧?你这个每天退化三次的恐龙!</p><p>3.一菲：我要是见不着那个男人我就让你消失!生物学和社会学双重意义上的消失!</p><p>4.婉瑜:丑，但是丑的特别，就是特别的丑!</p><p>5.小贤:我不是随便的人!一菲:你随便起来不是人!</p><p>6.千万不要在一棵树上吊死，要在周围几棵树上多吊死几次试试....</p><p>7.展博：姐，如果有一个人深深地伤害了你，那你要多久才能原谅他?一菲：原谅他?原谅他是上帝的事情，我的任务，就是送他去见上帝!</p><p>8.子乔：现在你的眼神很像梁朝伟，眉宇间有点金城武的味道，拿啤酒的动作，乍一看像吴镇宇。就是脸长的像曾志伟。</p><p>9.张伟：我在孤儿院做过智力测试，老师说我的智商如减掉四十的话，才可能勉强被定义为聪明、一菲：你们孤儿院的智商测试仪还不如我们家的微波炉</p><p>10.羽墨：真应该在你(子乔)脑子里装个抽水马桶，把那些恶心的东西都抽掉、一菲：那他的大脑就整个冲掉了.</p><p>11.我一口盐汽水噴死你</p><p>12.公交车师傅(对展博)：变态啊你，要么刷卡，要么投币，要么滚蛋，扭什么扭!</p><p>13.公交车师傅(对保镖)：哎，回来!要么刷卡，要么投币，要么滚蛋，看什么看!(保镖下车)公交车都坐不　　起，还冒充黑客帝国，哼!</p><p>14.子乔：人家是陈圆圆，你?(瞄胸)陈，扁，扁!</p><p>15.闪姐：沙丁鱼罐头都比你有前途</p><p>16.美嘉：看看你那张大脸，每次站你旁边我手机都没信号，走到马路上都看不到太阳!</p><p>17一菲：我觉得这事儿完全不靠谱儿，中国男足世界杯夺冠和你的离谱程度其实差不多</p><p>18.一菲：切，你把郁闷俩字儿都写脸上了，不识字儿的还真看不出来</p><p>19.一菲：你缺心眼儿!天下之大都大不过你缺的那块心眼儿</p><p>20.一菲：八个女生，四个带着钢牙，三个眼镜片比啤酒瓶子还厚，还有一个个头儿比你都大...我现在完全明白为什么叫作原始动物协会了，你们相互研究一下就可以了，省的买标本了</p><p>21.宛瑜：鄙视他是每个公民应尽的义务</p><p>22.一菲：你妈生你的时候是不是把人扔了，把胎盘养大了</p><p>23.子乔：我也想找一个可以把我的头像印到货币上去的地方.美嘉：不难啊，你找个印冥钞的地方不就可以了吗</p><p>24.子乔：在我们男人的世界里，还是强人如云，衰人如星的。一菲：可我放眼望去，万里无云，满天繁星</p><p>25一菲：你无耻，你卑鄙，你不靠谱!</p><p>子乔：那你就不无耻，不卑鄙，非常靠谱?</p><p>一菲：我哪里无耻，哪里卑鄙，哪里不靠谱了!?</p><p>子乔：你哪里不无耻，哪里不卑鄙，哪里靠谱了!?</p><p>一菲：就算我再怎么无耻，再怎么卑鄙，再怎么不靠谱，也不会比你更无耻，更卑鄙，更不靠谱了!!</p><p>26一菲：俗话说情人眼里出西施，那西施眼里出什么?谢谢：(想了一会)眼屎啊!</p><p>1、我一口盐汽水喷死你。　　2、下次结婚必须叫你　　3、一菲喊道：“大家，此刻时刻紧，任务重，务必发奋，不能够出任何差错，听明白了吗?”　　4、关关雎鸠，在河之洲，窈窕淑女，what&#39;syouQQ?　　5、关谷：(视频中)张伟他是个律师，高端大气上档次。(张伟穿着雨衣自拍)　　6、张伟娘娘腔：我一个大男生怎样会八卦呢。这才是咱们女生的正常的条件反射嘛，厌恶啦，你不好在意这些细节　　7、张伟:像咱们女生　　8、我是刀子嘴，斧子心!　　9、你是什么座的?我是肉做的　　10、一菲：俗话说情人眼里出西施，那西施眼里出什么?曾小贤：眼屎。　　11、鄙人姓黄，字辉冯。。。　　12、原来向人道歉，能够用一块表。。。一盒生鱼片。。。一个气球。。　　13、诺澜：他是不是恋爱了?曾小贤：不，他是变态了　　14、上得了厅堂，下得了厨房，杀得了木马，翻得了围墙，开得了汽车，买得起洋房，斗得了小三，打得赢流氓。　　15、一菲：我只听说过黑化肥挥发会发灰，没听说过催化肥挥发会发臭的啊美嘉：你好强啊　　16、青菜里面有青虫，粉丝里面有铁丝　　17、诺澜：药……药……曾小贤：切克闹　　18、关谷：饿着，那你就多吃点啊。悠悠：他说的是恶兆。恶是凶恶的恶，兆是凶。　　19、帮我把胡萝卜切成肉丁。　　20、关谷：巨龙巨龙你差两年，永永远远的差两年。　　21、天使与你同在　　22、还好不是红酒否则我的衣服就废了还好不是硫酸否则你的脸就废了。　　23、相聚和离别，仿佛一个转身，一圈之后一圈，连成性命的舞蹈，有的人还会回来，有的人知道再见太难。　　24、我太太个性钟爱企鹅，因此咱们打算移民去非洲，顺便能够看看袋鼠　　25、你真是比李连杰还甄子丹!　　26、打人不提倡，打脸伤自尊。　　27、死不可怕，坐着等死才可怕。　　28、张伟：我已经找到花泽类的感觉了。一菲：把他撞死算了　　29、美嘉：你就是坨被狗撒过尿的口香糖。一菲：化粪池堵塞的凶手，拿去火化都怕污染大气层。美嘉：动物世界的败类　　30、美嘉：验血是不是有学历要求　　31、我当了皇帝，就封你当太子。　　32、子乔：此刻你的眼神很像梁朝伟，眉宇间有点金城武的味道，拿啤酒的动作，乍一看像吴镇宇。就是脸长的像曾志伟　　33、死不可怕，坐在这儿等死才可怕　　34、子乔：楼主，咱们进来了。别误会，楼主，咱们是来看你最后一眼的。关谷：楼主，不得不说，你的头实在太大了，咱们四个加在一齐都救不了楼主。张伟：楼主，你再坚持一下。一菲：人家都下线了　　35、不以结婚为目的的恋爱就是耍流氓。　　36、不按常理出牌，柯南要是活着，也会被气成毛利小五郎的。　　37、意见一致，我说了算。意见不一致，她说了算。　　38、张伟：(花泽类的声音)每当你想哭的时候，你就倒立，这样，眼泪就不会流下来。　　39、曾小贤：胡一菲是不是让你们跟我划清界限啊?张伟子乔：没有，咱们只是随便聊聊。(两人同时点头)　　40、胡一菲：...</p><p>《爱情公寓》，在搞笑的同时又很有爱的喜剧爱情故事片，每到夏天，《爱情公寓》火爆荧屏，其中一些经典的搞笑台词仍然念念不忘，下面出国留学网范文栏目的小编就和大家一起来分享一下吧。</p><p>爱情公寓经典台词</p><p>1.一菲：我见过很多贱人，但是没见过你这么贱的。。。</p><p>2.宛喻:你高数正在重修,你爸妈正在重婚.</p><p>3.展博(陶醉地形容他的姐姐)：“人们用八个字来形容她：静若处子，动若疯兔。”</p><p>一菲：“对!没错!红色的地毯是80米，怎么搞的，竟然少了我5米，这老板也太缺德了吧?猪肉涨价地毯也来给我缺斤少两?他们的地毯不是猪皮做的吧?”</p><p>4.交警：喂“10.10有一个宝马以140迈的速度想你那边去了它的后边跟着一个奔驰奔驰后面跟着一个拖拉机，更牛的是拖拉机的左转向灯打开了他想超车啊!!!!!!</p><p>5.曾小贤：“听众朋友们，好男人就是我，我就是好男人，我就是——曾小贤。”</p><p>“小贤就有这样一个室友，他和一个女孩生活在同一幢公寓的两个套房中，可惜一个总是向左走，另一个总是……坐电梯”</p><p>6.胡一菲：“我和展博以前是连体婴儿，两岁前我们俩脑子还长在一块呢。”</p><p>曾小贤：“对，然后医生刀一快，把脑子全给了展博。”</p><p>7.宛瑜(唱歌)：“啦啦啦啦啦啦”</p><p>拖拉车大叔：“闺女，你这歌是跟我学的吧?”</p><p>宛瑜：“啊?大叔，你也会?”</p><p>拖拉车大叔：“我们家的鸡就是这样，鸡爪的动作和你一样，一提一放，一提一放……还有挤奶的动作，这样这样，我也不知道从哪时起，好多小青年就开始学我”</p><p>宛瑜：“大叔，你真逗，那你是Hip-hop的创始人咯”</p><p>拖拉车大叔：“啥?撞死人(创始人)?我开拖拉机慢得很，从来没撞过人”</p><p>曾小贤：“我们收到一封特别的来信，是来自与这对新婚的特别月老，也就是我们这对公寓的创始人。”</p><p>展博(极度郁闷)：“怎么又撞死人(创始人)?”</p><p>8.“我要藏宝图，你给我张地图，啊?这还是张世界地图?”——陆展博</p><p>9.“吃烧饼吃出啤酒盖儿，吃馄饨吃出樟脑丸，打苍蝇手拍在钉子上，去青松观烧香，手机掉到功德箱里拿不出来了。”——热心听众</p><p>“一辆宝马车速280码向你处开来，后面跟着一辆奔驰在飙车，慢着，后面还跟着一辆拖拉机更牛，还打着左变道灯，他想超</p><p>车!”——交通警察</p><p>“咱俩五五分，先说好，谁是五?”——陈美嘉</p><p>10.“给我五份强暴鸡米花”——宛瑜</p><p>“两位神童，人家那是劲暴鸡米花”——一菲</p><p>“哦，什么时候改名了”——展博</p><p>11.问：情人眼里出西施，那西施眼里出什么?答：西施眼里出眼屎~</p><p>12.美佳的网上留言：我以前也经常在网上被人骚扰的后来我发现起什么用户名很重要...工作帐号谢绝闲聊若要闲聊每字伍毛标点符号半价收费...</p><p>爱情公寓经典语录</p><p>彪悍的人生是不需要解释的!</p><p>你怎么能说他脑子进水了呢?前提是，也要有脑子啊。</p><p>三个臭皮匠，臭死诸葛亮。</p><p>说的好，说了一大堆，我没怎么听懂。</p><p>好男人就是我我就是曾小贤。</p><p>我一口盐汽水喷死你。</p><p>机会如雨点般的向我打来。但我却一一躲过。</p><p>面对现实吧，生活往往比那些偶像剧的口味要重的多。</p><p>帮我把胡萝卜切成肉丁。</p><p>你有什么身份你就有个身份证。</p><p>子乔：悟性不错啊小子，还会举一反三，果然比一菲的笨蛋弟弟强多了。张伟：那个笨蛋弟弟后来怎么样?|子乔：他?他泡走了我们公寓最漂亮的富家千金。</p><p>胡一菲从六千米的高空突然跌到了一千米，为什么她仍然没有死错误回答：因为她在飞机里跌倒的正确答案：因为她是中国股民</p><p>子乔：你的眸，清澈动人，你的手，温柔细腻，你的心，晶莹剔透;美嘉：你的臂，孔武有力，你的胸，宽广伟岸，你的皮，刀枪不入……</p><p>一菲：原始动物协会，你这也算社交?展博：是原始动物研究者协会，里面有很多女生，你不是看过照片吗?一菲：八个女生，四个带着钢牙，三个眼镜片比啤酒瓶子还厚，还有一个个头儿比你都大…我现在完全明白为什么叫作原始动物协会，你们相互研究一下就可以了，省的买标本。</p><p>羽墨：28岁怎么了，我最痛恨的就是年龄歧视!黄忠六十跟刘备，德川家康七十打天下，姜子牙八十为丞相，佘太君百岁挂帅，孙悟空五百多岁西天取经，白素贞一千多岁还下山谈恋爱呢!!</p><p>小贤：行，你有种，那我就告诉去告诉她，关谷喜欢你很久了。|关谷：你胡说什么。|小贤：哈!还装，从悠悠上次去试镜的时候我就看出来了，瞳孔放大，坐立不安，还有后来我买回来的20多包方便面都被你捏成面粉了</p><p>美嘉：你怎么就不学人家吴三桂，做男人要懂得忍辱负重。|子乔：那要看对谁了，人家可是陈圆圆～～～|美嘉：那有什么了不起的，我也姓陈。|子乔：人家陈圆圆，你(瞄胸)，陈扁扁～～</p><p>展博：先来五份“强暴鸡米花”!|宛瑜(对服务员)：那我们要五份“强暴鸡米花”|一菲：两位神童，人家那是“劲暴鸡米花”|展博：哦，是吗，改名啦?</p><p>美嘉：大姨妈提前来看我了，我现在腰很酸，肚子很难受。|关谷：美嘉，你大姨妈对你真好啊，要不今天她睡我房间，我睡沙发。|宛瑜：关谷，你说的大姨妈和她说的不是一码事儿。|关谷：哦，美嘉有很多大姨妈吗?你外婆真能生啊，我只有一个，但是我有三个小舅妈!</p><p>爱情公寓3经典语录</p><p>1、天呐，我跳进日本海都洗不清了。</p><p>2、说的好，说了一大堆，我没怎么听懂。</p><p>3、机会如雨点般的向我打来。但我却一一躲过。</p><p>4、面对现实吧，生活往往比那些偶像剧的口味要重的多。</p><p>5、帮我把胡萝卜切成肉丁。</p><p>6、你有什么身份你就有个身份证。</p><p>7、好男人就是我我就是曾小贤。</p><p>8、吵架总是不好的，不如，干脆决斗吧?</p><p>9、我是曾哥跟你说了信我信我……</p><p>10、我一口盐汽水喷死你。</p><p>11、没有金刚钻就别揽瓷器活，没有金箍棒就别穿小短裙。</p><p>12、我闻到了奸情的味道。</p><p>14、打人不提倡打脸上自尊，我们兄弟连心，只要你敢对我们任何一个人使用暴力，我们另外两个就会，报警的。</p><p>15、唾沫是用来数钞票的不是用来讲理的。</p><p>16、我们是两个站在街头即将放飞理想的有志青年。</p><p>17、我当了皇帝，就封你当太子。</p><p>18、左眼跳，桃花开，右眼跳，菊花开。</p><p>19、我肯定会被砍成薯片的。</p><p>20、人生自古谁无死，早死晚死都得死。</p><p>21、相聚和离别，仿佛一个转身，一圈接着一圈，连成生命的舞蹈，有的人还会回来，有的人知道再见太难。</p><p>22、你真是比李连杰还甄子丹!</p><p>23、彪悍的人生是不需要解释的!</p><p>24、你怎么能说他脑子进水了呢?前提是，也要有脑子啊。</p><p>25、你今天晚上必须给我上线，否则，我就把你名字写到碑上去。</p><p>26、我会十几种不同的死法。</p><p>27、人生如戏，爱的是一个，结婚生子的又是另一个。很正常。</p><p>28、现在生米都已经煮成稀饭了。</p><p>29、死不可怕，坐着等死才可怕。</p><p>30、意见一致，我说了算。意见不一致，她说了算。</p><p>1、左眼跳，桃花开，右眼跳，菊花开。</p><p>2、你今天晚上必须给我上线，否则，我就把你名字写到碑上去。</p><p>3、我会十几种不同的死法。</p><p>4、人生如戏，爱的是一个，结婚生子的又是另一个。很正常。</p><p>5、我肯定会被砍成薯片的。</p><p>6、人生自古谁无死，早死晚死都得死。</p><p>7、现在生米都已经煮成稀饭了。</p><p>8、死不可怕，坐着等死才可怕。</p><p>9、意见一致，我说了算。意见不一致，她说了算。</p><p>10、天呐，我跳进日本海都洗不清了。</p><p>11、相聚和离别，仿佛一个转身，一圈接着一圈，连成生命的舞蹈，有的人还会回来，有的人知道再见太难。</p><p>12、你真是比李连杰还甄子丹!</p><p>13、彪悍的人生是不需要解释的!</p><p>14、你怎么能说他脑子进水了呢?前提是，也要有脑子啊。</p><p>15、三个臭皮匠，臭死诸葛亮。</p><p>16、说的好，说了一大堆，我没怎么听懂。</p><p>17、好男人就是我我就是曾小贤</p><p>18、我是曾哥跟你说了信我信我。。。</p><p>19、我一口盐汽水喷死你</p><p>20、机会如雨点般的向我打来。但我却一一躲过</p><p>21、面对现实吧，生活往往比那些偶像剧的口味要重的多。</p><p>22、富二代：工资能付车贷，房贷，付二贷。</p><p>p style=&quot;text-align:center;&quot;&gt;</p><p>23、庸人方自扰。</p><p>24、逃得了和尚，逃不了方丈。</p><p>25、青菜里面有青虫，粉丝里面有铁丝。</p><p>26、独坐沙发，望不尽天涯路。</p><p>27、男人都是蜡烛，不点不亮。</p><p>28、话粗理不粗。</p><p>29、别拿虾米不当海鲜。</p><p>30、那也不能撩进碗里就是菜呀。</p><p>30、小公鸡点到谁，我就选谁。</p><p>31、柯南要是活着，也会被气成毛利小五郎的。</p><p>32、你丫是绵羊音啊，一开始跑偏了再也跑不回来了是不是?</p><p>33、一菲：我们是有身份的客人，别弄得跟装修队一样。</p><p>34、自恋加脑残，那可是自残哪!</p><p>35、那种笑容，甜蜜优雅，仿佛春风拂过泸沽湖，秋雨浸润九寨沟。</p><p>36、数羊这个办法是从国外传过来的，英语里”羊”的发音是Sheep，和睡觉Sleep很接近，念多了就会就会有心理暗示。可是英文的心理暗示，中国人怎么用呢?!我有一套新的，更直接，更有效——就是数水饺。水饺——睡觉，这才是中国人的心理暗示!</p><p>37、臭鸡蛋难道不是鸡蛋?</p><p>38、口香糖……网络传言说如果5片一起吃，通过咀嚼的动作也可以营造出饱的感觉，而且最关键——不会胖，最适合失恋的人群!</p><p>39、听别人的故事，留自己的泪。</p><p>40、问：西游记中沙和尚说得最多的4句话是什么?答：1、大师兄，师傅被妖怪抓走了2、大师兄，二师兄被妖怪抓走了3、大师兄，师傅和二师兄被妖怪抓走了4、二师兄，师傅被妖怪抓走了</p><p>41、</p><p>问：一个乌龟钻出自己的壳，拆了重新盖了一个，然后钻进去住，打一保健品。</p><p>答：钙中钙又问：</p><p>又答：新盖中盖</p><p>再问：乌龟再一次钻出自己的壳，拆了再一次重新盖了一个，然后钻进去住，打一保健品</p><p>再答：巨能钙</p><p>1、36行，行行出二货——《爱情公寓4》</p><p>2、一菲：常言道，出其不意</p><p>小贤：必自毙——《爱情公寓3》</p><p>3、小贤：月亮短路了？——《爱情公寓3》</p><p>4、友情越位，恋人未满。——《爱情公寓4》</p><p>5、静若处子，动若疯兔——《爱情公寓4》</p><p>6、我是刀子嘴，斧子心！——《爱情公寓4》</p><p>7、自恋加脑残，等于自残——《爱情公寓4》</p><p>8、子乔：我是被自愿的！——《爱情公寓2》</p><p>9、早跳早收工早死早超生。——《爱情公寓4》</p><p>10、八字不够硬龙袍穿不进。——《爱情公寓4》</p><p>11、一朝被电击，十年怕网线。——《爱情公寓4》</p><p>12、打人不提倡，打脸伤自尊。——《爱情公寓4》</p><p>13、悠悠：猴哥快看，有妖怪。——《爱情公寓3》</p><p>14、杜老板：驻唱的也是艺术家——《爱情公寓4》</p><p>15、被门夹过的核桃还能补脑吗？——《爱情公寓4》</p><p>16、子乔：脑残是死不足惜的。——《爱情公寓3》</p><p>17、张伟：人无完人，但无完蛋。——《爱情公寓3》</p><p>18、子乔：咦，你的眼睛，出汗了。——《爱情公寓3》</p><p>19、三浪真言：浪漫，浪费，浪叫。——《爱情公寓4》</p><p>20、关古：当局者迷挡我者死。——《爱情公寓1》</p><p>21、一菲：冒烟的是我，不是雪茄。——《爱情公寓3》</p><p>22、小贤：八卦是人类第四大本能。——《爱情公寓2》</p><p>23、美嘉：我一口盐汽水喷死你。——《爱情公寓1》</p><p>24、死不可怕，坐在这儿等死才可怕。——《爱情公寓4》</p><p>25、子乔：不听老人言，死在我面前。——《爱情公寓1》</p><p>26、子乔：人生自古谁无死，早死晚死都得死。——《爱情公寓2》</p><p>27、宛瑜：鄙视他是每个公民应尽的义务。——《爱情公寓1》</p><p>28、闪姐：钱不够，演员未定，剧本暂无。——《爱情公寓1》</p><p>29、羽墨：空口说大号可是会长獠牙的？——《爱情公寓2》？</p><p>30、张伟：我真不是名流，我就是个人流。——《爱情公寓2》</p><p>31、小贤：听别人的故事，留自己的泪。——《爱情公寓2》</p><p>32、羽墨：我建议你可以吃点……“独活”。——《爱情公寓2》</p><p>33、常言道，冰冻三尺，非微波炉不能解冻。——《爱情公寓4》</p><p>34、子乔：不要和我比懒，我懒得跟你比！——《爱情公寓1》</p><p>35、小贤：男人有钱不变坏母猪上树变妖怪。——《爱情公寓1》</p><p>36、小贤：缘分！“顺便”就是一种缘分！——《爱情公寓2》</p><p>37、一菲：好狗不挡路，挡路的——都是路障。——《爱情公寓2》</p><p>38、小贤：哈哈哈！老虎不发猫，你当我病危啊！——《爱情公寓2》</p><p>39、独乐乐不如众乐乐，羊癫疯不如人来疯——《爱情公寓4》</p><p>40、一菲：好歹是个男人，叫得跟小沈阳似的。——《爱情公寓2》</p><p>41、诺澜：药……药……曾小贤：切克闹————《爱情公寓4》</p><p>42、你看看他，人又不聪明，还学人家秃顶！——《爱情公寓1》</p><p>43、子乔：“助人”和“为乐”本来就是不冲突地。——《爱情公寓2》</p><p>44、挣票子。买房子。泡妹子。这才是真汉子。——《爱情公寓4》</p><p>45、要么功课做在事前，要么小抄带在身边。——《爱情公寓4》</p><p>46、这个比赛你不能去看，因为它太反人类了。——《爱情公寓4》</p><p>47、一菲：我用百度帮你Google一下就行了。——《爱情公寓1》</p><p>48、宛瑜：丑，但是丑的特别，就是特别的丑！——《爱情公寓1》</p><p>49、我喜欢他，但那都是过去式，生活是未来式。——《爱情公寓4》</p><p>50、美嘉同学：没想到你数学这么多年还是那么犀利。——《爱情公寓4》</p><p>51、小贤：去你外婆家的香蕉皮，这货开挂了吧！——《爱情公寓3》</p><p>52、心理医生？一个字“忽悠你，吓唬你，搞定你。”——《爱情公寓1》</p><p>53、一菲：把你不开心的事情说出来让大家开心一下。——《爱情公寓1》</p><p>54、宛瑜：我是一个比卡巴斯基还要称职的防火墙。——《爱情公寓1》</p><p>55、小贤：正所谓，酒足思yin欲，吃饱没事干。——《爱情公寓3》</p><p>56、小贤：大家好，我是你们的新小贤，曾朋友…——《爱情公寓1》</p><p>57、世间的喧闹都是浮云，书中的宁静才是永恒的。——《爱情公寓4》</p><p>58、张伟：准律师也是律师，臭鸡蛋难道不是鸡蛋？——《爱情公寓2》</p><p>59、子乔：猫都能跳楼自杀，鸭子还能投河自尽呢。——《爱情公寓3》</p><p>60、小贤：正所谓天生我材必有用，户外野营显神功。——《爱情公寓3》</p><p>61、小贤：还要破啊，你干脆把我的话筒换成黄瓜算了。——《爱情公寓3》</p><p>62、小贤：你们两个身坚志残的青年男女有神马压力啊。——《爱情公寓3》</p><p>63、美嘉：吕大忽悠，音容犹在，千古混蛋，死不瞑目。——《爱情公寓1》</p><p>64、悠悠：也就八分熟，说不定放回海里，还能游呢。——《爱情公寓3》</p><p>65、路人甲：太神奇了，交大半张白卷，竟然还能及格！——《爱情公寓3》</p><p>66、一菲：烈士还能追认呢，惊喜为什么不能补办啊？——《爱情公寓3》</p><p>67、关谷：像那群白痴一样围在他的身边，哈哈哈哈。——《爱情公寓3》</p><p>68、子乔：一万和一百万都是一样的，因为我都没有！——《爱情公寓1》</p><p>69、诺澜：他是不是恋爱了？曾小贤：不，他是变态了。——《爱情公寓4》</p><p>70、关谷：你都措了一个多星期了，辞海都要措出来了。——《爱情公寓3》</p><p>71、悠悠：你红过？有多红？彤彤红、鹤顶红、夕阳红？——《爱情公寓4》</p><p>72、他带领的驯兽师被狮子给吃掉了，在处理后事呢。——《爱情公寓3》</p><p>73、你们知道三叶草的花语是什么吗？曾小贤：耶耶耶！——《爱情公寓4》</p><p>74、面对现实吧，生活往往比那些偶像剧的口味要重的多。——《爱情公寓4》</p><p>75、小贤：每当我找到成功的钥匙，就有人把琐给换了！——《爱情公寓3》</p><p>76、子乔：兄弟一二三四五，花钱不分你和我。——《爱情公寓3》</p><p>关谷：兄弟个十百千万，男人花钱不怕散。——《爱情公寓3》</p><p>77、悠悠：四条腿儿的蛤蟆没有，四条腿儿的会计多的是。——《爱情公寓3》</p><p>78、美嘉：那你下雨天不用打伞了，诶，这个会长蘑菇吗？——《爱情公寓3》</p><p>79、曾经我像灯火发过誓，我要是再和他说话……灯灭……——《爱情公寓4》</p><p>80、张伟：你满足吗？美嘉：我娘是满族。我爹，是兽族的。——《爱情公寓4》</p><p>81、子乔：事成之后我俩五五分成。美嘉：先说好，谁是五。——《爱情公寓1》</p><p>82、小贤：发挥……你还是先把你身上的味道挥发一下吧！——《爱情公寓1》</p><p>83、美嘉：读个大学连女朋友都没有，不是不务正业是什么？——《爱情公寓4》</p><p>84、黄辉冯：你以为我是江湖骗子啊，我们知识分子有节操啊！——《爱情公寓4》</p><p>85、一菲：如果我的感情失败的话，趴在地上的一定是对方。——《爱情公寓2》</p><p>86、小贤：Lisa榕，我诅咒你这辈子吃方便面没有调料包！——《爱情公寓2》</p><p>87、一菲：你妈生你的时候是不是把人扔了，把胎盘养大了！——《爱情公寓1》</p><p>88、子乔：你脑袋被门挤了吧？你这个每天退化三次的恐龙！——《爱情公寓1》</p><p>89、一菲：我才不会跟白痴计较，否则别人会分不清谁是白痴。——《爱情公寓2》</p><p>90、一菲：古人云：不论你二与不二，二就在那里，不三不四。——《爱情公寓3》</p><p>91、子乔：生活就像一场游戏，你不去刷怪，就被别人刷光了。——《爱情公寓3》</p><p>92、小贤：没有金刚钻就别揽瓷器活，没有金箍棒就别穿小短裙。——《爱情公寓3》</p><p>93、一菲：你们知道防御自卫的前提是什么吗？展博：肉厚加扛揍。——《爱情公寓4》</p><p>94、子乔：我是一名天生的演员，我从小一看到漂亮MM，眼就圆。——《爱情公寓1》</p><p>95、Lisa:（指曾小贤的脸）不是软件的问题，你应该换台显示器！——《爱情公寓1》</p><p>96、在我们那里，一个男生对一个女生有意思，就会说留个电话呗！——《爱情公寓4》</p><p>97、那你们又知道葫芦的花语是什么吗？关谷：你到底在买什么药。——《爱情公寓4》</p><p>98、张伟：我的优点是：我很帅；但是我的缺点是：我帅的不明显。——《爱情公寓2》</p><p>99、张伟：有句名言说得好，鲜花往往不属于赏花的人，而属于牛粪。——《爱情公寓2》</p><p>100、悠悠：你也可以喝这个啊，说明书上说这个奶粉可以喝到六岁。——《爱情公寓2》</p><p>101、小贤：而我呢，除了沙发上的屁股印，一点活着的证据都没有。——《爱情公寓3》</p><p>102、美嘉：没听说过一句老话吧，只知道数钱的人，最终无钱可数。——《爱情公寓1》</p><p>103、你今天晚上必须给我上线，否则——我就把你的名字写到碑上去。——《爱情公寓4》</p><p>104、子乔：人在江湖飘，哪能不挨刀，我叫吕子乔，保命靠小号！——《爱情公寓1》</p><p>105、我太太特别喜欢企鹅，所以我们打算移民去非洲，顺便可以看看袋鼠。——《爱情公寓4》</p><p>106、我连孩子的手和脚都分不清，万一给他换尿布时把他闷死怎么办？——《爱情公寓1》</p><p>107、关谷：三十六计果然博大精深，而且招招都把人往绝路上送啊！——《爱情公寓2》</p><p>108、一菲：这……大概是因为所有有爱心的人都长着一张善良的脸吧！——《爱情公寓2》</p><p>109、一菲：切，你把郁闷俩字儿都写脸上了，不识字儿的还真看不出来。——《爱情公寓1》</p><p>110、一菲：麻烦大家以后不要再穿裙子上我的课，否则我就罚她倒立。——《爱情公寓2》</p><p>111、子乔：即使明天是世界末日，我们一样穿着得体，这是一种人生态度。——《爱情公寓3》</p><p>112、小贤喝醉：我是一直快乐的小白鸽~我要飞啊飞啊，别碰我翅膀？——《爱情公寓2》</p><p>113、美嘉：你的臂，孔武有力，你的胸，宽广伟岸，你的皮，刀枪不入…——《爱情公寓1》</p><p>114、一菲：楼下告示，全球的猪肉都涨了，难道你要我到火星上去买猪肉？——《爱情公寓1》</p><p>115、张伟：那种笑容，甜蜜优雅，仿佛春风拂过泸沽湖，秋雨浸润九寨沟。——《爱情公寓2》</p><p>116、小贤：踩到香蕉皮摔倒了，一定要爬起来继续踩，踩烂掉它就不滑了。——《爱情公寓2》</p><p>117、关谷：原来还有比听曾老师节目更煎熬的事情，就是等他的节目开始。——《爱情公寓3》</p><p>118、羽墨：不是我吃，我给我男朋友吃，——“当归”，让他记得当夜归来！——《爱情公寓2》</p><p>119、一菲：胡氏兵法有云，黄袍加身，逼上梁山，才能釜底抽薪，力挽狂澜！——《爱情公寓3》</p><p>120、子乔：这好办，你把杀毒软件卸载了，就看不到中毒了，这办法百试百灵。——《爱情公寓3》</p><p>121、一菲：跟她沟通的时间越长我就越喜欢猪，猪永远是猪，人有时候不是人！——《爱情公寓2》</p><p>122、关谷：网上不靠谱，你一定会找到无数的施主，说不定，连方丈都找到了。——《爱情公寓3》</p><p>123、一菲的妈：你既然要下周告诉我，为什么这么早跟我打电话，你这不是坑娘吗。——《爱情公寓3》</p><p>124、小贤：这种扑面而来的肉麻感，会让所有人类，菊花一紧，虎躯一震的。——《爱情公寓3》</p><p>125、小贤：千万不要在一棵树上吊死，要在周围几棵树上多吊死几次试试…——《爱情公寓1》</p><p>126、记住，你现在在大学流的汗水和泪水，都是你当时选专业时脑子进的水！——《爱情公寓4》</p><p>127、美嘉：一七得七，二七四十八，三八妇女节，五一劳动节，六一儿童节……——《爱情公寓1》</p><p>128、关谷：原来女人是水做的，张伟，是痰做的。悠悠：他肺里到底攒了多少？——《爱情公寓4》</p><p>129、一菲租房：发现钱太多，花不完，所以我就决定再租一套，周末上来，度个假。——《爱情公寓4》</p><p>130、一菲：我只听说过黑化肥挥发会发灰，没听说过催化肥挥发会发臭的啊！——《爱情公寓4》</p><p>131、关谷：张伟，你还是出去晒晒太阳吧，晒的再黑一点，就没人说你是白痴了。——《爱情公寓3》</p><p>132、一菲：哎，还不知道是男孩还是女孩，所以还不知道你是做奶奶还是外婆。——《爱情公寓3》</p><p>133、小贤：你知道最气人的是什么吗？不是对牛弹琴，是一群牛对着你，弹硬币！——《爱情公寓3》</p><p>134、子乔：所谓教材，就是把一个简单易懂的名词扩写成为一堆谁也看不懂的a href=&quot;http://www.jiyifa.com/juzi/&quot;target=&quot;_blank&quot;&gt;u&gt;句子。——《爱情公寓3》</p><p>135、小贤：说什么，这个时候你不会打算说个笑话给她听吧，那你就真成了笑话了。——《爱情公寓3》</p><p>136、子乔：又是惊喜，你忘了上次张伟都被你吓得脑溢血了吗，你看，吓得都穿越了。——《爱情公寓3》</p><p>137、子乔：稀奇的是关谷的朋友居然是个比例失调的怪蜀黍，而且穿衣服的品味很差。——《爱情公寓3》</p><p>138、丽萨：你猜我还要告诉你几个好消息？（此处省略）猜猜嘛，猜出来我两个都告诉你。——《爱情公寓3》</p><p>139、小贤：这次涉险过关我总结了三大成功要素：第一，坚持第二：不要脸第三：坚持不要脸。——《爱情公寓3》</p><p>140、悠悠：麻烦前头听歌的同学告诉中间说话的同学安静些，不要影响了后头睡觉的同学。——《爱情公寓3》</p><p>141、张伟：一只被五花大绑的螃蟹，从十八块六的冰柜里，往二十八块六的冰柜里爬，我泪流满面啊。——《爱情公寓3》</p><p>142、小贤：这一刻，我虽然被雷得外焦里嫩但仍有一股暖流涌上心头。我想说，一菲，你终于吃对药了。——《爱情公寓3》</p><p>143、子乔：四个字，简单粗暴、不择手段、釜底抽薪、瓮中捉鳖、一马当先、先发制人、方能无往而不利。——《爱情公寓3》</p><p>144、黄宝强：请记住我的成功秘诀：多读书，多看报，少吃零食，多睡觉。神乎其技的选择，我行，你也行！——《爱情公寓3》</p><p>145、美嘉：你要给你的对手迎头痛击，这才是一个男人该做的，而不是躲在这里看什么，如何控制对分娩的恐惧？——《爱情公寓3》</p><p>146、关谷：你也可以找个人陪你去私奔啊，然后一起，浪迹天涯，到一个，鸟不生蛋的地方，过着衣不蔽体的生活。——《爱情公寓3》</p><p>147、张伟：没有人再为天空涂满蓝色，没有人再为小鸟勾勒翅膀，没有人再让阳光探出乌云，没有人……看正版了。——《爱情公寓3》</p><p>148、小贤：一个完美的男人，应该处处体现出风度和修养。凡事从对方的角度出发，不经意间展现出对你的了解和关怀。——《爱情公寓3》</p><p>149、美嘉：行了，你是在暗中保护自己心爱的女人吧！</p><p>小贤：（贱笑）瞎说什么实话。——《爱情公寓3》</p><p>150、一菲：你现在就像一个迷恋不良少年的十六岁少女。</p><p>展博：不是少年，是大叔。——《爱情公寓3》</p><p>151、小贤：看到了吧，无可替代，无懈可击，无与伦比的好男人，就这么愉快的决定了，撑场面这么有技术含量的活，舍我其谁啊。——《爱情公寓3》</p><p>152、小贤；诚挚推荐，金山词爸自动翻译，能把任何语言翻译成中文，虽然结果中国人外国人都看不太懂，但学术论文不都这样的吗。——《爱情公寓3》</p><p>153、一菲：不如我丢个硬币帮你算一卦吧，正面，你被她搞定，反面，她把你搞定，如果硬币站在地面上，你就全身而退，怎么样？——《爱情公寓3》</p><p>154、邮件：一生之中寻寻觅觅，能够如此这般默契，有你有你我们一起难忘的周末，像温暖的光，照亮了生活，四人行，从此永远不寂寞~——《爱情公寓3》</p><p>155、子乔：男人要肾好，就要喝肾宝，喝了以后，比刘翔快，比姚明高，一瓶提神醒脑，两瓶永不疲劳，三瓶长生不老，噢，耶！肾宝，味道好极了！——《爱情公寓3》</p><p>156、小贤：九十岁老太为何起死回生，数百头母猪为何半夜惨叫，女生宿舍为何频频失窃，超市方便面为何惨遭黑手，在这一切的背后，是人性的扭曲，还是道德的沦丧，敬请关注明天的，小贤有话说，好男人就是我，我就是，曾小贤。——《爱情公寓3》</p><p>157、一菲：哼，你就继续在你平庸的人生路线上走下去吧。我的学员一定不会让我失望，他们会用一场酣畅淋漓的胜利来践踏你那猥琐的人生观的。——《爱情公寓2》</p><p>158、小贤：人生是一场单程的旅行，即使有些遗憾，我们也没有从头再来的机会，与其纠结无法改变的过去，不如微笑着，珍惜未来，因为生活，没有如果。——《爱情公寓3》</p><p>159、悠悠：现在行人不能输在斑马线上，孩子不能输在起跑线上，学生不能输在分数线上。</p><p>关谷：村姑不能输在针线上，女人不能输在曲线上，男人不能输在事业线上。——《爱情公寓3》</p><p>160、子乔：肤白貌美，城市口音，热情奔放，收入丰厚，花钱大方，没心没肺，不怕蟑螂，接受整容，长生不老。关键是，她还擅长各种版本的，飞行棋。——《爱情公寓3》</p><p>161、小贤：我以为我是上帝，可以安顿自己，还可以普度众生。可是到头来，却是一场空。我没有帮你们实现愿望，对不起。（后面无语）我不是上帝，是寂寞。——《爱情公寓3》</p><p>162、子乔：钱可以买到房子，但是买不到家；可以买到婚姻，但是买不到爱情；可以买到钟表，但是买不到时间，钱不是一切，反而是痛苦的根源。把你的钱给我，让我一个人承担痛苦吧！——《爱情公寓3》</p><p>163、一菲：这个艾派德有着子乔的硬件，还有关谷的软件。一张桃花泛滥的脸，加上悲催的中文发音，而且也是个画家。</p><p>小贤：这样子也可以啊，难道说现在已经有这样的高科技，可以按照人的需求来定制男朋友？我也要定制……我是说，女朋友……——《爱情公寓3》</p><p>164、小贤：这个故事告诉我们，不要不待见别人，因为，你也可能被别人不待见；反过来，不要因为被别人不待见而气馁，因为，你也可能随时不待见别人。正是因为我始终坚信这一点，所以，才活到了今天。——《爱情公寓3》</p><p>165、美嘉：小心眼+大话精+牛角尖+暴力狂。</p><p>悠悠：那简直就是个……</p><p>美嘉：完美情人。</p><p>悠悠：精神病人——《爱情公寓3》</p><p>166、悠悠：你攒够四块五，我也攒够四块五，我们就可以去民政局登记了。然后我们生个小宝宝，名字我都想好了，叫“好帅”，那别人看到你就会说：“好帅的爸爸！”——《爱情公寓2》</p><p>167、羽墨：28岁怎么了，我最痛恨的就是年龄歧视！黄忠六十跟刘备，德川家康七十打天下，姜子牙八十为丞相，佘太君百岁挂帅，孙悟空五百多岁西天取经，白素贞一千多岁还下山谈恋爱呢！——《爱情公寓2》</p><p>自从王菲和李亚鹏离婚之后，便有不少网友惊叹——“我再也不相信爱情了！”其实，爱情本身就不一定是天长地久，长相厮守的陪伴，也许轰轰烈烈过一起大风大浪过，才发现原来还不是那个对的人。分手已是常情，意料之中的事了。</p><p>不过看了这些分手狠话签名，你再问问自己是否还相信爱情吧，我真心是累觉不爱呢！</p><p>——写在前面</p><p>1、真对不起，在认识你之前我就知道自己患有艾滋病。不是故意骗你的，分手吧！</p><p>2、分手吧，我不知道今天和你分手我会不会后悔，但是如果有一天我再来找你，你就让我滚！</p><p>3、我当初怎么会看上你？胡子那么长，胸那么小。生活能力那么差。妈的！</p><p>4、我很爱你，但只是曾经。</p><p>5、我还是想问你一句再分手，你是个人尽可夫的女人吗？</p><p>6、分手吧，不过我一直有个疑问：世界上第一个知道你是笨蛋的人，到底对你做了什么啊？</p><p>7、祝福你，以后会更幸福，我现在已经找到幸福了。</p><p>8、个人觉得，应该是从没爱过你，对不起，玩你的！</p><p>9、第一次哭是因为你不在，第一次笑是因为遇到你，第一次笑着流泪是因为不能拥有你！</p><p>10、有些失去是注定的，有些缘分是永远不会有结果的，爱一个不一定会拥有，以后要是拥有一个人就一定要好好去爱他……</p><p>11、就算，眼前的这个男人，千般好，万般好，处处是优点，我不爱你，这个缺点，你永远改变不了。</p><p>12、分手了，心已死，泪已干，不堪回首魂亦牵，梦惊醒，不了情，往事如烟挥不去，亦虚亦实，亦爱亦恨，叶落无声花自残。</p><p>13、我不爱你。好比生活像忐忑，没有准确的歌词，却惊心动魄。对不起。</p><p>14、世界上没有任何东西可以永恒。如果它流动，它就流走；如果它存着，它就干涸；如果它生长，它就慢慢凋零。我们的爱情也是一样。</p><p>15、如果，不幸福，如果，不快乐，那就放手吧；如果，舍不得、放不下，那就痛苦吧。</p><p>16、脸上的快乐，别人看得到。心里的痛又有谁能感觉到。</p><p>17、让女人念念不忘的是感情，让男人念念不忘的是感觉。可是我们彼此都没有什么好留念的。</p><p>18、分手后不可仪做朋友，因为彼此伤害过，不可以做敌人，因为彼此深爱过，所以我们变成了最熟悉的陌生人。再见，陌生人。</p><p>19、如果有一天，你说你想我了，我会对你说：晚了。再见！</p><p>20、人与人之间的相遇就像是流星，瞬间迸发出令人羡慕的火花，却注定只是匆匆而过，就像我和你这般。</p><p>21、有些的时候，正是为了爱才悄悄躲开，躲开的是身影，躲不开的却是那份默默的情怀。</p><p>22、都说恋爱的人智商为零，但我看结过婚的男人智商为负数！我不想因为你而变这样！</p><p>23、我总是最珍贵你。爱到分才显珍贵，很多人都不懂珍惜拥有，只到失去才看到，其实那最熟悉的才是最珍贵的。</p><p>24、一辈子只有一个女人，并不丢人。可是如果是你，我会觉得很丢人。</p><p>25、带着你的贱人、离开我的世界！我成全你们不要脸的幸福。</p><p>26、多谢你的绝情，让我学会死心……</p><p>27、你走的那天没，我决定不掉泪，迎着等撑着眼帘用力不眨眼……</p><p>28、当眼泪流下来，才知道，分开也是另一种明白。</p><p>29、回家的路上我哭了，眼泪再一次崩溃了，无能为力这样走着，再也不敢骄傲奢求了。我还能够说些什么，我还能够做些什么？我好希望你会听见，因为爱你我让你走了……</p><p>30、不要轻易说爱，许下的承诺就是欠下的债！欠你的我来世再还。</p><p>31、如果爱上，就不要轻易放过机会，莽撞，可能使你后悔一阵子，怯懦，却可能使你后悔一辈子。</p><p>32、爱，在感情上，当你想征服对方的时候，实际上已经在一定程度上被对方征服了。首先是对方对你的吸引，然后才是你征服对方的欲望。</p><p>33、不敢说出口，因为我胆小，因为如果你拒绝，我以后就不能够再见到你了，宁愿默默的爱着你，不能让你知道，直到，直到你投进别人的怀抱！</p><p>34、一个人身边的位置只有那麽多，你能给的也只有那麽多，在这个狭小的圈子里，有些人要进来，就有一些人不得不离开。现在是你离开的时候了。</p><p>35、你没有资格也没有条件做我的另一半，你是我长这么大以来第一个感到厌恶的人。</p><p>36、分手了，对男人说：你太穷了，养不起我！对女人则说：你太丑了，配不起我！</p><p>37、我跟你在一起你连最原始的快乐都给不了我，我们分手吧……</p><p>38、一段不被接受的爱情，需要的不是伤心，而是时间，一段可以用来遗忘的时间。一颗被深深伤了的心，需要的不是同情，而是明白。</p><p>39、没可能，世界末日你也没有任何机会！（网）</p><p>40、就算将整个浴缸的水倒出，也无法浇熄我对你恨的火，我们分开吧。</p><p>41、早知如此绊人心，何如当初莫相识。</p><p>42、我不想再珍惜你了。在爱的世界里，没有谁对不起谁，只有谁不懂得珍惜谁。</p><p>43、自我催眠其实很不错，不信你试试：我们要分手，我们要分手！</p><p>44、个人觉得，应该是从没爱过你，对不起，玩你的！</p><p>45、有些人说不出哪里好，但就是谁都替代不了！可你一点也不好。</p><p>46、跟你在一起很累，跟她在一起很舒服！我们不可能了，对着你就想起我前女朋友，我累了，不想再和你这傻子玩下去了。</p><p>47、我知道这世上有人在等我，但我不知道我在等谁，为了这个，我每天都非常快乐。起码我不是在等你，分开吧。</p><p>48、有谁不曾为那分手而痛苦？我们总以为那份痴情很重，很重，是世上最重的重量。有一天，暮然回首，我们才发现，它一直都是很轻，很轻的。我们以为爱的很深，很深，来日岁月，会让你知道，它不过很浅，很浅。最深和最重的爱，必须和时日一起成长。</p><p>49、既然不合适就别再硬着头皮走下去，我从没有耍过你，希望你能释怀，以后别再介入我的生活！</p><p>50、你只是我的备胎，何必太认真。如果你觉得放不下，那我向你说声对不起，很对不起，你一定要坚强啊，做个坚强的男孩（女孩）。</p><p>每一位女生对于别人来说都是一本难懂的书，每一位女生都有自己小小的天地，小情绪很多，若不懂得宣泄，一味放在心里，只会使自己变得更加忧郁和悲伤。其实我们那些情感、故事都会慢慢被时光风干，成为过去的一份子。而女生们需要做的只是调整好心态，大步向前走，做个朝阳明媚的女子，才会更有气质和修养。这些女生的个性签名，可爱中带着淡淡忧伤，送给你们！</p><p>——写在前面</p><p>1、有的歌，唱的是别人，但却听出了自己。</p><p>2、我预料到后果但还是放手一搏，赌注是我的痛苦，奖品是你的幸福。</p><p>3、你说过即使我犯错了你也会原谅我，不管任何你都会原谅我。</p><p>4、我有多温柔只怕你无福消受。</p><p>5、看着你的头像多想找你说句话可是却不知道说什么。</p><p>6、我的恋人无需旁人来评论竟然是我最爱的便是在我心中最好的。</p><p>7、祝你多年之后死于心碎只因思及于我。</p><p>8、让我成为你的有可能。</p><p>9、你有没有一个四人帮：一个很闷骚一个很二逼一个很傻很执着一个很霸气！</p><p>10、太主动的女孩在男孩的眼里是不是显得很轻浮？</p><p>11、他不理不睬不相信他不管不顾不解释他不闻不问无所谓。</p><p>12、你把我推去谷底掉下去摔得我粉身碎骨你很满意啦吗？</p><p>13、不曾站在原地守候的人不会懂得站久了双腿都无法弯曲的滋味。</p><p>14、你不知道我有多羡慕那些每天能见到你的人能听到你声音的人能跟你说话的人。</p><p>15、我老妈说了不让我和搞对象的人一起玩儿如果让她发现了就告诉我们的班主任。</p><p>16、难道要我九十度鞠躬来感谢你的残忍吗。</p><p>17、别说我变了，直接说你厌倦了。</p><p>18、因为喜欢你就算你放荡不羁说话又刻薄可我就是喜欢你。</p><p>19、我想和自己最爱的人一起过年。</p><p>20、看错很多与你相像的背影只是太想念不要怪罪于我。</p><p>21、我脾气不好天生多疑不好相处所以趁你还没后悔跑着离开我吧</p><p>22、“媳妇是什么？”“空气。”“空气是什么？”“我的命。”</p><p>23、希望，圣诞老公公能在圣诞夜，把各科期末考试答案塞到我床头的袜子里。</p><p>24、呵呵，毕竟你我曾经情深似姐妹。</p><p>25、妈妈是个美人，岁你别伤害她。爸爸是个超人，时光你别打败他。感恩父母。</p><p>26、对不起，没长成你想要的样子。</p><p>27、当天堂已远，我陪你去地狱猖獗。</p><p>28、每个人的生命中，都有一个刺青爱人。</p><p>29、树叶凋落，是风的追求，还是树不在挽留。</p><p>30、真正的爱情不会败给距离不会败给金钱不会败给流言蜚语。</p><p>31、一个暗恋你年的人突然对你说“我放弃了”，会是什么滋味。</p><p>32、如果我哪天放弃了，请记得，是因为你的不在乎。</p><p>33、BY我要做你的伴娘，即使不能和你结婚也可以和你站在同一个婚礼上。</p><p>34、失去的别名叫做曾经拥有。</p><p>35、如果说我懂的道理比别人多一些那是因为我犯的错误比别人多一些。</p><p>36、谢谢你喜欢我，我也很喜欢当年那个喜欢你的我</p><p>37、如果你真心爱上一个人，你会发现自己再也骄傲不起来。</p><p>38、是我没有你要的成熟。</p><p>39、你以为你对他来说很特别，却不知道他对每个人都这样。</p><p>40、青春就是疯狂的奔跑，然后华丽地跌倒。</p><p>41、我只有一份爱，要么不付出，要付出，就是全部。</p><p>42、我最害怕的事情就是，我最珍惜的人，爱上了我最爱的人。然后我笑着祝福他们。</p><p>43、最美的时光，暗恋一个人的时光。</p><p>44、别认为自己百毒不侵，你没那么多命。</p><p>45、我承认我没那么坚强，只是一而再的逞强。</p><p>46、现在只希望上课能听懂，作业能写完，睡觉不抽筋，生活可平静，你不忘记我。</p><p>47、爱你是我的专利，看谁敢做非法的勾当？</p><p>48、你给了我背叛就别指望我给你谅解，做了狗就别指望我还把你当人看。</p><p>49、你连她说谎的样子都爱了我连你爱她的样子都爱了这样爱你够不够。</p><p>50、谢谢你一直都在，谢谢你一直陪伴着我，谢谢你能跟我分享你的喜怒哀乐。</p><p>51、、以心换命好么，I&#39;ll let you have the freedom you want.</p><p>52、保持微笑，继续我的骄傲！</p><p>53、我那么好哄，可惜你就是不会。</p><p>54、因为喜欢你所以偶尔喜欢跟你唱反调这种感觉太美妙。</p><p>55、表面装得无所谓，心里却疼得要命。不就是死要面子活受罪么！</p><p>56、很多时候因为得不到所以假装不想要。</p><p>57、我的朋友，请你替我好好照顾我的好朋友，虽然你已经代替了我的位置。</p><p>58、得不到并不可怕守不住才是个笑话。</p><p>59、-我将要拥住你，抚媚阳光直射我双眼！</p><p>60、不见面也有不见面的好，你永远是我记忆中的样子。</p><p>61、女孩的美梦不止一个。</p><p>62、美的时光，暗恋一个人的时光。（网）</p><p>63、如流泪可以震撼你乐意哭到令你欢喜。</p><p>64、心甘情愿在你背后默默付出，只是为了你能回头说句“对不起，忽略了你那么多年”。</p><p>65、女人身体阴冬天怕冷怕寂寞如果有喜欢的女孩不要让她冻着寂寞着。</p><p>66、百毒不侵的女汉子哪个以前不是心软成病。</p><p>67、我多喜欢下雪我多想自己和你一起接下今年的第一片雪花！</p><p>68、以后很多东西都会面目全非，所以我珍惜现在，也许你会是我人生中最大的遗憾，但我始终谢谢你来过我的世界。</p><p>69、如果敌人让你生气，那说明你还没有胜他的把握，如果朋友让你生气，那说明你仍然在意他的友情。</p><p>70、现在的我，很相信顺其自然。</p><p>71、别想尽办法摧残我的心，那里面可住的是你。</p><p>72、闺蜜就是在最后会离开你的人，最后真真正正留下来的或许另有其人。</p><p>73、-我即将拥住你，抚媚阳光直射我双眼！</p><p>74、爱都最后，莪们都苍老了。</p><p>75、不要埋怨总是疑心的人，体会他们曾经总是太容易相信别人。</p><p>76、你就那么爱她那你就带她滚出我的世界里。</p><p>77、有朝一权在手，杀尽天下负我狗！</p><p>78、如果你真心爱上一个人，你会发现自己再也骄傲不起来。</p><p>79、我与你最近的距离就是跑操时与你擦肩而过的一瞬间。</p><p>80、我喜欢你，喜欢到好像这样轻轻一闭眼，就能过完一辈子。</p><p>81、爱就是赋予了一个人伤害另一个人的权利。</p><p>82、总是用热情洋溢去回应期待仰望，温暖过多少人的灰心沮丧。</p><p>83、我一个人又不是不行我从来都强悍的不用人担心。</p><p>84、你永远无法叫醒一个装睡的人，就像你永远都不能感动一个不爱你的人。</p><p>85、我会一直喜欢你，直到被你伤害的没了力气。</p><p>86、不知道什么人是对我真心。</p><p>87、谢谢你无情，让我学会狠心，是一场教训，一场经历，一场游戏。</p><p>88、我们曾经为自己幻想过多少个美好的未来，结果呢，却没有你想像的那么完美。</p><p>89、你不问我不说这就是距离你问我不说这就是隔阂你问了我说了这就是信任你不问我说了</p><p>90、好朋友大概就是会在面前死命损你，又会在背后拼命维护你的人吧。</p><p>91、若没有滴水穿石寂寞的洗礼那是喜欢不是爱不刻骨铭心。</p><p>92、女人只会欺负对她好的男人因为她知道即使他再委屈也不会离开她。</p><p>93、原本是抱着期望，结果是伤心失望</p><p>94、我也需要关心需要爱需要陪伴需要有人在我难过的时候说我在。</p><p>95、当你发现，有人把你名字写在签名里，真的会很温暖。</p><p>96、深情既是死罪又怎怕挫骨扬灰。</p><p>97、流言是什么？流言就是一个有份量的人的评价被一群三八拿来不断地复述。</p><p>98、疼到骨子里的那种感觉你懂吗别说感同身受也别说身临其境。</p><p>99、女人只会欺负对她好的男人因为她知道即使他再委屈也不会离开她。</p><p>100、全世界都可以是你顾里的但你只能是我的。全世界都可以背叛我只有你不可以因为你是顾源。</p><p>心似双丝网，中有千千结。</p><p>都说人生如梦，但我们都活在梦中，难以自拔。梦境里有青山绿水，有鸟语花香，当然也免不了面临深渊恶谷、险象环生，认真的人难免受伤。伤过，痛过之后，悠悠愁绪化作静水深流。你是否如受伤的小兽般，躲在时光的缝隙里，独自舔干心上的血痕？</p><p>心伤了，有谁懂？你的寂寞说给谁听？有时候，我们就像鱼缸里的鱼，想说的很多，一开口就化成了一串省略号。心这东西殇了多少人，凉了多少意，薄了多少情！任时光荏苒，岁月匆匆，让时光的水，在静默中冲淡记忆的苦茶。</p><p>1、风和日丽，天空游荡着几许琉璃。望着云端那一抹淡蓝，仿佛千年的哀愁刹那间消散，万年的孤寂染上了色彩。</p><p>2、最初是谁伤了谁的心，如今又是谁忘不了谁。曾经是谁说那么坚定的誓言转身却轻易的放开。</p><p>3、有过的期待，有过的感动，竟然在泪花竞放时，忘却了美丽的姿态。</p><p>4、记忆的痛点就像那些追逐落魄感性的文字一样，断了线的情丝却还那么直白。</p><p>5、风干的岁月，永恒的止殇，孤独的行程，渐行渐远模糊着视线。</p><p>6、泪，叭叭嗒嗒直掉下来，每一次落地的音符，点点滴滴最伤情，乱了风吹的声音，碎了桃花朵朵艳，痛了多情柔柔心。</p><p>7、明月多情应笑我，笑我如今，落魄之间，伤春伤别离。</p><p>8、夕阳的残骸散落在流年里，缱绻成一曲地老天荒的悲歌。</p><p>9、樱子，樱花，终究淡去。葬了那红尘三千。葬了那破碎的心。葬了那段情。</p><p>10、欲诉无言，今生竟如此的凄惨，清冷里注定无缘相见，唯有一别如斯，落尽梨花月又西的感叹！</p><p>11、过程在风中随着落叶，飘洒在空中，直到落地；结局在迷雾中变得无名，找不到方向。</p><p>12、每个人的青春，终逃不过一场爱情。在这里，有爱，有情，有喜，有乐，却单单没有永恒。</p><p>13、没有正式的告别，我们匆匆分开，犹似两条仅有一个交点的直线，再没机会存在交集。</p><p>14、静水流深，沧笙踏歌；三生阴晴圆缺，一朝悲欢离合。</p><p>15、人生是一片悲凉的海，愤怒的拍打着海岸，你是海中的一片帆，总是抚平我的悲伤！</p><p>16、幸福就像小偷，来的时候静悄悄，走的时候才知道损失惨重！</p><p>17、拈一抹过往，剪一窗岁月，掸一路灰尘，望一涯征程，淡淡领悟，缤纷岁月静好的沉香。</p><p>18、寂寞就是你说话时没人在听，有人在听时你却没话说了！</p><p>19、到不了的都叫做远方，回不去的都叫做过去，不回头的都叫做别离。</p><p>20、多希望死亡只是身上的一个按钮，一按即去，不痛不痒。</p><p>21、一如既往，只有我的叹息，苦苦寻觅，再多的执着终究一场枉念而已，我们的故事，终究没有完美的结局。</p><p>22、我们在同一片沙漠里，在寻找的也许是同一眼泉水，但却相互看不见，总是孤零零的一个人。</p><p>23、缘分天注定，很多时候，你我在红尘中总是擦肩而过，彼此的回眸，却没有换来哪怕是片刻的驻足停留。</p><p>24、躲在某一时间，想念一段时光的掌纹；躲在某一地点，想念一个站在来路也站在去路的，让我牵挂的人。</p><p>25、看着镜子反射的倒像，憔悴得不相信是自己。冲一杯清茶，伫立窗前，凝望着黑夜，试图寻回那久仰的睡意。</p><p>26、冰冷的情，刺骨的伤，无解的恋，看似冷漠的爱情杀手，谁知原是曾被伤透，才成如今这般模样。</p><p>27、我不管在草长莺飞的暖季，也不管在冰天雪地的海天一角有没有我的身影。我只是执意存在于你身边的一只流萤，肆意为你扑闪着最微弱的欢喜。</p><p>28、一些人在这里徘徊，一些人在这里守望，或找寻一个可以在烟尘里携手日落的归人，或缅怀一段走了一半又折回的地老天荒。</p><p>29、让我站在心碎的地方，轻轻打一个结，一种缝补，阻止伤痛再流出。</p><p>30、谁的眼角触得了谁的眉；谁的笑容抵得了谁的泪；谁的心脏载得住谁的轮回；谁的掌纹赎得回谁的罪。</p><p>31、你只是把我当作渡口，借我度过寂寞荒凉的时光。</p><p>32、谢谢你给的痛，让我至今都难忘，每一寸都是为了我量身定做</p><p>33、月照深庭顾影单，云牵花袄斥风顽。疏枝舞在东篱下，画笔魂游陋室前。</p><p>34、我的空虚，裹着悲悯，裹着寂寞，终是流血了，流的竟是青春，仅是青春。</p><p>35、雨是云伤心的眼泪，心总是在乌云密布时孤寂，流下的是一阵阵心雨。</p><p>36、相思树，流年渡，无端又被西风误。人憔悴，只为谁，红叶流水不相随。</p><p>37、梦里无痕几回首、相思有情泪无价。欲相守、难想望，人各天涯愁断肠。</p><p>38、上天派你灿烂的笑靥走渗入渗出我阴沉的梦境，是为了打破我阴雨中发霉的寂寞！</p><p>39、我独坐自己的四角天地，静享这一份安宁，指尖流淌着如烟的思绪，沉醉在那些不曾忘却的往事中，恍如隔世。</p><p>40、左眼没有见过右眼一面，不懂安慰只懂陪它落泪。</p><p>41、有的人把心都掏给你了，你却假装没看见，因为你不喜欢；有的人把你的心都掏空了，你还假装不疼，因为你爱。</p><p>42、有一种爱，明明是深爱，却说不出来。有一种爱，明明想放弃，却无法释怀。有一种爱，明知是煎熬，却又躲不开。有一种爱，明知无前路，心却早已收不回来。</p><p>43、人生若只如初见，何事秋风悲画扇。等闲变却故人心，却道故人心易变。</p><p>44、忧思在我的心里平静下去，正如暮色降临在寂静的山林中。</p><p>45、跳舞着的流水呀，在你途中的泥沙，要求你的歌声，你的流动呢。你肯挟瘸足的泥沙而俱下么？（网）</p><p>46、在生命的岁首年终，忧愁欢乐、争吵和好、冷战甜蜜，都是你们的故事。相互扶持着演绎真情，原来一辈子也是快得白驹一逝。</p><p>47、一年又一年，几许沉淀，几许感触，有几许温暖，也有几许薄凉，都是不经意间，有些人，有些事也都在不经意间…成了习惯…</p><p>48、爱情就是一场赌局，赢了，厮守一生，白头到老。输了，全盘皆输，那比朋友更近的人，就是熟悉的陌生人。</p><p>49、爱情、是一场梦、而我总是睡过头。</p><p>50、时间流走，纵然你如何追赶他的脚步，他也已无情，将你丢弃在岁月的轮回里。走过春夏，步入秋冬，你说人生已近尽头，黄土在数算着日子。人老了，回忆悄无声息地入侵，拂过一面凉风，痒痒的，骚动平静的心海，记忆便不可制止的蔓延开了去。</p><p>51、那时间的沙漏慢慢地把未来一点点风蚀成回忆，等到了风烛残年之时，只有满揣记忆那汪洋的清水，直至在手中流失殆尽，等待着坠入无尽的黑暗。</p><p>52、岁月苏醒在泛黄的照片里，多少年轮编织了多少皱纹，创业的艰辛、奋斗的青春、生活的劳苦，你如数家珍一并倾泻于我，那是你无人分享却引以为豪的寂寞。</p><p>53、来不及抹去秋的忧伤，寂寞的雪花又在拍打着我的凄凉。或许是岁月过于匆忙，几十年光阴似箭，瞬间便成了过往。来不及告别，顾不上回想，逝去的路漫漫，未来的路茫茫……</p><p>54、当夏天失去了如火的热情，迎接它的只有萧索的秋风，再繁茂的枝干也挽救不了落叶的飘零。</p><p>55、用微笑点缀凄凉，快乐包装过往，装订成册的岁月，道道折痕，却跃然于心上。</p><p>56、梦如风的行进，残雪孤独，野草疯长。</p><p>57、人的心只容得下一定程度的绝望，海绵已经吸够了水，即使大海从它上面流过，也不能再给它增添一滴水了。</p><p>58、没有什么过不去，只是再也回不去。要有多坚强，才敢念念不忘。你是我猜不到的不知所措，我是你想不到的无关痛痒。感情的戏，我没演技。一个人，一座城，一生心疼。</p><p>59、星空月下几人醉，别问来是相望约，知下画面多少载，轻声稳步少年梦，一遇贺别未来逢，万般秀语心灵见，约下逢景醉逢声。</p><p>60、净化的美景，漂泊在内心的角落，敲打着心情的醉意，感知的问答，思绪的循环刻入，如此的深情，如此的吻合着谎称的改变，是问，念从此漂泊，是泪，梦从此循环。</p><p>61、泪倾诉，心悲苦，温柔的放肆，聚集在情的路上，撒下阳光般的保护，是念在心中升起了明媚的海霞，还是梦中约的如此刻骨，却无情的标注了相思的布局。</p><p>62、留一颗禅心，让不该留下的悲伤消失在炎热的空气里，看一朵花开，找一段快乐的音乐，寻一季花落，看一世美丽的年华。</p><p>63、明白了送别的感知，吻别了醉人痕迹，搭起脆弱的痕迹，漫步在伤痕的步伐上，走出了无言的缘，感知了来世的约，逢在悲中聚，伤在感中散，是美丽的彻底，还是痛彻的干脆，一切的慰问标出了景中的美，却不能秀出心灵的话语。</p><p>64、生命很残酷，用悲伤让你了解什么叫幸福，用噪音教会你如何欣赏寂静，用弯路提醒你前方还有坦途。</p><p>65、曾经以为世上最残忍的无非两个词：美人迟暮，英雄末路。那句被引用过无数次的a href=&quot;http://www.jiyifa.com/juzi/&quot;target=&quot;_blank&quot;&gt;句子说：悲剧是把美好的东西打碎给人看，而在美丽与力量都到达极致之后，在辉煌的姿态里转头就被时间摧枯拉朽，愣愣看着白玉成石，宝剑化藤，便连悲剧也算不上，只是让人笑不出也哭不了的涩剧。</p><p>66、爱本来就是残忍的，胜者为王。感情可以转帐，婚姻可以随时冻结，激情可以透支，爱情善价而沽。是的，在这细小的都市里，这就是我们的生活。今天的长相厮守，只是尽力而为而已。最安全和最合时宜的方式，还是和自己厮守。</p><p>67、爱是一场催眠，醒来之后你被谁吸了灵。这就是为什么爱过之后，总觉得不仅失去他，也失去了一部分自己。被爱的人总是掌灵者，去爱的人反而失魂。在每段真心付出的感情中，总有一个人献祭了灵魂，收获了残忍。</p><p>68、我欲举杯邀明月，对酒当歌，人生几何？人生之路苦短漫长，红尘琐事千般无奈，何人可以看破红尘，何人可以纵横人世，何人可以快意恩仇，何不洒脱的走自己的路，无论坎坷，无论风雨，豪情抒写人生的喜怒哀。</p><p>69、你的到来，似风儿吹皱心湖，激起涟漪无数，你的离去，似一滴泪水落进心湖，淡而不化。</p><p>70、一个人会落泪，是因为痛；一个人之所以会痛，是因为在乎；一个人之所以会在乎，是因为有感觉；一个人之所以有感觉，仅因为你是一个人！所以，你有感觉，在乎，痛过，落泪了，说明你是一个完整的不能再完整的一个人。难过的时候，原谅自己，只不过是一个人而已，没有必要把自己看得这么坚不可摧。</p><p>71、面对，不一定最难过。孤独，不一定不快乐。得到，不一定能长久。失去，不一定不再拥有。不要因为寂寞而错爱，不要因为错爱而寂寞一生。</p><p>72、能够慢慢培养的不是爱情，而是习惯。能够随着时间得到的，不是感情而是感动。所以爱是一瞬间的礼物，有就有，没有就没有。但反过来说，爱和婚姻实际不是一回事，并不是所有的爱情都要结婚的，也不是所有婚姻都有爱情。</p><p>73、在这个世界上，没有一个人真正可以对另一个人的伤痛感同身受。你万箭穿心，你痛不欲生，也仅仅是你一个人的事，别人也许会同情，也许会叹，但永远不会清楚你伤口究竟溃烂到何种境地。</p><p>74、不论悲欢，不管酸甜，过了，就是过了，有的只是心底那点记忆岁月考量的重心，或许就不在对错本身，生命在意的关键，或许就是错对的印痕，如果释放了错的烙印，谁还在乎心中的伤痛，如果，免去了错的烙印，谁不心宁。</p><p>75、有些事，明知道是错的，却还要坚持，因为不甘心；有些人，明知是爱的，却还要放弃，因为没结局；有时候，明知道没路了，却还要前行，因为习惯了。</p><p>76、他们说，别幼稚了。稳重一点。他们都说的没错，可是，我可不可以最后再重温儿时的快乐，然后丢弃那可童真的心，做大家都希望我做的，成熟而稳重的人，我一直想知道，倘若他们看到，那一刻，我如此快乐的表情，还会不断地催我成长，让我成熟吗？</p><p>77、对待爱人最残忍的方式，不是爱恨交织，不是欺骗背叛，而是在极致的疼爱之后，逐渐淡漠的爱。</p><p>78、在爱情里，总有一个主角和配角，累的永远是主角，伤的永远是配角；有时，爱也是一种伤害：残忍的人选择伤害别人，善良的人，选择伤害自己；人生就是一种承受，需要学会支撑。支撑事业，支撑家庭，甚至支撑起整个社会，有支撑就一定会有承受，支撑起多少重量，就要承受多少多大压力。</p><p>79、如果有一天，你要离开我，我不会留你，我知道你有你的理由；如果有一天，你说还爱我，我会告诉你，其实我一直在等你；如果有一天，我们擦肩而过，我会停住脚步，凝视你远去的背影，告诉自己那个人我曾经爱过。或许人一生可以爱很多次，然而总有一个人让我们笑的最灿烂，哭的最透彻，想的最深切。</p><p>80、每个人都有一个死角，自己走不出来，别人也撞不进去。我把最深沉的秘密放在那里。你不懂我，我不怪你。每个人都一道伤口，或深或浅。我把最殷红的鲜血涂在那里。你不懂我，我不怪你。每个人都有一行眼泪，喝下的冰凉的水，酝酿成的热泪。我把最心酸的委屈汇在那里。你不懂我，我不怪你。</p><p>81、我也有辛酸苦楚，不说罢了。我也有执念不放，不说罢了。我也有千回百转，不说罢了。我不是装傻卖乖，不说罢了。不是我未看见，不是我没想过，不是我不懂得，只是不说罢了。</p><p>82、常常会在不经意间想起曾经的某个人，不是忘不了，而是放不下。那些不愿再向任何人提起的牵挂，在黑暗的角落潜滋暗长。总是在不懂爱的时候遇见了不该放弃的人，在懂爱以后却又偏偏种下无意的伤害遇见某个人才真正读懂了爱的含义；错过了某个人，才真正体会到心痛的感觉。</p><p>83、你，一个最重要的过客，之所以是过客，是因为你未曾会为我停留。曾经在我人生中撒下欢乐的种子，之所以只是种子而不开花，因为你未曾为它浇水施肥。曾经划下我人生中的一根伤痕，之所以是伤痕，因为你未曾温柔的怜悯过。曾经给我一线的光明而瞬间带来全部的黑暗，之所以黑暗，因为你未曾想过为我照亮。</p><p>84、时间，让更深的东西越来越深，让浅的东西越来越浅，看得淡一点，就会伤的少一点，时间过了，爱情淡了，也就散了。——别等不该等的人，别伤不该伤的心。我们真的要过了很久很久，才能够明白，自己真正怀念的，到底是怎样的人，怎样的事。</p><p>85、痛过，才知道如何保护自己；哭过，才知道心痛过是什么感觉；傻过。才知道适时的坚持与放弃；爱过，才知道自己其实很脆弱。其实，生活中并不需要这么些无谓的执着，没什么就真的不能割舍。</p><p>86、有一天你会忘记我，投身于新的爱情放纵她的世界里；有一天你会有一个美丽的妻子，可爱的孩子；有一天你会忙碌在纷繁的人群中，忘记年轻时的梦想；有一天你会与我擦肩而过，但却辨认不出彼此；有一天你会偶尔想起我的名字，但却记不起我的模样；有一天你会终老于病房，到死都不再想起我……</p><p>87、有人告诉我鱼的记忆只有7秒，7秒之后它就不记得过去的事情，一切又都变成新的。所以，在那小小鱼缸里的鱼儿，永远不会感到无聊。我宁愿是一只鱼，7秒一过就什么都忘记，曾经遇到的人，曾经做过的事都可以烟消云散，可我不是鱼。无法忘记我爱的人，无法忘记牵挂的苦，无法忘记相思的痛……</p><p>88、我藏不住秘密，也藏不住忧伤，正如我藏不住爱你的喜悦，藏不住分离时的彷徨。我就是这样坦然，你舍得伤，就伤。</p><p>89、也许只是赌气，也许只是因为小小的事。幻想着和好的甜蜜，或重逢时的拥抱，那个时候会是边流泪边捶打对方，还傻笑着。该是多美的画面。没想到的是，一别竟是一辈子了。即使在同一个小小的城市，也不曾再相逢。某一天某一刻，走在同一条街，也看不见对方。</p><p>90、心的站台，回首之时，落花的碎沾满了尘埃。念，不知从何时开始，隔空此岸彼岸的辗转，独自悠然的绽放清瘦的凄美，合着落花粉碎的残红，一同融入苦海的天堂。黑夜的苍穹似乎无边，于是残楼高歌，镜花舞思，伊人独去夜楼空，落花月伴，欲寄离愁，且等谁回首？</p><p>91、邂逅的瞬间，我就站在你的面前，只是个陌生人。是浮华的化妆舞会，散场以后，一个落寞而黯淡的女子，烟花一样虚空的美丽。独自一个人在角落里笑着哭泣，不需要谁再来打扰属于我的宁静生活。</p><p>92、如果你出现在我面前，我会一动不动，安然自若的对你微笑。因为……装作不放在心上，是我少数充满自信的看家本领之一。</p><p>93、内心里未表达的话，都哽塞在喉间，想找到一个人倾吐诉说，然而被光明驱散了每一处黑暗，都是荒芜。</p><p>94、莫名的悲怆再次在心底徘徊着，夜，依旧还是那样的神秘，深沉；人，在黑暗之中，显得格外的那么苍白无力。未知的旋律又在耳边响起：是否，我真的一无所有？明天的我，又将会在哪里停泊？叶无语，西风又起，洒落一地孤寂，忧愁。闻，君莫思归。</p><p>95、我曾经以为不会讲完的故事，其实早就准备了物是人非的结局。我曾经以为不会散场的青春，只剩下写满告别的字句。我曾经以为那么重要的你，也可以心平气和地只放在回忆里。人长大了，就不再有那么多的义无反顾，我会很安静，很安静。</p><p>96、世界上最残忍的事，不是没遇到爱的人，而是遇到却最终错过；世界上最伤心的事，不是你爱的人不爱你，而是他爱过你后，最后却不爱你。</p><p>97、醉别西楼醒不记，春梦秋云，聚散真容易。斜月半窗还少睡，画屏闲展吴山翠。衣上酒痕诗里字，点点行行，总是凄凉意。红烛自怜无好计，夜寒空替人垂泪。</p><p>98、醉拍春衫惜旧香，天将离恨恼疏狂。年年陌上生秋草，日日楼中到夕阳。云渺渺，水茫茫，征人归路许多长。相思本是无凭语，莫向花笺费泪行。</p><p>99、有时候，很迷茫的去看前方，明明知道那片海没有你在，却还要固执的踏上火车去追逐那个有你不了解的爱，害怕总是真实的存在，精彩的孤单总是陪伴着我们终究该明白，不能再在原地徘徊，不能再固执的守着不会回来的，不能再挣扎着看着你的不精彩。</p><p>100、浮华一生，淡忘一季。空有回忆，打乱缠绵。笑容不见，落寞万千。弦，思华年。那些年华，恍然如梦。亦如，流水，一去不返。不泣离别，不诉终殇。</p><p>最沉重的悲伤是无法用言语表达的，若已能说出口，眼泪或已风干，心痛或已释然，何妨笑笑，看开。“莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕，一蓑烟雨任平生。”借用苏东坡先生的话，赠与天下失意、伤心人，祝君安好！</p><p>花言巧语不可靠，甜言蜜语却是美丽的爱情中不可缺的调味剂，肯花心思哄你开心的情人总是暖心的有心人，能恰到好处地表达爱的人也是个值得被爱的好情人。2014到了，从2013到2014陪在你身边的是谁呢？你们都是幸福的，于千万人中能遇见彼此，这是何等不易啊，而能够相知相爱，在这空旷的a href=&quot;http://www.jiyifa.com/tansuo/yuzhou/&quot;target=&quot;_blank&quot;&gt;u&gt;宇宙中温暖彼此，于两人而言，也称得上是一段传奇了。</p><p>爱，要勇敢地说出来，有些话不说也许能懂，但说了便是更确定的承诺了，又一年要来了，送给你的他或她最甜蜜的话吧，愿你们的爱情从13走到14，也能从一生走到一世，愿有情人终成眷属！</p><p>1、一边听雨，一边想你，雨声滴滴，淅沥淅沥。我的心是一条弯弯曲曲的小溪，千回百转，兜兜转转，最终都将流向你。不知道，你是否愿意，成为我的栖息地？</p><p>2、有你，有我，还有就是一双手，彼此，永远的走下去，一直走到天的边际，海的尽头。也许那时我老了，头发白了，人也不帅了，但是我的手不会松开，因为，我爱你。</p><p>3、这是开心的你O(∩_∩)O这是生气的你(?_?)这是睡着的你(～o～)~zZ这是脸红的你(<em>^__^</em>)无论怎样的你，都是我爱的你。</p><p>4、想你是一种甜蜜的忧伤，想你是一种酸涩的期待，想你是一种幸福的惆怅，想你是一种矛盾的向往！其实，有你，真好！爱是一种付出，即使痛苦也会觉得甘愿。爱是一种直着，即使心碎也会觉得无悔。</p><p>5、这一季，轻风摇曳，柔和的感觉在银沙里攒动，有条细细的丝带正卷开思念的海，我渴望凝视你的容颜，我期待你和我手牵，只想，把爱带到那片海，融化秋的凉爽，滴滴入怀……</p><p>6、爱你的三百六十五天，我体会到了爱情的甜蜜。幸福，真的可以很近，为了你，我改变了许多，也成长了许多，在爱的幸福国度，你就是我唯一。</p><p>7、我习惯你的呵护，习惯你的淘气，习惯你的温柔，习惯你的笑容，习惯你的声音，你就是我饥饿中的面包，黑暗中的灯泡，你就是我唯一的唯一。</p><p>8、爱你没商量，你的眼睛眨一下，我就死去，你的眼睛再眨一下，我就活过来，你的眼睛不停地眨来眨去，于是我便死去活来！</p><p>9、爱是一种感受，即使痛苦，也会觉得幸福。爱是一种体会，即使心碎，也会觉得甜蜜。爱是一种经历，即使破碎，也会觉得美丽。</p><p>10、片片尘埃铺展在撕碎的欢乐上，你长袖轻舞，就能扫去尘埃，重聚往日的欢乐，思念，若说这是梦，我愿是不醒的梦，因梦中有您，梦里有情！</p><p>11、牵手，是心有灵犀的感应，是风雨一起走的誓言；拥抱，是情到深处的彰显，是海枯石烂心不移的诺言；亲吻，是爱到浓时的甜蜜，是爱你一万年的约定；情长存，爱永久。</p><p>12、你最爱的花，我记下了，是玫瑰，我会送你；你最爱的季节，我记下了，是仲夏，我会陪你；你最爱的歌，我记下了，是爱如潮水，我会唱给你；你最爱的人，不用记了，一定是我，我会用心爱你。</p><p>13、你在我心中是最美，每一个微笑都让我沉醉。今生今世只将你追，你完全占据我心扉。让你幸福是我最大的安慰。亲爱的，每天亲吻你，消除我一天的累，今生愿与你同杯，共饮亲吻一世醉！</p><p>14、把柔情填在字里行间，把甜蜜写在心灵深处，把真爱刻在长生石上，把浪漫洒在时空隧道，把美好镶入幸福相框，把一切录入爱情日记。情定一生，挥洒浪漫，品味甜蜜，记录幸福，写下真心：爱你永不变！</p><p>15、有风，自然才显清凉；有水，溪流才显欢唱；有叶，花朵才显芬芳；有海，天地才显宽广；有你，生活充满阳光。宝贝，你是我心中的太阳！</p><p>16、风吹起如花般破碎的流年，而你的笑容摇晃摇晃，成为我命途中最美的点缀，看天，看雪，看季节深深的暗影。</p><p>17、我会等你，等你回心转意的那一天；我会等你，等你愿意和我在一起的那一天；我会等你，等你离开那个人来到我身边的那一天；我会等你，直到我老了那天！</p><p>18、你的心就是我的海角和天涯，我不能去得更远。我们此生共赴天涯海角，不是游走一个地球，而是人间相伴。</p><p>19、地球还在转呢，天空还会黑呢，风还是有点冷呢，我还是会想你呢，地球也会累吧，天空还会亮吧，风也许会停吧，我还是会想你吧，亲爱的，保重。</p><p>20、我生命里的所有时光，都因为你而变得多彩；我生命里的所有烦恼，都因为你而消失不在；有你在，就有快乐，就有希望，你是如此得让我爱。</p><p>21、不同的时光，不同的地点，语言都浅浅的写着和你有关的画面，相同的感觉，相同的笑脸，心情都影印着对你不变的爱恋，一句话，我爱你，两个字，永远。</p><p>22、笔蘸真爱墨染情，写不尽深深思念爱恋永恒；纸满柔情字满爱，言不尽甜蜜记忆情深意重。笔端流淌爱恋，字里凝结思念，爱你一生不变。将爱情进行到底，陪你到海枯石烂！</p><p>23、痴情真爱笔墨浓，写进你我梦境；体贴关怀字句暖，无声默契绕炊烟；相濡以沫互尊敬，我们爱到走不动。</p><p>24、打开爱情日记，寻找甜蜜回忆，满纸快乐时光，整页柔情蜜意，处处都是你的身影，句句都是相思印记，字字都是爱恋牵挂，篇篇都是浓情爱意。心里有你，笔下有你，愿与你一起创造美好未来，一世相依！</p><p>25、爱情的扉页，用甜蜜浇灌；心灵的感悟，用幸福堆砌；动情的文字，用柔情写就；浪漫的篇幅，用温馨营造。</p><p>26、爱，是相忘于江湖的知性，是情浓于水的真诚，是美人唇间莞尔的一笑，是海枯石烂的誓言，更是深锁在日记里的思念与回忆。爱，是我和你。</p><p>27、脉脉含情看着你，一心一意爱上你，比翼双飞陪着你，至死不渝护着你，心心相印念着你，花好月圆盼着你，海枯石烂等着你。</p><p>28、浪漫与温柔，在笔尖流动，用心绘画你的娇羞；思念与牵挂，在字间穿行，用情谱写爱的篇章；一字一句，是幸福的记忆；一言一语，是难忘的甜蜜。</p><p>29、浪漫的词组，不需要堆砌，也能描绘我们爱情的甜蜜；深情的字眼，不需要刻意，也能表达我对你的爱意；爱你的语句，却需要排比，才能释放我内心的情绪。将你写在笔下，将你印在心里，爱你今生不犹豫！</p><p>30、一点相思几时绝，二月十四表心意，三生有幸遇见你，四海之内有知音，五彩纷呈生活美；六弦琴奏心情爽，七星高照福运到，八面来风赞美你，九州真爱锁定你，十全十美爱上你！</p><p>31、浪漫的篇幅，记载爱情的轨迹；用绢秀的笔迹，写下生活的甜蜜；用朴实的修辞，编纂人生的幸福；用清新的语句，记录心灵的点滴。记下美好，让爱交融，让情交汇，让心相通，愿我们的爱情天荒地老，地久天长！</p><p>32、爱一个人要爱她的优点，爱她的缺点，爱她的骄傲，爱她的自卑。这个世界上最远的距离不是心与心的距离，也不是我在你的身边你却不知道我爱你，而是明明相爱却不能在一起。如果可以选择，我愿从未开始过。爱你不长，一生足矣！</p><p>33、世上有很多东西是可以挽回的，比如良知，比如体重。但不可挽回的东西更多，譬如旧梦，譬如岁月，譬如对一个人的感觉。在最有感觉的时候，你没有停下脚步，那么，也不必在一起走完那段路之后，回头去寻找那些散落在地上的感觉，毕竟路已经走完。</p><p>34、曾经以为自己再也找不到幸福，现在幸福就在我面前，而我的心又那么的忐忑不安，不知道自己是否能把握住这个幸福。小心翼翼的生活着，很怕有触碰到心底最深处。幸福在哪里？幸福住你心里。</p><p>35、相信爱情可以令一个人改变，是年轻的好处，也是年轻的悲哀。浪子永远是浪子。令男人改变的，也许是上帝的爱或者佛祖的慈悲，但绝对不会是女人。往往不是女人改变一个浪子，而是女人在浪子想改变的时候刚好出现。</p><p>36、想着你的靓丽面庞，写下那些快乐时光，走过的浪漫旅程，留下美好回忆冥想，爱你的柔情似水，记下我的情意绵长，曾经的快乐在笔下延伸，未来的幸福在脚下延伸。愿和你携手今生，创造属于我们的幸福！</p><p>37、相识时的懵懂羞涩、相知时的心心相印、热恋时的甜蜜回忆，艰难时的风雨同舟，每一页、每一篇都写满了快乐的回忆。每一天的日子因为有了你而充满了精彩。牵着你手共同走过幸福的人生，一起奋斗创造幸福的未来。遇到你是今生最大的幸福。</p><p>38、天涯芳草实无数，不想却被你迷住，一片真情无处诉，偏偏对你倾注，愿月老把我俩拴住，早日把你手牵住，扎根你心深处。天荒地老，我心如故，愿咱俩相处和睦，踏上幸福道路！</p><p>39、温馨晕染扉页，真情流淌笔端，点点文字快乐排列，句句话语幸福流溢，段段美文甜蜜相连，篇篇华章浪漫萦绕。描绘美妙，镌刻美好，我愿和你心手相牵，一起写下属于我们的烂漫爱情。</p><p>40、我们的玩笑在跳跃，我们的思念在流淌，我们的努力还温暖，我们的成功在闪光。亲爱的，有你的每一天都是一篇爱的日记，用心写，用情描，用爱续，永珍藏。</p><p>41、时间是链子，快乐是珠子，用链子串珠子挂在胸前就可以幸福一辈子；幸福是石子，时间是筛子，用筛子筛掉小沙子，石子就会陪你一辈子。</p><p>42、云也走风也走，躲到山的那一头；你也走我也走，情不自禁手牵手；情也走爱也走，小船水面荡悠悠；甜瓜瓜喂一口，丝丝甜进你心头。</p><p>43、你是我仰慕的冒号，恰似秋日里金色的缠绵，想说的话说不完：我会用一生读懂你的婀娜妩媚馨香灿烂，仲秋景旖旎，秋露滴凤鸾，一任秋风凉，风雨肩并肩。</p><p>44、两个相爱的人在一起是一种快乐，幸福。因为不易所以才应该更加去珍惜，不要到失去的时候才懂得。同样，爱需要包容，记得有这样的一句话，彼此相爱的人，他们的心是彼此最温暖的。</p><p>45、爱情的最高境界，不是一方为另一方无休止的付出以换取回报，而是你丰富了我的生命，我也丰富了你的生命。我们相遇之前是两个人。相遇之后，不是变成一个，而是一个半。我把一半留给自己，那样我才可以更清醒的去爱你。</p><p>46、不知道爱可以停留多久，只想你心永远逗留，一点一点把你读透，一遍一遍深刻体验；不知道情可以温暖多久，只想双手永远紧扣，一分一秒把你思念，一天一天我在加油！</p><p>47、有一片天，为你晴；有一朵云，为你飘；有一叶草，为你绿；有一枝花，为你笑；有一弯月，为你走；有一段情，为你留。亲爱的，想你。</p><p>48、绿叶不向红花说去留，却朝夕相伴；星星不向蓝天说原因，却始终耀眼；正如我不想你说多远，却永远思念；亲爱的，想你了！</p><p>49、将爱放心底，把缘分倍加珍惜；将思念藏心里，酝酿芳香的记忆。无眠的夜是一曲甜蜜的旋律，绵绵无尽的思念证明爱的魔力，很想你！</p><p>50、莫问今夕是何夕？思念不止在今夕，每逢牵挂在夜夕，辗转反侧在遥夕，期待相约在佳夕，祝福发于此刻兮，祝快乐在朝夕，幸福无穷夕。</p><p>51、睁开眼睛，你在脑里跑来跑去；闭上眼睛，你在眼前晃来晃去；走在路上，感觉你我形影不离；躺在床上，你的甜蜜在心中回味。很想你</p><p>52、情浓意浓，所有的思念，化作在无边的等待中。你侬我侬，所有的语言，融在了温暖的问候中。月圆月半，所有的爱恋，存在于彼此的心中。爱你永不变。</p><p>53、花装饰着春天，月装饰着夜空，你装饰着我的思念。白天你开启我的记忆，晚上你回旋我的梦里，我是一刻也忘不了你，亲爱的宝贝，想你，爱你。</p><p>54、我们的双手相牵就不再分开，我们的拥抱只给人温暖安心，我们的誓言一起走到两鬓斑白步履蹒跚，我们约定每一个来生都要相伴。亲爱的，我觉得我很幸福。</p><p>55、雨绵绵，情依依，天天思念你；月朦朦，情深深，对你情意真；天蓝蓝，情切切，一切都如愿。愿我的思念带给你幸福无限！</p><p>56、思念汇成网，心有千千结，此情不关风与月，只因你不在身边。想念你的一切，无论黑夜或白天，只想诉说我心愿：和你共度岁岁又年年！</p><p>57、爱一个人就是让那人的名字在临终之际成为你双唇间最后的音乐，美丽的天空，夺目的你，我的眼里只有你！温暖的春天，可爱的你，我的心在挂念你！轻轻的微风，远处的你，我的心里在想你。（网）</p><p>58、爱一个人就是上一刻钟想把美丽的恋情像冬季的松鼠密藏坚果那样，将之一一放在最隐藏最安妥的树洞里，下一刻钟却又想告诉全世界这骄傲自豪的消息</p><p>59、当你在我身边的时候，我会忘记世界上的一切，因为你几乎就是一切，没有人能替代你，当我的手牵着你的手的时候，你不会知道，我有多满足！</p><p>60、留一个特别的座位给你，在我怀里；留一道特别的风景给你，在我眼里；留一个特别的思念给你，在我脑海里；留一次特别的爱给你，在我心里。</p><p>61、我在梦中一遍遍呼唤你的名字，是你带着我闯进了你的爱情列车，为了你我关上了所有的门窗，贴上了你的标签，拒绝别的春天坚守这份美好的感情！</p><p>62、我一直在等待，不管是在意仲夏的夜还是墙红柳绿的窗口。</p><p>63、一颗流星划过天际，我错过了许愿；一朵浪花溅在岩石，我错过了祝福；一个故事说了一遍，我错过了聆听；一段人生只走一回，我不能错过你！？</p><p>64、一千朵玫瑰给你，要你好好爱自己；一千只纸鹤给你，让烦恼远离你；一千颗幸运星给你，让好运围绕你；一千枚开心果给你，让好心情找到你；祝你永远快乐。？</p><p>65、我要说思念是一种忧伤的甜蜜，总是让人在无休止的煎熬中品味那份幸福，有时候能去安静的想一个人，也是非常不错的。我想此时此刻的你在干什么，是否也在发呆，是否也在想我，爱你。</p><p>66、恋着你，恋着你的明眉皓齿，恋着你的温文尔雅，恋着你的万分柔情。娶你将是我一生最大的幸福。</p><p>67、我为你掬一方清晨的水，妆点你红润的素颜，耳边回荡着那句我爱你！我在梦中思念，那2700多年的岁月等待，我拒绝喝孟婆汤只是为了和你再续前缘。</p><p>68、我学会了自己寻找乐趣，我倾听空谷的松涛，或仰视海鸥的欢鸣。桥洞下的黑夜以及溪水旁边的忧郁。都在尘世中起起伏伏，今夜，我只属于自己，可是我并没有忘记你的容颜，我始终坚信我会和你再续前缘。</p><p>69、我决定把你每一世的容颜都刻印在我的脑海，打乱所有关于诗的平仄，弹一首无韵的曲调。不愿意再看红绿缀动，佳人婆娑。也不想再写许多a href=&quot;http://www.jiyifa.com/shanggan/&quot;target=&quot;_blank&quot;&gt;伤感的词调，故作清高的多情，换你嘴角的几许浅笑。</p><p>70、只要有一丝希望我就绝不放弃希望！我就是一个不轻易认输！不轻易放弃希望的人！所以我一直在拼搏在努力！自从与你相爱以来我就有了梦想！你就是我最大的梦想！？</p><p>71、时间在指尖中流逝，万物在雨露下滋长，星辰在昼夜里交替，我们在理想上行走。快乐与困苦交织，新生伴随老死，让我们珍惜眼前，相拥永远。？</p><p>72、没有你的信息，日子过得特别平淡；没有你的信息，时间总是特别漫长；没有你的信息，阳光不再如以往的灿烂；没有你的信息，春天也失去了鸟语花香！？</p><p>73、爱你，却无欲无求，好难！爱你，却偷偷摸摸，好累！爱你，却让我心碎，好惨！爱你，我心甘情愿，好甜！爱不是目的，目的是疼你一辈子！？</p><p>74、我们笑的都很甜，就像我们浪漫的誓言，明明只是分开一瞬间却又开始了想念，没有流星的花园，我们就坐在街道边，因为只要和你在一起就是我今生最大的幸福。？</p><p>75、在这浪漫的夜，在这下雨的夜，让雨水代替我亲吻你的脸，对你有种很奇妙的感觉，是一种甜蜜的幸福，是一种快乐的诠释，是一种只属于我们的爱的陶醉。？</p><p>76、我发现我一刻也离不开你了，真想，举起一杯红酒，为你而醉！拿起一束鲜花，为你祝福！捧着一颗挚诚的心说声：我真心爱你！？在茫茫人海中，能够与你相遇相知相恋，是我一生中最大的梦想，让我将我的梦想实现，让我将你的影子深深的刻划在我的心中，我无法忘记！</p><p>77、一份喜悦让你天天快乐；一份问候让你没有烦恼；一份真心不要回报；一份真情让你样样都好；一份爱只要你幸福！？遇上你是今生的缘份，爱上你是我今生的幸福，守护你是我今生的选择，为你我今生无怨无悔，爱你一生不变！？</p><p>78、爱一个人，就是想听见他的声音；爱一个人，就是想看见他的脸庞；爱你，不需要用华丽的语言修饰；爱你，藏在我心里，暖在你心！？请你想起我的名字，在你缺少安慰的时候我要你记得，我就是那个时刻惦念你的人，我就是那个，关心你的人，我就是喜欢你的人！</p><p>79、爱是我的灵魂，笔便是灵魂的作俑者，让满心的爱恋，在枯瘦的笔下炫舞飞扬，飞进你的梦境，飞进你的心间。</p><p>80、掬一丝清风，挽一束月光，采一星闪烁，把温情的话语，让它们捎给天涯海角的你。</p><p>81、朦胧中，千里之外，烟雨中藏着你那爽朗的笑，深情款款向我招手示意。你的魔力是让我魂绕梦牵，无形中让我心甘情愿地被你打倒。你的影子在心中始终徘徊不去，也许只是一个小小的触动，情感的阀门就会再次被打开，波涛汹涌无法自制。</p><p>82、你眸光流转，会心一笑，胜过千万句对白；你真情传递，脉脉不语，胜过万语千言。你温柔的情怀，让我一次次被俘虏和吞噬，更让我懂得珍惜，懂得坚韧和幸福。你永远是我这辈子心中最深的印迹，你曾经传递给我的点滴，我都会铭记。</p><p>83、你早已占据了我的整个心海，你已在我的心海里踏浪而至，抵达心中那份柔软处。你曾经给我的美好无法忘记，没有什么比一份纯正的爱恋更加让人回味。</p><p>84、我不得不承认，我始终没能将你忘记，你一直在我心里，没有走远，多么刻意的伪装都骗不了自己。我的心脏不停地工作和运输，让血液遍布到每根血管，让我体会到你的魅力。</p><p>85、我在努力学着适应没有你的生活，可是内心却好像再也回不到以前的平静。相隔千里，天各一方，不管你的心里还会不会记起我，我都会依然对你痴心不改。</p><p>86、想起你，我的心中是丝丝阵痛，但痛楚之中更有一份无法舍弃的甜蜜。心中那抹不掉的记忆，永远绽放着青春的笑靥，你是我想要永远牵手的那个人。</p><p>87、在你的梦中行走，曾经的一个不小心，让我醉在了有你的梦里，是你，挽救了我那颗受伤的心。最痛的距离，就是无法相守，自从与你相遇，我便知道了相知相守是多么令人奢望和不易的。</p><p>88、没有你的信息，日子过得特别平淡；没有你的信息，时间总是特别漫长；没有你的信息，阳光不再如以往的灿烂；没有你的信息，春天也失去了鸟语花香！</p><p>89、长夜漫漫心无眠、思念的人何时还、睡凉的床头枕干了泪、梦里叫你误失几回；夜很静很静、静的心都难眠；思很痛很痛、痛的如火宴；爱你像喷射火山！</p><p>90、爱你，却无欲无求，好难！爱你，却偷偷摸摸，好累！爱你，却让我心碎，好惨！爱你<em>我心甘情愿</em>好甜！爱不是目的，目的是疼你一辈子！</p><p>91、我们笑的都很甜，就像我们浪漫的誓言，明明分开一瞬间却又开始了想念，没有流星的花园，我们就坐在街道边，因为只要和你在一起就是我今生最大的幸福</p><p>92、在这浪漫的夜，在这下雨的夜，让雨水代替我亲吻你的脸，对你有种很奇妙的感觉，是一种甜蜜的幸福，是一种快乐的诠释，是一种只属于我们的爱的陶醉。</p><p>93、弃不断，思成狂，满腔愁絮起；雨雪绵，寒似骨，心乱接千结；忘不掉，悔恨迟，烦恼愁绸稠，泪也苦，欢也笑，一切心而生；情所起！</p><p>94、君若扬路尘，妾若浊水泥，浮沉各异势，会合何时谐？</p><p>95、玲珑骰子安红豆，入骨相思知不知。</p><p>96、入我相思门，知我相思苦，长相思兮长相忆，短相思兮无穷极。</p><p>97、思君如流水，何有穷已时。</p><p>98、相恨不如潮有信，相思始觉海非深。</p><p>99、纵然有百万个理由离开你，我也会寻找一个理由为你留。</p><p>100、我已经习惯了你的冷落，可是我却不能冷落你。因为我害怕失去你的世界，即使我感到孤单，我也不会说我难过。假如每次想起你我都会得到一朵鲜花，那么我将永远在花丛中徜徉。</p><p>由香港著名导演陈可辛执导的电影《中国合伙人》浓缩了一代人的a href=&quot;http://www.jiyifa.com/lizhi/chuangye/&quot;target=&quot;_blank&quot;&gt;创业历程与不同的成长经历，不同时代的人观影之后可能会有不一样的感受，也许你看到的是电影中几个主人公为梦想一起拼搏的那股劲儿，也许你想到的是那已经失去的青春岁月，也许还有那时纯洁到称兄道弟的友谊……但无论如何，作为一部电影，经典的台词是它最先打动观众的闪光处。——写在前面</p><p>1、年轻的时候，不该什么都不想，也不能想太多。想得太多会毁了你，我相信这话。成功路上最心酸的是要耐得住寂寞，熬得住孤独，总有那么一段路是你一个人在走，一个人坚强和勇敢。也许这个过程要持续很久，但如果你挺过去了，最后的成功就属于你。</p><p>2、千万别跟丈母娘打麻将,千万别跟想法比你多的女人上床,千万别跟好朋友合伙开公司。</p><p>3、——成功者都是不约而同地配合时代的需要——谁说的？——卡耐基——诶，你不是说他是骗子吗？——最大的骗子，其实是我们自己，因为我们总是想改变别人，而拒绝改变自己。</p><p>4、到底是我们改变了世界还是世界改变了我们!</p><p>5、We are too young too naive.（我们太年轻也太天真了。）</p><p>6、如果额头终将刻上皱纹,你只能做到,不让皱纹刻在你心上。</p><p>7、有些事情只有停下来才能看那清楚。总有些更重要的事情赋予我们打败恐惧的勇气。</p><p>8、爱情就像录像机,有时候要按快进,有时候要按暂停,生活也一样。</p><p>9、我们只有在失败中寻找胜利，在绝望中寻求希望。</p><p>10、其实我们追求的不是成功，而是自己的尊严。</p><p>11、掉在水里你不会淹死，呆在水里你才会淹死，你只有游，不停的往前游。</p><p>12、女生找男生，如果只看长相那叫好色，如果男生跟女生，如果只看长相，那是审美！</p><p>13、Now Chinese Students abroad donot want to stay in the UnitedStates,but would like toreturn to China.（现在的中国留学生都不想要呆在美国，但想回到中国。）</p><p>14、我们改变不了世界，是世界改变了我们。</p><p>15、成东青说，我不知道成功的公式，但是我知道当你在梦想的前进的道路上感到了曲折，那么你已经走在了成功的笔直的大道上。</p><p>16、假如生活欺骗了你，你也要欺骗回生活。</p><p>17、曾经我一直追求与众不同的，可是到后来才发现，大多数人的平凡的选择才是最好的。</p><p>18、真正的感情它自己会安安静静的来，一点都不折腾。</p><p>19、我们这代人最重要的是，最重要的是——死缠烂打。</p><p>20、有些事情只有停下来才能看清楚，总有些更重要的事情赋予我们打败恐惧的勇气。</p><p>21、What do you think of the USA？（你认为美国怎么样？）美国人民需要我！</p><p>22、如果说把a href=&quot;http://www.jiyifa.com/waiyu/&quot;target=&quot;_blank&quot;&gt;u&gt;英语比成肩头的鸟,那过了四级你肩上就有四个鸟,过了六级就有六个鸟,过了八级你就有八个鸟……过了托福那你……就是个鸟人、</p><p>23、对他们而言你是个英雄式的人物，但对我而言，你就是个窃贼！</p><p>24、男人的梦想最初都是从女人开始的。</p><p>25、Do you have a dream?（你有梦想吗？）春梦算吗？</p><p>26、为什么是你？---为什不能是我？你现在还是一个失败者吗？——我他妈至少奋斗过。</p><p>27、你不需要知道我说的什么，你要知道我没说什么。</p><p>28、当你意识到失败只是成功的弯路的时候，你就已经成功了一半。</p><p>29、成功者总是不约而同的配合着时代的需要。</p><p>30、一个母亲花20年把一个男孩养成一个男人，到时其她女人手里，20分钟就能把他变成一个傻子。</p><p>31、实践才是检验真理的唯一标准。</p><p>32、我告诉你，这个船开出去它停不了，它只能往前。</p><p>33、告诉我，你现在还是一个失败者吗？</p><p>34、其实我们追求的不是成功而是自己的尊严。</p><p>35、你要是不答应我，我就拉你一起跳湖。</p><p>36、我没有装孙子，我真的是孙子！</p><p>37、你除了拿麻袋装钱还会干什么？</p><p>38、在你眼里我从来都是一傻逼。</p><p>39、继上次钻了美国大爷的空子，这次他又要来钻国家的空子。</p><p>40、我在美国做什么，你知道吗？我连一个WAITER我都不是。</p><p>41、你们还是和30年前一样,只会中国人打中国人,你们应该去学习打你的人,只有这样才能变的更强,才能战胜他。</p><p>42、牛逼就别再回来，永远别再回来！</p><p>43、街上卖鸡蛋的都比你挣得多，要不然你跟我合伙吧，有鸡吃我就干。</p><p>44、他不敢冒险，因为他害怕失败，害怕变回那个失败者，因为他配不上今天的成功。</p><p>45、有一天，你可能会变成让我都妒忌的人。</p><p>46、有这样一种女生，你没开口她已经拒绝了你。</p><p>47、爱情就像录像机,有时候要按快进,有时候要按暂停,生活也一样。</p><p>48、勇气是抵御恐惧，把握恐惧，而不是没有恐惧。</p><p>49、美国人永远不懂，中国的英雄是可以跪的，甚至可以从别人的胯下钻过去。</p><p>50、我们这代人最重要的是改变，改变身边每个人，改变身边每件事，唯一不变的就是此时此刻的勇气，如果我们能做到这点，我们将改变世界。</p><p>51、有些事情只有停下来才能看清楚，总有些更重要的事情赋予我们打败恐惧的勇气。</p><p>52、我们只有在失败中寻找胜利，在绝望中寻找希望。</p><p>53、掉在水里你不会淹死，呆在水里你才会淹死，你只有游，不停的往前游。</p><p>54、梦想是什么，梦想就是一种让你感到坚持就是幸福的东西。</p><p>55、真正的感情是安安静静的就会来的，一点都不折腾。</p><p>56、去向那个打你的人去学习，直到你变得比他更强。</p><p>57、梦想是什么，梦想就是一种让你感到坚持就是幸福的东西!</p><p>58、我们谈了太多的思潮、主义、方法，为什么？因为我们都想找到一个现成的答案，我们都希望有人能告诉我们应该怎么样去生活，其实呢，没有人能够告诉我们应该怎么样去生活，生活是自己的，我们自己提出的问题应该由自己来回答，所以我认为，我们这代人，最重要的是：改变。</p><p>59、小姐心态，寡妇待遇，妇联追求。</p><p>60、从前我只想过一种生活，那就是跟别人不一样的生活，现在我才知道，大多数人所选择的，才是最值得的。真正的爱情，是安安静静就来的，一点儿都不折腾。</p><p>你的一生我只借一程，没有花前月下，没有海誓山盟，心灵超越时空，传递遥远的叮咛，我们以另一种方式结伴同行，任思念的长春藤爬满心城，越过千山万水，去缀满彼此的星空，不让遥远的距离，荒芜我们共同的梦。</p><p>每天给自己一个希望，试着不为明天而烦恼，不为昨天而叹息，只为今天更美好。幸福不是给别人看的，与别人怎样说无关，重要的是你自己心中充满快乐的阳光，也就是说，幸福掌握在自己手中，而不是在别人眼中幸福是一种感觉，这种感觉应该是愉快的，使人心情舒畅，甜蜜快乐的。</p><p>一、生活就像淋浴，方向转错，水深火热。</p><p>二、单身至今的原因：熟人不好下手，生人不好开口。</p><p>三、目前的社交状况：生死之交遍布天南海北，同城找不到人约饭。</p><p>四、遇到喜欢的人就大胆去追，追不到怕什么，重在参与嘛。</p><p>五、不想洗衣服怎么办。取个媳妇就可以了，如果媳妇贤惠，就给你洗衣服了；如果媳妇彪悍，你就学会洗衣服了。</p><p>六、不当家不知柴米贵，不拍照不知自己肥。</p><p>七、一直坚信自己会瘦，现在只是胖着玩玩，可没想到玩着玩着就嗨了。</p><p>八、都说婚姻是爱情的坟墓，可是如果没有房子，你连坟墓都进不去。</p><p>九、现在银行卡我连密码都不想设置了，用六位数字去保护两位数的存款，想想都心累。</p><p>十、大多数人目前的状态就是，学不进去，玩不痛快，睡不踏实，浑身不对劲，吃的特别多。</p><p>十一、父母忽悠孩子叫教育；孩子忽悠父母叫欺骗；互相忽悠叫代沟。</p><p>十二、为什么要提醒我“钱不是万能的”？我才没那么贪心呢。我只想要钱而已，就没指望它万能。</p><p>十三、如果你觉得自己，整天累得跟狗一样。你真是误会大了，狗都没有你这么累。</p><p>十四、本想一口一口吃掉忧愁，没曾想却一口一口吃成肉球。</p><p>十五、你长得这么漂亮，首先要感谢你的爸妈，要不是他们给了你一双巧手，你能把自己P得这么美吗？</p><p>十六、我的人生目标是三十岁时，在北京拥有一套自己的房子。现在我的目标已经实现一半了：我已经三十岁了。</p><p>十七、世界上两件事最难：一是把自己的思想装进别人的脑袋，二是把别人的钱装进自己的口袋。前者成功了叫老师，后者成功了叫老板，两者都成功了叫老婆。</p><p>十八、冬天有三好：外面好冷，衣服好贵，我好穷。</p><p>十九、有的家庭，几根面条就能撑起热腾腾的日子；有的家庭，一堆金币反而把日子折腾得七颠八倒。</p><p>二十、为什么有的男生撩着撩着突然就不理你了，大面积撒网，选择性捕捞，你被放生了。</p><p>二十一、不努力的女生，会有买不完的地摊货，逛不完菜市场。努力的女生，你就没时间逛地摊，因为你只能加班叫外卖逛淘宝！</p><p>二十二、当生活中遇到倒霉的事情，千万不要沮丧，打起精神来，你要相信，更倒霉的还在后头。</p><p>二十三、别沮丧了。虽然你不曾拥有一场说走就走的旅行，但至少还有一个说胖就胖的体型。</p><p>二十四、生活不易，也不要借酒浇愁，难过了就早点睡觉，酒也得花钱，能省一瓶是一瓶。</p><p>二十五、女人一定要对自己好一点。一旦累死了，就会有别的女人花你的钱，住你的房，睡你的老公，打你的娃！</p><p>二十六、你要记住，无论最后我们疏远成什么样子，一个红包，就能回到当初。</p><p>二十七、人生没有彩排，每天都是直播；不仅收视率低，而且工资不高。</p><p>二十八、为啥到了婚龄就该结婚，到平均寿命就该死吗？</p><p>二十九、人干点好事儿总想让鬼神知道，干点坏事儿总以为鬼神不知道，我们让鬼神太为难了。</p><p>三十、能用钱解决的问题都不是问题，但，如何有钱才是你最大的问题。</p><p>1、等你生活中真有了生老病死这样的大事,才会知道自己以前半夜的忧伤都是狗屁。</p><p>2、如果你太在意别人的看法,那么你的生活将变成一件裤衩。别人放什么屁,你都得接着。</p><p>一针见血的搞笑说说：活着,总有看不惯的人,就如别人看不惯我们</p><p>3、那些在背后对你说三道四捏造故事的人无非就三个原因:没达到你的层次;你有的东西他没有;模仿你的生活方式未遂。</p><p>4、有时候不逼自己一下,你永远不会知道你到底有多大潜力。除了坚持,就是坚强!</p><p>5、信任,就是哪一天你拿着枪指着我,最后枪响了,我也相信那是枪走火。</p><p>6、你不快乐是因为:你可以像只猪一样懒,却无法像只猪一样,懒得心安理得。</p><p>7、不要去羡慕人家过得有多好,抱怨自己的生活有多糟,因为你永远也不知道别人背后隐藏着多少泪水,人人都有故事。</p><p>8、看清一个人又何必去揭穿,讨厌一个人又何必去翻脸。活着,总有看不惯的人,就如别人看不惯我们。</p><p>9、说出口的伤痛都已平复,绝口不提的才触及心底。</p><p>10、你喂狗三日,它记住你三年,你善待人三年,他三天就能忘记你,很多时候,有的人不如狗。</p><p>1、别说王子有多爱灰姑娘,才隔了一晚就TM忘记长啥样要靠水晶鞋</p><p>2、你若安好,备胎到老</p><p>毒死人的搞笑说说：想做什么就放心大胆去做,反正会后悔</p><p>3、总有一天,你会遇见一个好男孩,不需要你胸大,不需要你腿长,不需要你脸小,也不需要你长得漂亮——他不需要你</p><p>4、只要坚持下去,总会有失败的一天。</p><p>5、公主病的成因就两个:不是长得丑就是穷。那又漂亮又有钱的呢?别逗了,那不是病,那就是公主。</p><p>6、如果你的男朋友对你百依百顺,从不拈花惹草。可能是因为他钱不够。</p><p>7、你必须非常努力,才能相信自己真的是无能为力</p><p>8、想做什么就放心大胆去做,反正会后悔。</p><p>9、注重细节,从小事做起,因为你也做不了大事。</p><p>10、虽然你已经没法再长高,但是!你可以继续胖啊</p><p>1、别听那些边抠脚边绞尽脑汁编心灵鸡汤的人告诉你应该怎么活着,说人生意义不在于赚了多少钱的不是巨有钱就是穷。只追求精神境界大多肉体不中看</p><p>2、很多年纪大还一事无成的长辈喜欢在年轻人面前吹牛逼。对于这种人,我们要尊敬。因为我们不仅同样一事无成,而且还是晚辈。</p><p>3、那些所谓的各种梦想,用通俗的语言讲无非是”多挣点儿钱”。</p><p>毒鸡汤的搞笑说说;赶快来喝点吧</p><p>4、每天夜里下定决心从明天开始改变,好好生活努力奋斗,第二天中午在被窝里翻个身:操,改天吧。</p><p>5、年轻人如果不知道自己想过什么样的生活,要成为什么样的人,那就先以世俗的看法来作为标准。一定不会错得太远。</p><p>6、每个人都以为自己与众不同,其实很容易分门别类。你没有什么不同的,你和你差不多环境成长的人基本都是一样的。</p><p>7、很多人说自己没钱但很幸福,是因为他们没尝过有钱又幸福的滋味。</p><p>8、总是觉得过去的自己很傻逼,其实再过一段时间,你就会发现,现在的你也很傻逼。</p><p>9、你知道吗?全世界的人口总数是奇数,这意味着,总有一个傻逼注定要单身。</p><p>10、又一年了,其实大家心里都清楚,明天不会是一个更新的自己,只会是一个更老的自己。</p><p>11、世上99%的事情都能用钱解决,剩下的1%,需要更多钱解决。</p><p>12、上帝是公平的,给你了丑的外表,还会给你低的智商,以免让你显得不协调。</p><p>1、善良是很珍贵的，但善良没有长出牙齿来，那就是软弱。——柏邦妮《奇葩说》</p><p>2、其实，每个人的心中都有一匹欲望的野马。你可以去放养它，也可以去圈养它驯养它。但是不要假装它不存在，排斥它。我们每个人都应该自由的，骄傲的活出个生机勃勃的生命。——柏邦妮《奇葩说》</p><p>3、没有逻辑的正能量就是负能量。——马薇薇《奇葩说》</p><p>4、手段不够硬，身段就要软。——马薇薇《奇葩说》</p><p>5、在爱你的过程中，有些人变成更强壮更智慧的自己，故而一念成佛，有些人变成更猥琐更不堪的自己，一念成魔。在爱的过程中，是佛是魔，历尽你给我的百劫千难，最后我终于找到了我。——马薇薇《奇葩说》</p><p>6、很多时候我们都鼓励自己说我们要做最真实的自己，但很多时候最真实的那个自己，往往是你最放肆，你也最瞧不起的那个自己。——肖骁《奇葩说》</p><p>7、我愿意有这样的一个人，让我爱上她;让我不再计较得失;让我不再心猿意马;让我不再随波逐流。因为我知道当我爱上她的那一刻我就已经遇见了最好的自己。——肖骁《奇葩说》</p><p>8、长点心，要点脸——肖骁《奇葩说》</p><p>奇葩说</p><p>奇葩说</p><p>9、午夜梦回，枕边人不是心上人，心上人已是梦中人。——艾力《奇葩说》</p><p>10、你可以一天整成一个范冰冰，但你不能一天读成一个林徽因。——姜思达《奇葩说》</p><p>11、歧视不单单是永远对你恶语相向，歧视也往往是在划分你我。我宁愿爸妈蒙在所谓幸福的鼓里，也不远让他们暴露在原野上，站在我的面前与万千猛兽为敌。——姜思达《奇葩说》</p><p>12、我不想用错误的道路去验证道路的错误——姜思达《奇葩说》</p><p>13、被误会是表达者的宿命，我们没有什么可抱怨的。——马东《奇葩说》</p><p>14、中国有一个成语叫刻舟求剑，我特别喜欢这个成语，因为我们即便对这个成语再熟悉，我们经常会容易成为那个人，我们特别容易忘记自己是在一条河上面，我们特别容易记得自己是在一条船上面。——马东《奇葩说》</p><p>15、句话说的太漂亮，让人喝彩：你以为你喜欢的人就是你喜欢的人吗，喜欢从来都是误会。——蔡康永《奇葩说》</p><p>16、幸福感的一个标准，是可不可以常常保持对不喜欢的事情说不要——蔡康永《奇葩说》</p><p>奇葩说</p><p>奇葩说</p><p>17、选择我爱的人是给自己制造伤口，选择爱我的人是给自己一副盔甲。——蔡康永《奇葩说》</p><p>18、一个真正文明的世界，不应该鼓励任何人，因为任何理由去羞辱任何的个体，即便是已经定了罪即将被送去服刑的罪犯法律也应该保护他最后的尊严——邱晨《奇葩说》</p><p>19、你要我为了你这棵树，砍尽所有森林，可是你不愿意相信，你是我茫茫林海中精心挑选的那一棵。你要我为了你这滴水，淘干所有的海洋，可是你拒绝相信，你是我弱水三千里面，情有独钟的那一瓢。——胡天语《奇葩说》</p><p>20、你爱他，他爱她，你瞎他也瞎，你俩大傻叉。——范湉湉《奇葩说》</p><p>21、暖男就是男人中的绿茶婊——范湉湉《奇葩说》</p><p>22、得不到的永远在骚动，得到的永远骚不动。——花希《奇葩说》</p><p>23、成长就是你主观世界遇到客观世界之间的那条沟，你掉进去了，叫挫折，爬出来了，叫成长。——罗振宇《奇葩说》</p><p>24、你是一颗星星，我是你旁边的那颗，我的整个轨迹被你影响，即使有一天你熄灭了变成了暗物质，你依然影响著我的轨迹，你的出现永远改变著我的星轨，无论你在哪里。——高晓松《奇葩说》</p><p>1、不开心，就算长生不老也没用，开心，就算只能活几天也足够！——《大话西游之月光宝盒》</p><p>2、凭你的智慧，我唬得了你吗？——《唐伯虎点秋香》</p><p>3、我打你应该，不打你悲哀！——《少林足球》</p><p>4、其实，我是一个演员。——《喜剧之王》</p><p>5、我左青龙，右白虎，老牛在腰间，龙头在胸口，人挡杀人，佛挡杀佛！——《唐伯虎点秋香》</p><p>6、你妈贵姓？——《大话西游》</p><p>7、能不能有点专业精神！——《喜剧之王》</p><p>8、鸡也有爱国的！——《济公》</p><p>9、神仙？妖怪？谢谢。——《大话西游》</p><p>10、一乡二里共三夫子不识四书五经六易竟教七八九子十分大胆，十室九贫尚且凑得八两七钱六分五厘四毫且三心二意一等下流。——《唐伯虎点秋香》</p><p>11、扫地只不过是我的表面工作，我真正地身份是一位研究僧（生）。——《少林足球》</p><p>12、飞是小李飞刀的飞，刀是小李飞刀的刀。——《国产凌凌漆》</p><p>13、贫僧乃少林寺方丈，法号梦遗。阿弥陀佛，我随风而来，随风而去。——《食神》</p><p>14、你想学？我教你。——《功夫》</p><p>15、聊得挺投缘，赔点医药费算了。——《功夫》</p><p>16、你喷我老婆，我不介意！以德服人，以德服人！——《方世玉》</p><p>17、人是人他妈生的，妖是妖他妈生的，只要你有一颗善良的心就不再是妖，是人妖？——《大话西游》</p><p>18、当你不能再拥有的时候，唯一可以做的，就是令自己不要忘记。——《东邪西毒》</p><p>19、就算是一条内裤一卷卫生纸也有它的用处。——《国产凌凌漆》</p><p>20、我一秒钟几十万上下，我会和你去踢球？——《少林足球》</p><p>21、想不到狮吼功还有一个大喇叭，小弟甘拜下风。——《功夫》</p><p>22、我对你的敬仰真是如滔滔江水，连绵不绝，又有如黄河泛滥一发不可收拾。——《鹿鼎记》</p><p>23、我一直在骗你你知道吗？骗就骗吧，就像飞蛾一样，明知道要受伤，还是会扑到火上——飞蛾就那么傻！——《大话西游之大圣娶亲》</p><p>24、你回火星吧，地球是很危险的。——《少林足球》</p><p>25、啊！师父的思维，果然天马行空仿如逆水行舟，厉害不愧以点子称王。——《算死草》</p><p>26、打雷啦！下雨啦！快收衣服啊！——《大话西游》</p><p>27、难道我学过如来神掌也要说给你听吗？——《功夫》</p><p>28、从现在开始你只准疼我一个，要宠我，不许骗我，答应我的每一件事都要做到，对我说的每一句话都要真心！——《河东狮吼》</p><p>29、跟着你，有肉吃。——《无极》</p><p>30、这种阵势，难道就是人称神雕侠侣的杨过、小龙女？——《功夫》</p><p>31、喜欢一个人需要理由吗？需要吗？不需要吗？需要吗？——《大话西游》</p><p>32、腰里挂着死耗子还冒充打猎的。——《功夫》</p><p>33、说好三年，三年之后又三年，三年之后又三年，都快十年了，老板！——《无间道》</p><p>34、我不管你是男是女，我只知道我好钟意你。——《金枝玉叶》</p><p>35、每个人都会经过这个阶段，见到一座山，就想知道山后面是什么。我很想告诉他，可能翻过山后面，你会发现没什么特别。——《东邪西毒》</p><p>36、长夜漫漫无心睡眠，我以为只有我睡不着，想不到晶晶姑娘你也……——《大话西游》</p><p>37、好！他想都不想就塞进去，不愧为一条荡气回肠的好汉子。我爱你！——《算死草》</p><p>38、悟空，你又顽皮了，怎么能这样跟观音姐姐说话呢？——《大话西游》</p><p>39、其实我是一个演员。——《喜剧之王》</p><p>01、这种阵势，难道就是人称神雕侠侣的杨过、小龙女？</p><p>02、聊得挺投缘，赔点医药费算了。</p><p>03、我左青龙，右白虎，老牛在腰间，龙头在胸口，人挡杀人，佛挡杀佛！</p><p>04、扫地只不过是我的表面工作，我真正地身份是一位研究僧（生）。</p><p>05、其实我是一个演员。</p><p>06、大什么大？哥什么哥？你有没有公德心啊！让不让街坊睡了！明天还要上班的。真是一群败类！</p><p>07、别以为你长得帅我就不打你。</p><p>08、我的真正身份是改变社会风气，风魔万千少女，提高青年人内涵，刺激电影市场，玉树临风的整人专家古晶，英文名字叫jing koo！</p><p>09、我就是美貌与智慧并重，英雄与侠义的化身——唐伯虎。</p><p>10、先生，你额有朝天骨，眼里有灵光，仙人转世，神仙下凡，我终于等到你了，不要走，虽然我泄露天机，灾怯难免，但是我命中注定，就算我要冒天大的危险，我也要给你看个全像。</p><p>11、碱水面没过过冷水，所以面里面全是碱水味。鱼丸也没有鱼味，但是你为了掩饰，特别加上了咖喱汁，想把它做成咖喱鱼丸。但这么做太天真了，因为你煮的时间不够，咖喱的味道只在表面上，完全没有进到里面去，放进汤里面鱼丸就被冲淡了。好好的一颗咖喱鱼丸，让你做得是既没有鱼味又没有咖喱味，失败！萝卜没挑过，筋太多，失败！猪皮煮得太烂，没咬头，失败！猪血又烂稀稀的，一夹就散，失败中的失败！最惨的就是大肠了，里面根本没洗干净，还有一坨屎，你有没有搞错？哎，有坨屎，哎，哎，有坨屎你看到了没有？哎，有坨屎！</p><p>12、难道我学过如来神掌也要说给你听吗？</p><p>13、他高傲，但是宅心仁厚，他低调，但是受万人景仰，他可以把神赐给人类的火，运用得出神入化，烧出堪称火之艺术的超级菜式，他究竟是神仙的化身？还是地狱的使者？没人知道，但是可以肯定，每个人都给他一个称号——食神！</p><p>14、想不到狮吼功还有一个大喇叭，小弟甘拜下风。</p><p>15、能不能有点专业精神！</p><p>16、阿水出了名的泡妞无数，是我们所有男人的眼中钉。他优雅的体态散发出诱人的魅力，让所有的少女都难以抗拒。他那双叫人心碎的眼睛，不管多么冷傲的女性，都会被他温柔的眼神所融化，他是众所公认的街坊情圣，行运茶餐厅的灵魂，谁都认识的蛋塔王子。</p><p>17、飞是小李飞刀的飞，刀是小李飞刀的刀。</p><p>18、腰里挂着死耗子还冒充打猎的。</p><p>19、我打你应该，不打你悲哀！</p><p>20、一乡二里共三夫子不识四书五经六易竟教七八九子十分大胆，十室九贫尚且凑得八两七钱六分五厘四毫且三心二意一等下流。</p><p>21、凭你的智慧，我唬得了你吗？</p><p>22、他武功的名堂呢，称之为九天十地，菩萨摇头怕怕，劈雳金光雷电掌！一掌打出，方圆百里之内，不论人畜、虾蟹、跳蚤，全部都化成了飞灰！</p><p>23、哇呀呀呀呀，好！实不相瞒，小弟我就是人称玉树临风胜潘安，一支梨花压海棠的小淫虫周伯通！</p><p>24、本来我要用这10元钱念书，当个医生、律师，但为了世界和平……唉。</p><p>25、古时有关云长全神贯注下象棋刮骨疗毒，今日有我凌凌漆聚精会神看a片挖骨取弹头。</p><p>26、你以为躲在这里就找不到你吗？没用的，你那样拉风的男人无论在哪，都像黑夜里的莹火虫那样的鲜明、那样的出众，你那忧郁的眼神，稀嘘的胡渣子，神乎其技的刀法，还有那杯dry martine，都深深的迷住了我。</p><p>27、啊！师父的思维，果然天马行空仿如逆水行舟，厉害不愧以点子称王。</p><p>28、打人都没力气，还说是黑社会？</p><p>29、喜欢一个人需要理由吗？需要吗？不需要吗？需要吗？</p><p>30、我一秒钟几十万上下，我会和你去踢球？</p><p>31、悟空，你又顽皮了，怎么能这样跟观音姐姐说话呢？</p><p>32、好，我告诉你，我小孩子的时候就见过飞碟了，就是世人所说的幽浮，不明飞行物体你懂不懂？4岁那年我又见过传说中的尼斯湖水怪，又跟喜玛拉雅山的大脚八聊过天猜过拳，再加上我从小到大每天早上都玩云霄飞车，下午就玩海盗船，因为上午玩海盗船，下午玩云霄飞车，黄昏再玩一次海盗船的也试过呀我告诉你。</p><p>33、诸葛亮：“我刚给鸽子洗了个澡……给它扇干……”周瑜说：“你就不怕它们着凉？”</p><p>34、善有善因，恶有恶报，天理循环，天公地道，我曾误抓龙鸡，今日皇上抓我，实在抓得有教育意义，我对皇上的景仰之心，有如滔滔江水绵绵不绝，又有如黄河泛滥，一发不可收拾。</p><p>35、越来越觉得，有一些人事物，朦着看就行了，因为当你看实了，就虚了。</p><p>36、周瑜：“这么冷的天还扇扇子？”诸葛亮：“我需要时刻保持冷静……”</p><p>37、贫僧乃少林寺方丈，法号梦遗。阿弥陀佛，我随风而来，随风而去。</p><p>38、从来没有试过这么清新脱俗的感觉，牛肉的鲜，撒尿虾的甜，混在一起的味道，竟然比“老鼠般”有过之而不及，正如比我的初恋更加诗情画意，所谓举头望明月，低头思故乡，好诗！好诗啊！</p><p>39、生我是副作用呀！你还不是享受那些制造过程嘛？</p><p>40、错！这并不是个普通的箱子，它是箱中之神，简称箱神！</p><p>41、你回火星吧，地球是很危险的。</p><p>42、人是人他妈生的，妖是妖他妈生的，只要你有一颗善良的心就不再是妖，是人妖？</p><p>43、鸡也有爱国的！</p><p>44、我对你的敬仰真是如滔滔江水，连绵不绝，又有如黄河泛滥一发不可收拾。</p><p>45、你妈贵姓？</p><p>46、除暴安良是我们做市民的责任，行善积德是我本身的兴趣，所以扶老太太过马路我每个星期都做一次，如果是碰到国定假日的话我还做两三次。</p><p>47、就算是一条内裤一卷卫生纸也有它的用处。</p><p>48、在这部戏里面，她充分表现出了一个被老公抛弃的妻子的唏嘘跟坎坷，不论是在眼神，表情以至动作、行为方面，她都能演的是丝丝入扣，入木三分，尤其最后摔掉那只马的动作，更加能够表现出后现代主义跟对这个社会的强烈控诉。</p><p>49、达文西：我找到了一份兼职工作，在中央精神病院所做研究工作。问：研究什么？达文西回答：被人研究！</p><p>50、我这么年轻就已经达到人生最高的境界，接着下来，除了结束自己的生命之外，我是无路可走了！</p>`,1154),i=[a];function u(h,r){return n(),t("div",null,i)}const l=p(e,[["render",u],["__file","gaoxiaotaici.html.vue"]]);export{l as default};
