export const data = JSON.parse("{\"key\":\"v-47f6a33c\",\"path\":\"/docs/books/%E7%94%A8%E4%B8%80%E5%B9%B4%E6%97%B6%E9%97%B4%E9%87%8D%E7%94%9F%EF%BC%9A%E5%A6%82%E4%BD%95%E4%BB%8E0%E5%88%B01%E5%BC%80%E5%90%AF%E4%B8%AA%E4%BA%BA%E4%BA%8B%E4%B8%9A-%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0.html\",\"title\":\"用一年时间重生：如何从0到1开启个人事业\",\"lang\":\"en-US\",\"frontmatter\":{\"0\":\"t\",\"1\":\"i\",\"2\":\"t\",\"3\":\"l\",\"4\":\"e\",\"5\":\":\",\"6\":\"用\",\"7\":\"一\",\"8\":\"年\",\"9\":\"时\",\"10\":\"间\",\"11\":\"重\",\"12\":\"生\",\"13\":\"：\",\"14\":\"如\",\"15\":\"何\",\"16\":\"从\",\"17\":\"0\",\"18\":\"到\",\"19\":\"1\",\"20\":\"开\",\"21\":\"启\",\"22\":\"个\",\"23\":\"人\",\"24\":\"事\",\"25\":\"业\",\"26\":\"-\",\"27\":\"读\",\"28\":\"书\",\"29\":\"笔\",\"30\":\"记\",\"31\":\" \",\"32\":\"d\",\"33\":\"a\",\"34\":\"t\",\"35\":\"e\",\"36\":\":\",\"37\":\"2\",\"38\":\"0\",\"39\":\"2\",\"40\":\"0\",\"41\":\"/\",\"42\":\"0\",\"43\":\"5\",\"44\":\"/\",\"45\":\"2\",\"46\":\"9\"},\"headers\":[{\"level\":2,\"title\":\"◆ 第一章 与其等待生活给你答案，不如自己去发现\",\"slug\":\"◆-第一章-与其等待生活给你答案-不如自己去发现\",\"link\":\"#◆-第一章-与其等待生活给你答案-不如自己去发现\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第二章 与其等世界发现你的价值，不如先为世界创造价值\",\"slug\":\"◆-第二章-与其等世界发现你的价值-不如先为世界创造价值\",\"link\":\"#◆-第二章-与其等世界发现你的价值-不如先为世界创造价值\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第三章 明确三年愿景，配置人生导航系统\",\"slug\":\"◆-第三章-明确三年愿景-配置人生导航系统\",\"link\":\"#◆-第三章-明确三年愿景-配置人生导航系统\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第四章 挖掘你的优势，设计个人事业最优路径\",\"slug\":\"◆-第四章-挖掘你的优势-设计个人事业最优路径\",\"link\":\"#◆-第四章-挖掘你的优势-设计个人事业最优路径\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第五章 制订专属年计划，开启个人事业\",\"slug\":\"◆-第五章-制订专属年计划-开启个人事业\",\"link\":\"#◆-第五章-制订专属年计划-开启个人事业\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第六章 自由人的工作生活整理术\",\"slug\":\"◆-第六章-自由人的工作生活整理术\",\"link\":\"#◆-第六章-自由人的工作生活整理术\",\"children\":[]},{\"level\":2,\"title\":\"◆ 第七章 新手如何开启个人事业\",\"slug\":\"◆-第七章-新手如何开启个人事业\",\"link\":\"#◆-第七章-新手如何开启个人事业\",\"children\":[]},{\"level\":2,\"title\":\"◆ 蜕变发生在重生年计划的这一年\",\"slug\":\"◆-蜕变发生在重生年计划的这一年\",\"link\":\"#◆-蜕变发生在重生年计划的这一年\",\"children\":[]},{\"level\":2,\"title\":\"◆ 重生，再次定义了我的未来\",\"slug\":\"◆-重生-再次定义了我的未来\",\"link\":\"#◆-重生-再次定义了我的未来\",\"children\":[]},{\"level\":2,\"title\":\"◆ 附录二 重生年计划优秀学员四维度打卡心得\",\"slug\":\"◆-附录二-重生年计划优秀学员四维度打卡心得\",\"link\":\"#◆-附录二-重生年计划优秀学员四维度打卡心得\",\"children\":[]}],\"git\":{},\"filePathRelative\":\"docs/books/用一年时间重生：如何从0到1开启个人事业-读书笔记.md\"}")

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
